const taweel = "الطويل";
const Madid = "المديد";
const BAS = "البسيط";
const Waf = "الوافر";
const Kamil = "الكامل";
const Hazraj = "الهزرج";
const Rajaz = "الرزج";
const Ramal = "الرمل";
const Sariaa = "السريع";
const Monsaih = "المنسرح";
const Khafif = "الخفيف";
const Modariaa = "المضارع";
const Moktadib = "المقتضب";
const Moj = "المجتث";
const Mot = "المتقارب";
const Motadarak = "المتدارك";

const kt1 = "صحيح(ة)";
const kt2 = "مقبوض(ة)";
const kt3 = "محذوف(ة)";
const Mkfofa = "مكفوف(ة)";
const mkta = "مقطوع(ة)";
const mkhb = "مخبون(ة)";
const Mksora = "مقصور(ة)";
const Mabtora = "مبثور(ة)";
const Mktofa = "مقطوفة دائما";
const Maaso = "معصوب(ة)";
const AHadd = "أحذ مضمر";
const Hadaa = "حذاء";
const Moda = "مذيل";
const Mora = "مرفل";
const MatW = "(مطوي(ة";
const MakB = "مخبول(ة)";
const MtMk = "مطوية  مكسوفة";
const Aslam = "أصلم";
const MtMwkof = "مطوي موقوف";
const MkhMksofa = "مخبولة مكسوفة";
const MMksor = "مخبون مقصور";
const Mksofa = "مكسوف(ة)";
const Mwkofa = "موقوف(ة)";
const MTachaite = "متشعث(ة)";
const MMkhbn = "محذوف ذخله الخبن";
const Abtar = "أبتر";

const ADDKhbn = "  ذخله(ا)  زحاف الخبن ";
const ADDTy = "  ذخله(ا) زحاف  الخبن ";
const ADDKbl = "  ذخله(ا)  زحاف الخبن ";

const Aila = "الزحاف الذي ذخل على البيت هو :";

const ManHo = "منهوك";
const Machto = "مشطور";
const Tam = "تام";
const Mj = "مجزوء";
const ShihM = "صحيح مذيل";
const Mosbak = "مسبغ";

/*العلل والزواحف */
const Aa = "الخبن";
const Ab = "الطي";
const Ac = "الخبل";
const Kap = "القبض";
const Kaf = "الكف";
const Asp = "العصب";
const Chakl = "الشكل";
const Kasf = "الكسف";
const Tachaite = "التشعيث";
const Edmare = "الإضمار";
function transform_to_json(data) {
  let result = [];
  data.map((elm) => {
    let a = elm;
    let b = "";
    let c = "";
    let d = "";
    let e = "";
    if (elm === "|.|.0.|.0.|.|.0.|.0.|.0.|.|.0.|.0.|.|.0.|.0.|.0") {
      b = " فَعُولُنْ مَفَاعِيلُنْ فَعُولُنْ مَفَاعِيلُنْ  ";
      c = taweel;
      d = kt1;
    } else if (elm === "|.|.0.|.|.|.0.|.0.|.0.|.|.0.|.0.|.|.0.|.0.|.0") {
      b = "فَعُولُ مَفَاعِيلُنْ فَعُولُنْ مَفَاعِيلُنْ  ";
      c = taweel;
      d = kt1;
      e = "العلة التي ذخلت على البيت هي :" + Kap;
    } else if (elm === "|.|.0.|.0.|.|.0.|.0.|.0.|.|.0.|.|.|.0.|.0.|.0") {
      b = "فَعُولُنْ مَفَاعِيلُنْ فَعُولُ مَفَاعِيلُنْ  ";
      c = taweel;
      d = kt1;
      e = "العلة التي ذخلت على البيت هي :" + Kap;
    } else if (elm === "|.|.0.|.|.|.0.|.0.|.0.|.|.0.|.|.|.0.|.0.|.0") {
      b = "فَعُولُ مَفَاعِيلُنْ فَعُولُ مَفَاعِيلُنْ  ";
      c = taweel;
      d = kt1;
      e = Aila + Kap;
    }

    /*مقبوضة */
    if (elm === "|.|.0.|.0.|.|.0.|.0.|.0.|.|.0.|.0.|.|.0.|.|.0") {
      b = "فَعُولُنْ مَفَاعِيلُنْ فَعُولُنْ مَفَاعِلُنْ  ";
      c = taweel;
      d = kt2;
    } else if (elm === "|.|.0.|.|.|.0.|.0.|.0.|.|.0.|.0.|.|.0.|.|.0") {
      b = "فَعُولُ مَفَاعِيلُنْ فَعُولُنْ مَفَاعِلُنْ  ";
      c = taweel;
      d = kt2;
      e = Aila + Kap;
    } else if (elm === "|.|.0.|.0.|.|.0.|.0.|.0.|.|.0.|.|.|.0.|.|.0") {
      b = "فَعُولُنْ مَفَاعِيلُنْ فَعُولُ مَفَاعِلُنْ  ";
      c = taweel;
      d = kt2;
      e = Aila + Kap;
    } else if (elm === "|.|.0.|.|.|.0.|.0.|.0.|.|.0.|.|.|.0.|.|.0") {
      b = "فَعُولُ مَفَاعِيلُنْ فَعُولُ مَفَاعِلُنْ  ";
      c = taweel;
      d = kt2;
      e = Aila + Kap;
    }

    /*محذوفة*/
    if (elm === "|.|.0.|.0.|.|.0.|.0.|.0.|.|.0.|.0.|.|.0.|.0") {
      b = "فَعُولُنْ مَفَاعِيلُنْ فَعُولُنْ مَفَاعِي  ";
      c = taweel;
      d = kt3;
      e = Aila + Kap;
    } else if (elm === "|.|.0.|.|.|.0.|.0.|.0.|.|.0.|.0.|.|.0.|.0") {
      b = "فَعُولُ مَفَاعِيلُنْ فَعُولُنْ مَفَاعِي  ";
      c = taweel;
      d = kt3;
      e = Aila + Kap;
    } else if (elm === "|.|.0.|.0.|.|.0.|.0.|.0.|.|.0.|.|.|.0.|.0") {
      b = "فَعُولُنْ مَفَاعِيلُنْ فَعُولُ مَفَاعِي  ";
      c = taweel;
      d = kt3;
      e = Aila + Kap;
    } else if (elm === "|.|.0.|.|.|.0.|.0.|.0.|.|.0.|.|.|.0.|.0") {
      b = "فَعُولُ مَفَاعِيلُنْ فَعُولُ مَفَاعِي  ";
      c = taweel;
      d = kt3;
      e = Aila + Kap;
    }
    /*البسيط ------------------------------------------------------------------*/
    /*البسيط التام */
    /*عروضه صحيحة */
    if (elm === "|.0.|.0.|.|.0.|.0.|.|.0.|.0.|.0.|.|.0.|.0.|.|.0") {
      b = " مُسْتَفْعِلُنْ فَاعِلُنْ مُسْتَفْعِلُنْ فَاعِلُنْ ";
      c = BAS + " " + "جاء هنا " + Tam;
      d = kt1;
    } else if (elm === "|.0.|.0.|.|.0.|.|.|.0.|.0.|.0.|.|.0.|.0.|.|.0") {
      b = " مُسْتَفْعِلُنْ فَعِلُنْ مُسْتَفْعِلُنْ فَاعِلٌنْ ";
      c = BAS + " " + "جاء هنا " + Tam;
      d = kt1;
      e = Aila + Aa;
    } else if (elm === "|.|.0.|.|.0.|.|.|.0.|.0.|.0.|.|.0.|.0.|.|.0") {
      b = " مُتَفْعِلُنْ فَعِلُنْ مُسْتَفْعِلُنْ فَاعِلُنْ ";
      c = BAS + " " + "جاء هنا " + Tam;
      d = kt1;
      e = Aila + Aa;
    } else if (elm === "|.|.0.|.|.0.|.|.|.0.|.|.0.|.|.0.|.0.|.|.0") {
      b = " مُتَفْعِلُنْ فَعِلُنْ مُتَفْعِلُنْ فَاعِلُنْ ";
      c = BAS + " " + "جاء هنا " + Tam;
      d = kt1;
      e = Aila + Aa;
    } else if (elm === "|.|.0.|.|.0.|.0.|.|.0.|.0.|.0.|.|.0.|.0.|.|.0") {
      b = " مُتَفْعِلُنْ فَاعِلُنْ مُسْتَفْعِلُنْ فَاعِلُنْ ";
      c = BAS + " " + "جاء هنا " + Tam;
      d = kt1;
      e = Aila + Aa;
    } else if (elm === "|.0.|.0.|.|.0.|.|.|.0.|.|.0.|.|.0.|.0.|.|.0") {
      b = " مُسْتَفْعِلُنْ فَعِلُنْ مُتَفْعِلُنْ فَاعِلُنْ ";
      c = BAS + " " + "جاء هنا " + Tam;
      d = kt1;
      e = Aila + Aa;
    } else if (elm === "|.|.0.|.|.0.|.0.|.|.0.|.|.0.|.|.0.|.0.|.|.0") {
      b = " مُتَفْعِلُنْ فَاعِلُنْ مُتَفْعِلُنْ فَاعِلُنْ ";
      c = BAS + " " + "جاء هنا " + Tam;
      d = kt1;
      e = Aila + Aa;
    } else if (elm === "|.0.|.0.|.|.0.|.0.|.|.0.|.|.0.|.|.0.|.0.|.|.0") {
      b = " مُسْتَفْعِلُنْ فَاعِلُنْ مُتَفْعِلُنْ فَاعِلُنْ ";
      c = BAS + " " + "جاء هنا " + Tam;
      d = kt1;
      e = Aila + Aa;
    } else if (elm === "|.0.|.|.|.0.|.|.|.0.|.0.|.|.|.0.|.0.|.|.0") {
      b = " مُسْتَعِلُنْ فَعِلُنْ مُسْتَعِلُنْ فَاعِلُنْ ";
      c = BAS + " " + "جاء هنا " + Tam;
      d = kt1;
      e = Aila + Aa + " و" + Ab;
    } else if (elm === "|.0.|.|.|.0.|.0.|.|.0.|.0.|.|.|.0.|.0.|.|.0") {
      b = " مُسْتَعِلُنْ فَاعِلُنْ مُسْتَعِلُنْ فَاعِلُنْ ";
      c = BAS + " " + "جاء هنا " + Tam;
      d = kt1;
      e = Aila + Ab;
    } else if (elm === "|.0.|.0.|.|.0.|.|.|.0.|.0.|.|.|.0.|.0.|.|.0") {
      b = " مُسْتَفْعِلُنْ فَعِلُنْ مُسْتَعِلُنْ فَاعِلُنْ ";
      c = BAS + " " + "جاء هنا " + Tam;
      d = kt1;
      e = Aila + Aa + " و" + Ab;
    } else if (elm === "|.0.|.|.|.0.|.|.|.0.|.0.|.0.|.|.0.|.0.|.|.0") {
      b = " مُسْتَعِلُنْ فَعِلُنْ مُسْتَفْعِلُنْ فَاعِلُنْ ";
      c = BAS + " " + "جاء هنا " + Tam;
      d = kt1;
      e = Aila + Aa + " و" + Ab;
    } else if (elm === "|.0.|.|.|.0.|.|.|.0.|.|.0.|.|.0.|.0.|.|.0") {
      b = " مُسْتَعِلُنْ فَعِلُنْ مُتَفْعِلُنْ فَاعِلُنْ ";
      c = BAS + " " + "جاء هنا " + Tam;
      d = kt1;
      e = Aila + Aa + " و" + Ab;
    } else if (elm === "|.|.0.|.|.0.|.|.|.0.|.0.|.|.|.0.|.0.|.|.0") {
      b = " مُتَفْعِلُنْ فَعِلُنْ مُسْتَعِلُنْ فَاعِلُنْ ";
      c = BAS + " " + "جاء هنا " + Tam;
      d = kt1;
      e = Aila + Aa + " و" + Ab;
    } else if (elm === "|.0.|.0.|.|.0.|.0.|.|.0.|.0.|.|.|.0.|.0.|.|.0") {
      b = " مُسْتَفْعِلُنْ فَاعِلُنْ مُسْتَعِلُنْ فَاعِلُنْ ";
      c = BAS + " " + "جاء هنا " + Tam;
      d = kt1;
      e = Aila + Ab;
    } else if (elm === "|.0.|.|.|.0.|.0.|.|.0.|.0.|.0.|.|.0.|.0.|.|.0") {
      b = " مُسْتَعِلُنْ فَاعِلُنْ مُسْتَفْعِلُنْ فَاعِلُنْ ";
      c = BAS + " " + "جاء هنا " + Tam;
      d = kt1;
      e = Aila + Ab;
    } else if (elm === "|.|.|.|.0.|.|.|.0.|.|.|.|.0.|.0.|.|.0") {
      b = " مُتَعِلُنْ فَعِلُنْ مُتَعِلُنْ فَاعِلُنْ ";
      c = BAS + " " + "جاء هنا " + Tam;
      d = kt1;
      e = Aila + Aa + " و " + Ac;
    } else if (elm === "|.|.0.|.|.0.|.|.|.0.|.|.|.|.0.|.0.|.|.0") {
      b = " مُتَفْعِلُنْ فَعِلُنْ مُتَعِلُنْ فَاعِلُنْ ";
      c = BAS + " " + "جاء هنا " + Tam;
      d = kt1;
      e = Aila + Aa + " و " + Ac;
    } else if (elm === "|.|.|.|.0.|.|.|.0.|.0.|.|.|.0.|.0.|.|.0") {
      b = " مُتَعِلُنْ فَعِلُنْ مُسْتَعِلُنْ فَاعِلُنْ ";
      c = BAS + " " + "جاء هنا " + Tam;
      d = kt1;
      e = Aila + Aa + " و " + Ab + " و " + Ac;
    } else if (elm === "|.|.|.|.0.|.|.|.0.|.|.0.|.|.0.|.0.|.|.0") {
      b = " مُتَعِلُنْ فَعِلُنْ مُتَفْعِلُنْ فَاعِلُنْ ";
      c = BAS + " " + "جاء هنا " + Tam;
      d = kt1;
      e = Aila + Aa + " و " + Ac;
    } else if (elm === "|.0.|.|.|.0.|.|.|.0.|.|.|.|.0.|.0.|.|.0") {
      b = " مُسْتَعِلُنْ فَعِلُنْ مُتَعِلُنْ فَاعِلُنْ ";
      c = BAS + " " + "جاء هنا " + Tam;
      d = kt1;
      e = Aila + Aa + " و " + Ab + " و " + Ac;
    } else if (elm === "|.|.|.|.0.|.0.|.|.0.|.|.|.|.0.|.0.|.|.0") {
      b = " مُتَعِلُنْ فَاعِلُنْ مُتَعِلُنْ فَاعِلُنْ ";
      c = BAS + " " + "جاء هنا " + Tam;
      d = kt1;
      e = Aila + Ac;
    } else if (elm === "|.|.|.|.0.|.0.|.|.0.|.0.|.0.|.|.0.|.0.|.|.0") {
      b = " مُتَعِلُنْ فَاعِلُنْ مُسْتَفْعِلُنْ فَاعِلُنْ ";
      c = BAS + " " + "جاء هنا " + Tam;
      d = kt1;
      e = Aila + Ac;
    } else if (elm === "|.0.|.0.|.|.0.|.0.|.|.0.|.|.|.|.0.|.0.|.|.0") {
      b = " مُسْتَفْعِلُنْ فَاعِلُنْ مُتَعِلُنْ فَاعِلُنْ ";
      c = BAS + " " + "جاء هنا " + Tam;
      d = kt1;
      e = Aila + Ac;
    } else if (elm === "|.0.|.0.|.|.0.|.|.|.0.|.|.|.|.0.|.0.|.|.0") {
      b = " مُسْتَفْعِلُنْ فَعِلُنْ مُتَعِلُنْ فَاعِلُنْ ";
      c = BAS + " " + "جاء هنا " + Tam;
      d = kt1;
      e = Aila + Aa + " و " + Ac;
    } else if (elm === "|.|.|.|.0.|.|.|.0.|.0.|.0.|.|.0.|.0.|.|.0") {
      b = " مُتَعِلُنْ فَعِلُنْ مُسْتَفْعِلُنْ فَاعِلُنْ ";
      c = BAS + " " + "جاء هنا " + Tam;
      d = kt1;
      e = Aila + Aa + " و " + Ac;
    }

    /*عروضه مخبونة */

    if (elm === "|.0.|.0.|.|.0.|.0.|.|.0.|.0.|.0.|.|.0.|.|.|.0") {
      b = " مُسْتَفْعِلُنْ فَاعِلُنْ مُسْتَفْعِلُنْ فَعِلُنْ ";
      c = BAS + " " + "جاء هنا " + Tam;
      d = mkhb;
    } else if (elm === "|.0.|.0.|.|.0.|.|.|.0.|.0.|.0.|.|.0.|.|.|.0") {
      b = " مُسْتَفْعِلُنْ فَعِلُنْ مُسْتَفْعِلُنْ فَعِلُنْ ";
      c = BAS + " " + "جاء هنا " + Tam;
      d = mkhb;
      e = Aila + Aa;
    } else if (elm === "|.|.0.|.|.0.|.|.|.0.|.0.|.0.|.|.0.|.|.|.0") {
      b = " مُتَفْعِلُنْ فَعِلُنْ مُسْتَفْعِلُنْ فَعِلُنْ ";
      c = BAS + " " + "جاء هنا " + Tam;
      d = mkhb;
      e = Aila + Aa;
    } else if (elm === "|.|.0.|.|.0.|.|.|.0.|.|.0.|.|.0.|.|.|.0") {
      b = " مُتَفْعِلُنْ فَعِلُنْ مُتَفْعِلُنْ فَعِلُنْ ";
      c = BAS + " " + "جاء هنا " + Tam;
      d = mkhb;
      e = Aila + Aa;
    } else if (elm === "|.|.0.|.|.0.|.0.|.|.0.|.0.|.0.|.|.0.|.|.|.0") {
      b = " مُتَفْعِلُنْ فَاعِلُنْ مُسْتَفْعِلُنْ فَعِلُنْ ";
      c = BAS + " " + "جاء هنا " + Tam;
      d = mkhb;
      e = Aila + Aa;
    } else if (elm === "|.|.0.|.|.0.|.0.|.|.0.|.0.|.|.|.0.|.|.|.0") {
      b = " مُتَفْعِلُنْ فَاعِلُنْ مُسْتَعِلُنْ فَعِلُنْ ";
      c = BAS + " " + "جاء هنا " + Tam;
      d = mkhb;
      e = Aila + Aa + " و" + Ab;
    } else if (elm === "|.0.|.0.|.|.0.|.|.|.0.|.|.0.|.|.0.|.|.|.0") {
      b = " مُسْتَفْعِلُنْ فَعِلُنْ مُتَفْعِلُنْ فَعِلُنْ ";
      c = BAS + " " + "جاء هنا " + Tam;
      d = mkhb;
      e = Aila + Aa;
    } else if (elm === "|.|.0.|.|.0.|.0.|.|.0.|.|.0.|.|.0.|.|.|.0") {
      b = " مُتَفْعِلُنْ فَاعِلُنْ مُتَفْعِلُنْ فَعِلُنْ ";
      c = BAS + " " + "جاء هنا " + Tam;
      d = mkhb;
      e = Aila + Aa;
    } else if (elm === "|.0.|.0.|.|.0.|.0.|.|.0.|.|.0.|.|.0.|.|.|.0") {
      b = " مُسْتَفْعِلُنْ فَاعِلُنْ مُتَفْعِلُنْ فَعِلُنْ ";
      c = BAS + " " + "جاء هنا " + Tam;
      d = mkhb;
      e = Aila + Aa;
    } else if (elm === "|.0.|.|.|.0.|.|.|.0.|.0.|.|.|.0.|.|.|.0") {
      b = " مُسْتَعِلُنْ فَعِلُنْ مُسْتَعِلُنْ فَعِلُنْ ";
      c = BAS + " " + "جاء هنا " + Tam;
      d = mkhb;
      e = Aila + Aa + " و" + Ab;
    } else if (elm === "|.0.|.|.|.0.|.0.|.|.0.|.0.|.|.|.0.|.|.|.0") {
      b = " مُسْتَعِلُنْ فَاعِلُنْ مُسْتَعِلُنْ فَعِلُنْ ";
      c = BAS + " " + "جاء هنا " + Tam;
      d = mkhb;
      e = Aila + Ab;
    } else if (elm === "|.0.|.0.|.|.0.|.|.|.0.|.0.|.|.|.0.|.|.|.0") {
      b = " مُسْتَفْعِلُنْ فَعِلُنْ مُسْتَعِلُنْ فَعِلُنْ ";
      c = BAS + " " + "جاء هنا " + Tam;
      d = mkhb;
      e = Aila + Aa + " و" + Ab;
    } else if (elm === "|.0.|.|.|.0.|.|.|.0.|.0.|.0.|.|.0.|.|.|.0") {
      b = " مُسْتَعِلُنْ فَعِلُنْ مُسْتَفْعِلُنْ فَعِلُنْ ";
      c = BAS + " " + "جاء هنا " + Tam;
      d = mkhb;
      e = Aila + Aa + " و" + Ab;
    } else if (elm === "|.0.|.|.|.0.|.|.|.0.|.|.0.|.|.0.|.|.|.0") {
      b = " مُسْتَعِلُنْ فَعِلُنْ مُتَفْعِلُنْ فَعِلُنْ ";
      c = BAS + " " + "جاء هنا " + Tam;
      d = mkhb;
      e = Aila + Aa + " و" + Ab;
    } else if (elm === "|.|.0.|.|.0.|.|.|.0.|.0.|.|.|.0.|.|.|.0") {
      b = " مُتَفْعِلُنْ فَعِلُنْ مُسْتَعِلُنْ فَعِلُنْ ";
      c = BAS + " " + "جاء هنا " + Tam;
      d = mkhb;
      e = Aila + Aa + " و" + Ab;
    } else if (elm === "|.0.|.0.|.|.0.|.0.|.|.0.|.0.|.|.|.0.|.|.|.0") {
      b = " مُسْتَفْعِلُنْ فَاعِلُنْ مُسْتَعِلُنْ فَعِلُنْ ";
      c = BAS + " " + "جاء هنا " + Tam;
      d = mkhb;
      e = Aila + Ab;
    } else if (elm === "|.0.|.|.|.0.|.0.|.|.0.|.0.|.0.|.|.0.|.|.|.0") {
      b = " مُسْتَعِلُنْ فَاعِلُنْ مُسْتَفْعِلُنْ فَعِلُنْ ";
      c = BAS + " " + "جاء هنا " + Tam;
      d = mkhb;
      e = Aila + Ab;
    } else if (elm === "|.|.|.|.0.|.|.|.0.|.|.|.|.0.|.|.|.0") {
      b = " مُتَعِلُنْ فَعِلُنْ مُتَعِلُنْ فَعِلُنْ ";
      c = BAS + " " + "جاء هنا " + Tam;
      d = mkhb;
      e = Aila + Aa + " و " + Ac;
    } else if (elm === "|.|.0.|.|.0.|.|.|.0.|.|.|.|.0.|.|.|.0") {
      b = " مُتَفْعِلُنْ فَعِلُنْ مُتَعِلُنْ فَعِلُنْ ";
      c = BAS + " " + "جاء هنا " + Tam;
      d = mkhb;
      e = Aila + Aa + " و " + Ac;
    } else if (elm === "|.|.|.|.0.|.|.|.0.|.0.|.|.|.0.|.|.|.0") {
      b = " مُتَعِلُنْ فَعِلُنْ مُسْتَعِلُنْ فَعِلُنْ ";
      c = BAS + " " + "جاء هنا " + Tam;
      d = mkhb;
      e = Aila + Aa + " و " + Ab + " و " + Ac;
    } else if (elm === "|.|.|.|.0.|.|.|.0.|.|.0.|.|.0.|.|.|.0") {
      b = " مُتَعِلُنْ فَعِلُنْ مُتَفْعِلُنْ فَعِلُنْ ";
      c = BAS + " " + "جاء هنا " + Tam;
      d = mkhb;
      e = Aila + Aa + " و " + Ac;
    } else if (elm === "|.0.|.|.|.0.|.|.|.0.|.|.|.|.0.|.|.|.0") {
      b = " مُسْتَعِلُنْ فَعِلُنْ مُتَعِلُنْ فَعِلُنْ ";
      c = BAS + " " + "جاء هنا " + Tam;
      d = mkhb;
      e = Aila + Aa + " و " + Ab + " و " + Ac;
    } else if (elm === "|.|.|.|.0.|.0.|.|.0.|.|.|.|.0.|.|.|.0") {
      b = " مُتَعِلُنْ فَاعِلُنْ مُتَعِلُنْ فَعِلُنْ ";
      c = BAS + " " + "جاء هنا " + Tam;
      d = mkhb;
      e = Aila + Ac;
    } else if (elm === "|.|.|.|.0.|.0.|.|.0.|.0.|.0.|.|.0.|.|.|.0") {
      b = " مُتَعِلُنْ فَاعِلُنْ مُسْتَفْعِلُنْ فَعِلُنْ ";
      c = BAS + " " + "جاء هنا " + Tam;
      d = mkhb;
      e = Aila + Ac;
    } else if (elm === "|.0.|.0.|.|.0.|.0.|.|.0.|.|.|.|.0.|.|.|.0") {
      b = " مُسْتَفْعِلُنْ فَاعِلُنْ مُتَعِلُنْ فَعِلُنْ ";
      c = BAS + " " + "جاء هنا " + Tam;
      d = mkhb;
      e = Aila + Ac;
    } else if (elm === "|.0.|.0.|.|.0.|.|.|.0.|.|.|.|.0.|.|.|.0") {
      b = " مُسْتَفْعِلُنْ فَعِلُنْ مُتَعِلُنْ فَعِلُنْ ";
      c = BAS + " " + "جاء هنا " + Tam;
      d = mkhb;
      e = Aila + Aa + " و " + Ac;
    } else if (elm === "|.|.|.|.0.|.|.|.0.|.0.|.0.|.|.0.|.|.|.0") {
      b = " مُتَعِلُنْ فَعِلُنْ مُسْتَفْعِلُنْ فَعِلُنْ ";
      c = BAS + " " + "جاء هنا " + Tam;
      d = mkhb;
      e = Aila + Aa + " و " + Ac;
    }

    /*عروضه مقطوعة */
    if (elm === "|.0.|.0.|.|.0.|.0.|.|.0.|.0.|.0.|.|.0.|.0.|.0") {
      b = "  مُسْتَفْعِلُنْ فَاعِلُنْ مُسْتَفْعِلُنْ فَاعِلْ  ";
      c = BAS + " " + "جاء هنا " + Tam;
      d = mkta;
    } else if (elm === "|.0.|.0.|.|.0.|.|.|.0.|.0.|.0.|.|.0.|.0.|.0") {
      b = " مُسْتَفْعِلُنْ فَعِلُنْ مُسْتَفْعِلُنْ فَاعِلْ  ";
      c = BAS + " " + "جاء هنا " + Tam;
      d = mkta;
      e = Aila + Aa;
    } else if (elm === "|.|.0.|.|.0.|.|.|.0.|.0.|.0.|.|.0.|.0.|.0") {
      b = "مُتَفْعِلُنْ فَعِلُنْ مُسْتَفْعِلُنْ فَاعِلْ  ";
      c = BAS + " " + "جاء هنا " + Tam;
      d = mkta;
      e = Aila + Aa;
    } else if (elm === "|.|.0.|.|.0.|.|.|.0.|.|.0.|.|.0.|.0.|.0") {
      b = " مُتَفْعِلُنْ فَعِلُنْ مُتَفْعِلُنْ فَاعِلْ  ";
      c = BAS + " " + "جاء هنا " + Tam;
      d = mkta;
      e = Aila + Aa;
    } else if (elm === "|.|.0.|.|.0.|.0.|.|.0.|.0.|.0.|.|.0.|.0.|.0") {
      b = " مُتَفْعِلُنْ فَاعِلُنْ مُسْتَفْعِلُنْ فَاعِلْ  ";
      c = BAS + " " + "جاء هنا " + Tam;
      d = mkta;
      e = Aila + Aa;
    } else if (elm === "|.0.|.0.|.|.0.|.|.|.0.|.|.0.|.|.0.|.0.|.0") {
      b = " مُسْتَفْعِلُنْ فَعِلُنْ مُتَفْعِلُنْ فَاعِلْ  ";
      c = BAS + " " + "جاء هنا " + Tam;
      d = mkta;
      e = Aila + Aa;
    } else if (elm === "|.|.0.|.|.0.|.0.|.|.0.|.|.0.|.|.0.|.0.|.0") {
      b = "مُتَفْعِلُنْ فَاعِلُنْ مُتَفْعِلُنْ فَاعِلْ  ";
      c = BAS + " " + "جاء هنا " + Tam;
      d = mkta;
      e = Aila + Aa;
    } else if (elm === "|.0.|.0.|.|.0.|.0.|.|.0.|.|.0.|.|.0.|.0.|.0") {
      b = " مُسْتَفْعِلُنْ فَاعِلُنْ مُتَفْعِلُنْ فَاعِلْ  ";
      c = BAS + " " + "جاء هنا " + Tam;
      d = mkta;
      e = Aila + Aa;
    } else if (elm === "|.0.|.|.|.0.|.|.|.0.|.0.|.|.|.0.|.0.|.0") {
      b = " مُسْتَعِلُنْ فَعِلُنْ مُسْتَعِلُنْ فَاعِلْ  ";
      c = BAS + " " + "جاء هنا " + Tam;
      d = mkta;
      e = Aila + Aa + " و" + Ab;
    } else if (elm === "|.0.|.|.|.0.|.0.|.|.0.|.0.|.|.|.0.|.0.|.0") {
      b = " مُسْتَعِلُنْ فَاعِلُنْ مُسْتَعِلُنْ فَاعِلْ  ";
      c = BAS + " " + "جاء هنا " + Tam;
      d = mkta;
      e = Aila + Ab;
    } else if (elm === "|.0.|.0.|.|.0.|.|.|.0.|.0.|.|.|.0.|.0.|.0") {
      b = " مُسْتَفْعِلُنْ فَعِلُنْ مُسْتَعِلُنْ فَاعِلْ  ";
      c = BAS + " " + "جاء هنا " + Tam;
      d = mkta;
      e = Aila + Aa + " و" + Ab;
    } else if (elm === "|.0.|.|.|.0.|.|.|.0.|.0.|.0.|.|.0.|.0.|.0") {
      b = " مُسْتَعِلُنْ فَعِلُنْ مُسْتَفْعِلُنْ فَاعِلْ  ";
      c = BAS + " " + "جاء هنا " + Tam;
      d = mkta;
      e = Aila + Aa + " و" + Ab;
    } else if (elm === "|.0.|.|.|.0.|.|.|.0.|.|.0.|.|.0.|.0.|.0") {
      b = " مُسْتَعِلُنْ فَعِلُنْ مُتَفْعِلُنْ فَاعِلْ  ";
      c = BAS + " " + "جاء هنا " + Tam;
      d = mkta;
      e = Aila + Aa + " و" + Ab;
    } else if (elm === "|.|.0.|.|.0.|.|.|.0.|.0.|.|.|.0.|.0.|.0") {
      b = " مُتَفْعِلُنْ فَعِلُنْ مُسْتَعِلُنْ فَاعِلْ  ";
      c = BAS + " " + "جاء هنا " + Tam;
      d = mkta;
      e = Aila + Aa + " و" + Ab;
    } else if (elm === "|.0.|.0.|.|.0.|.0.|.|.0.|.0.|.|.|.0.|.0.|.0") {
      b = " مُسْتَفْعِلُنْ فَاعِلُنْ مُسْتَعِلُنْ فَاعِلْ  ";
      c = BAS + " " + "جاء هنا " + Tam;
      d = mkta;
      e = Aila + Ab;
    } else if (elm === "|.0.|.|.|.0.|.0.|.|.0.|.0.|.0.|.|.0.|.0.|.0") {
      b = " مُسْتَعِلُنْ فَاعِلُنْ مُسْتَفْعِلُنْ فَاعِلْ  ";
      c = BAS + " " + "جاء هنا " + Tam;
      d = mkta;
      e = Aila + Ab;
    } else if (elm === "|.|.|.|.0.|.|.|.0.|.|.|.|.0.|.0.|.0") {
      b = " مُتَعِلُنْ فَعِلُنْ مُتَعِلُنْ فَاعِلْ  ";
      c = BAS + " " + "جاء هنا " + Tam;
      d = mkta;
      e = Aila + Aa + " و " + Ac;
    } else if (elm === "|.|.0.|.|.0.|.|.|.0.|.|.|.|.0.|.0.|.0") {
      b = " مُتَفْعِلُنْ فَعِلُنْ مُتَعِلُنْ فَاعِلْ  ";
      c = BAS + " " + "جاء هنا " + Tam;
      d = mkta;
      e = Aila + Aa + " و " + Ac;
    } else if (elm === "|.|.|.|.0.|.|.|.0.|.0.|.|.|.0.|.0.|.0") {
      b = " مُتَعِلُنْ فَعِلُنْ مُسْتَعِلُنْ فَاعِلْ  ";
      c = BAS + " " + "جاء هنا " + Tam;
      d = mkta;
      e = Aila + Aa + " و " + Ab + " و " + Ac;
    } else if (elm === "|.|.|.|.0.|.|.|.0.|.|.0.|.|.0.|.0.|.0") {
      b = " مُتَعِلُنْ فَعِلُنْ مُتَفْعِلُنْ فَاعِلْ  ";
      c = BAS + " " + "جاء هنا " + Tam;
      d = mkta;
      e = Aila + Aa + " و " + Ac;
    } else if (elm === "|.0.|.|.|.0.|.|.|.0.|.|.|.|.0.|.0.|.0") {
      b = " مُسْتَعِلُنْ فَعِلُنْ مُتَعِلُنْ فَاعِلْ  ";
      c = BAS + " " + "جاء هنا " + Tam;
      d = mkta;
      e = Aila + Aa + " و " + Ab + " و " + Ac;
    } else if (elm === "|.|.|.|.0.|.0.|.|.0.|.|.|.|.0.|.0.|.0") {
      b = " مُتَعِلُنْ فَاعِلُنْ مُتَعِلُنْ فَاعِلْ  ";
      c = BAS + " " + "جاء هنا " + Tam;
      d = mkta;
      e = Aila + Ac;
    } else if (elm === "|.|.|.|.0.|.0.|.|.0.|.0.|.0.|.|.0.|.0.|.0") {
      b = " مُتَعِلُنْ فَاعِلُنْ مُسْتَفْعِلُنْ فَاعِلْ  ";
      c = BAS + " " + "جاء هنا " + Tam;
      d = mkta;
      e = Aila + Ac;
    } else if (elm === "|.0.|.0.|.|.0.|.0.|.|.0.|.|.|.|.0.|.0.|.0") {
      b = " مُسْتَفْعِلُنْ فَاعِلُنْ مُتَعِلُنْ فَاعِلْ  ";
      c = BAS + " " + "جاء هنا " + Tam;
      d = mkta;
      e = Aila + Ac;
    } else if (elm === "|.0.|.0.|.|.0.|.|.|.0.|.|.|.|.0.|.0.|.0") {
      b = " مُسْتَفْعِلُنْ فَعِلُنْ مُتَعِلُنْ فَاعِلْ  ";
      c = BAS + " " + "جاء هنا " + Tam;
      d = mkta;
      e = Aila + Aa + " و " + Ac;
    } else if (elm === "|.|.|.|.0.|.|.|.0.|.0.|.0.|.|.0.|.0.|.0") {
      b = " مُتَعِلُنْ فَعِلُنْ مُسْتَفْعِلُنْ  فَاعِلْ ";
      c = BAS + " " + "جاء هنا " + Tam;
      d = mkta;
      e = Aila + Aa + " و " + Ac;
    }
    /*البسيط  المجزوء*/
    /*  1 عروضه صحيحة */
    if (elm === "|.0.|.0.|.|.0.|.0.|.|.0.|.0.|.0.|.|.0") {
      b = " مُسْتَفْعِلُنْ فَاعِلُنْ مُسْتَفْعِلُنْ  ";
      c = BAS + " " + "جاء هنا " + Mj;
      d = kt1;
    } else if (elm === "|.0.|.0.|.|.0.|.|.|.0.|.0.|.0.|.|.0") {
      b = "مُسْتَفْعِلُنْ فَعِلُنْ مُسْتَفْعِلُنْ  ";
      c = BAS + " " + "جاء هنا " + Mj;
      d = kt1;
      e = Aila + Aa;
    } else if (elm === "|.|.0.|.|.0.|.|.|.0.|.0.|.0.|.|.0") {
      b = "مُتَفْعِلُنْ فَعِلُنْ مُسْتَفْعِلُنْ  ";
      c = BAS + " " + "جاء هنا " + Mj;
      d = kt1;
      e = Aila + Aa;
    } else if (elm === "|.|.0.|.|.0.|.0.|.|.0.|.|.0.|.|.0") {
      b = "مُتَفْعِلُنْ فَاعِلُنْ مُسْتَفْعِلُنْ  ";
      c = BAS + " " + "جاء هنا " + Mj;
      d = kt1;
      e = Aila + Aa;
    } else if (elm === "|.0.|.|.|.0.|.|.|.0.|.0.|.0.|.|.0") {
      b = " مُسْتَعِلُنْ فَعِلُنْ مُسْتَفْعِلُنْ  ";
      c = BAS + " " + "جاء هنا " + Mj;
      d = kt1;
      e = Aila + Aa + " و" + Ab;
    } else if (elm === "|.0.|.|.|.0.|.0.|.|.0.|.0.|.0.|.|.0") {
      b = " مُسْتَعِلُنْ فَاعِلُنْ مُسْتَفْعِلُنْ  ";
      c = BAS + " " + "جاء هنا " + Mj;
      d = kt1;
      e = Aila + Ab;
    } else if (elm === "|.|.|.|.0.|.|.|.0.|.0.|.0.|.|.0") {
      b = " مُتَعِلُنْ فَعِلُنْ مُسْتَفْعِلُنْ  ";
      c = BAS + " " + "جاء هنا " + Mj;
      d = kt1;
      e = Aila + Aa + " و " + Ac;
    } else if (elm === "|.|.|.|.0.|.0.|.|.0.|.0.|.0.|.|.0") {
      b = " مُتَعِلُنْ فَاعِلُنْ مُسْتَفْعِلُنْ  ";
      c = BAS + " " + "جاء هنا " + Mj;
      d = kt1;
      e = Aila + Ac;
    }
    /*  عروضه صحيحة  مذيل */
    if (elm === "|.0.|.0.|.|.0.|.0.|.|.0.|.0.|.0.|.|.0.0") {
      b = " مُسْتَفْعِلُنْ فَاعِلُنْ مُسْتَفْعِلَانْ  ";
      c = BAS + " " + "جاء هنا " + Mj;
      d = ShihM;
    } else if (elm === "|.0.|.0.|.|.0.|.|.|.0.|.0.|.0.|.|.0.0") {
      b = "مُسْتَفْعِلُنْ فَعِلُنْ مُسْتَفْعِلَانْ  ";
      c = BAS + " " + "جاء هنا " + Mj;
      d = ShihM;
      e = Aila + Aa;
    } else if (elm === "|.|.0.|.|.0.|.|.|.0.|.0.|.0.|.|.0.0") {
      b = "مُتَفْعِلُنْ فَعِلُنْ مُسْتَفْعِلَانْ  ";
      c = BAS + " " + "جاء هنا " + Mj;
      d = ShihM;
      e = Aila + Aa;
    } else if (elm === "|.|.0.|.|.0.|.0.|.|.0.|.|.0.|.|.0.0") {
      b = "مُتَفْعِلُنْ فَاعِلُنْ مُسْتَفْعِلَانْ  ";
      c = BAS + " " + "جاء هنا " + Mj;
      d = ShihM;
      e = Aila + Aa;
    } else if (elm === "|.0.|.|.|.0.|.|.|.0.|.0.|.0.|.|.0.0") {
      b = " مُسْتَعِلُنْ فَعِلُنْ مُسْتَفْعِلَانْ  ";
      c = BAS + " " + "جاء هنا " + Mj;
      d = ShihM;
      e = Aila + Aa + " و" + Ab;
    } else if (elm === "|.0.|.|.|.0.|.0.|.|.0.|.0.|.0.|.|.0.0") {
      b = " مُسْتَعِلُنْ فَاعِلُنْ مُسْتَفْعِلَانْ  ";
      c = BAS + " " + "جاء هنا " + Mj;
      d = ShihM;
      e = Aila + Ab;
    } else if (elm === "|.|.|.|.0.|.|.|.0.|.0.|.0.|.|.0.0") {
      b = " مُتَعِلُنْ فَعِلُنْ مُسْتَفْعِلَانْ  ";
      c = BAS + " " + "جاء هنا " + Mj;
      d = ShihM;
      e = Aila + Aa + " و " + Ac;
    } else if (elm === "|.|.|.|.0.|.0.|.|.0.|.0.|.0.|.|.0.0") {
      b = " مُتَعِلُنْ فَاعِلُنْ مُسْتَفْعِلَانْ  ";
      c = BAS + " " + "جاء هنا " + Mj;
      d = ShihM;
      e = Aila + Ac;
    }
    /*   عروضه مقطوعة  */
    if (elm === "|.0.|.0.|.|.0.|.0.|.|.0.|.0.|.0.|.0") {
      b = "مُسْتَفْعِلُنْ فَاعِلُنْ مُسْتَفْعِلْ  ";
      c = BAS + " " + "جاء هنا " + Mj;
      d = mkta;
    } else if (elm === "|.0.|.0.|.|.0.|.|.|.0.|.0.|.0.|.0") {
      b = "مُسْتَفْعِلُنْ فَعِلُنْ مُسْتَفْعِلْ  ";
      c = BAS + " " + "جاء هنا " + Mj;
      d = mkta;
      e = Aila + Aa;
    } else if (elm === "|.|.0.|.|.0.|.|.|.0.|.0.|.0.|.0") {
      b = "مُتَفْعِلُنْ فَعِلُنْ مُسْتَفْعِلْ  ";
      c = BAS + " " + "جاء هنا " + Mj;
      d = mkta;
      e = Aila + Aa;
    } else if (elm === "|.|.0.|.|.0.|.0.|.|.0.|.|.0.|.0") {
      b = "مُتَفْعِلُنْ فَاعِلُنْ مُسْتَفْعِلْ  ";
      c = BAS + " " + "جاء هنا " + Mj;
      d = mkta;
      e = Aila + Aa;
    } else if (elm === "|.0.|.|.|.0.|.|.|.0.|.0.|.0.|.0") {
      b = " مُسْتَعِلُنْ فَعِلُنْ مُسْتَفْعِلْ  ";
      c = BAS + " " + "جاء هنا " + Mj;
      d = mkta;
      e = Aila + Aa + " و" + Ab;
    } else if (elm === "|.0.|.|.|.0.|.0.|.|.0.|.0.|.0.|.0") {
      b = " مُسْتَعِلُنْ فَاعِلُنْ مُسْتَفْعِلْ  ";
      c = BAS + " " + "جاء هنا " + Mj;
      d = mkta;
      e = Aila + Ab;
    } else if (elm === "|.|.|.|.0.|.|.|.0.|.0.|.0.|.0") {
      b = " مُتَعِلُنْ فَعِلُنْ مُسْتَفْعِلْ  ";
      c = BAS + " " + "جاء هنا " + Mj;
      d = mkta;
      e = Aila + Aa + " و " + Ac;
    } else if (elm === "|.|.|.|.0.|.0.|.|.0.|.0.|.0.|.0") {
      b = " مُتَعِلُنْ فَاعِلُنْ مُسْتَفْعِلْ  ";
      c = BAS + " " + "جاء هنا " + Mj;
      d = mkta;
      e = Aila + Ac;
    }
    /*  مخلع البسيط */
    const MkB = "مخلع البسيط";
    if (elm === "|.0.|.0.|.|.0.|.0.|.|.0.|.|.0.|.0") {
      b = "مُسْتَفْعِلُنْ فَاعِلُنْ فَعُولُنْ  ";
      c = BAS + " " + "جاء هنا " + Mj;
      d = MkB;
    } else if (elm === "|.0.|.0.|.|.0.|.|.|.0.|.|.0.|.0") {
      b = "مُسْتَفْعِلُنْ فَعِلُنْ فَعُولُنْ  ";
      c = BAS + " " + "جاء هنا " + Mj;
      d = MkB;
      e = Aila + Aa;
    } else if (elm === "|.|.0.|.|.0.|.|.|.0.|.|.0.|.0") {
      b = "مُتَفْعِلُنْ فَعِلُنْ فَعُولُنْ  ";
      c = BAS + " " + "جاء هنا " + Mj;
      d = MkB;
      e = Aila + Aa;
    } else if (elm === "|.|.0.|.|.0.|.0.|.|.0.|.|.0.|.0") {
      b = "مُتَفْعِلُنْ فَاعِلُنْ فَعُولُنْ  ";
      c = BAS + " " + "جاء هنا " + Mj;
      d = MkB;
      e = Aila + Aa;
    } else if (elm === "|.0.|.|.|.0.|.|.|.0.|.|.0.|.0") {
      b = " مُسْتَعِلُنْ فَعِلُنْ فَعُولُنْ  ";
      c = BAS + " " + "جاء هنا " + Mj;
      d = MkB;
      e = Aila + Aa + " و" + Ab;
    } else if (elm === "|.0.|.|.|.0.|.0.|.|.0.|.|.0.|.0") {
      b = " مُسْتَعِلُنْ فَاعِلُنْ فَعُولُنْ  ";
      c = BAS + " " + "جاء هنا " + Mj;
      d = MkB;
      e = Aila + Ab;
    } else if (elm === "|.|.|.|.0.|.|.|.0.|.|.0.|.0") {
      b = " مُتَعِلُنْ فَعِلُنْ فَعُولُنْ  ";
      c = BAS + " " + "جاء هنا " + Mj;
      d = MkB;
      e = Aila + Aa + " و " + Ac;
    } else if (elm === "|.|.|.|.0.|.0.|.|.0.|.|.0.|.0") {
      b = " مُتَعِلُنْ فَاعِلُنْ فَعُولُنْ  ";
      c = BAS + " " + "جاء هنا " + Mj;
      d = MkB;
      e = Aila + Ac;
    }
    /*المديد------------------------------------------------------------------ */
    /*صحيح  */
    if (elm === "|.0.|.|.0.|.0.|.0.|.|.0.|.0.|.|.0.|.0") {
      b = " فَاعِلَاتُنْ فَاعِلُنْ فَاعِلَاتُنْ   ";
      c = Madid;
      d = kt1;
    } else if (elm === "|.|.|.0.|.0.|.0.|.|.0.|.0.|.|.0.|.0") {
      b = " فَعِلَاتُنْ فَاعِلُنْ فَاعِلَاتُنْ   ";
      c = Madid;
      d = kt1;
      e = Aila + Aa;
    } else if (elm === "|.|.|.0.|.0.|.|.|.0.|.0.|.|.0.|.0") {
      b = " فَعِلَاتُنْ فَعِلُنْ فَاعِلَاتُنْ   ";
      c = Madid;
      d = kt1;
      e = Aila + Aa;
    } else if (elm === "|.0.|.|.0.|.|.0.|.|.0.|.0.|.|.0.|.0") {
      b = " فَاعِلَاتُ فَاعِلُنْ فَاعِلَاتُنْ   ";
      c = Madid;
      d = kt1;
      e = Aila + Kaf;
    } else if (elm === "|.0.|.|.0.|.|.|.|.0.|.0.|.|.0.|.0") {
      b = " فَاعِلَاتُ فَعِلُنْ فَاعِلَاتُنْ   ";
      c = Madid;
      d = kt1;
      e = Aila + Kaf + " و " + Aa;
    } else if (elm === "|.0.|.|.0.|.0.|.|.|.0.|.0.|.|.0.|.0") {
      b = " فَاعِلَاتُنْ فَعِلُنْ فَاعِلَاتُنْ   ";
      c = Madid;
      d = kt1;
      e = Aila + Aa;
    }
    /*محذوفة */
    if (elm === "|.0.|.|.0.|.0.|.0.|.|.0.|.0.|.|.0") {
      b = " فَاعِلَاتُنْ فَاعِلُنْ فَاعِلٌنْ   ";
      c = Madid;
      d = kt3;
    } else if (elm === "|.|.|.0.|.0.|.0.|.|.0.|.0.|.|.0") {
      b = " فَعِلَاتُنْ فَاعِلُنْ فَاعِلٌنْ   ";
      c = Madid;
      d = kt3;
      e = Aila + Aa;
    } else if (elm === "|.|.|.0.|.0.|.|.|.0.|.0.|.|.0") {
      b = " فَعِلَاتُنْ فَعِلُنْ فَاعِلٌنْ   ";
      c = Madid;
      d = kt3;
      e = Aila + Aa;
    } else if (elm === "|.0.|.|.0.|.|.0.|.|.0.|.0.|.|.0") {
      b = " فَاعِلَاتُ فَاعِلُنْ فَاعِلٌنْ   ";
      c = Madid;
      d = kt3;
      e = Aila + Kaf;
    } else if (elm === "|.0.|.|.0.|.|.|.|.0.|.0.|.|.0") {
      b = " فَاعِلَاتُ فَعِلُنْ فَاعِلٌنْ   ";
      c = Madid;
      d = kt3;
      e = Aila + Kaf + " و " + Aa;
    } else if (elm === "|.0.|.|.0.|.0.|.|.|.0.|.0.|.|.0") {
      b = " فَاعِلَاتُنْ فَعِلُنْ فَاعِلٌنْ   ";
      c = Madid;
      d = kt3;
      e = Aila + Aa;
    }
    /*مقصورة  */
    if (elm === "|.0.|.|.0.|.0.|.0.|.|.0.|.0.|.|.0.0") {
      b = "فَاعِلَاتُنْ فَاعِلُنْ فَاعِلَاتْ   ";
      c = Madid;
      d = Mksora;
    } else if (elm === "|.|.|.0.|.0.|.0.|.|.0.|.0.|.|.0.0") {
      b = " فَعِلَاتُنْ فَاعِلُنْ فَاعِلَاتْ   ";
      c = Madid;
      d = Mksora;
      e = Aila + Aa;
    } else if (elm === "|.|.|.0.|.0.|.|.|.0.|.0.|.|.0.0") {
      b = " فَعِلَاتُنْ فَعِلُنْ فَاعِلَاتْ   ";
      c = Madid;
      d = Mksora;
      e = Aila + Aa;
    } else if (elm === "|.0.|.|.0.|.|.0.|.|.0.|.0.|.|.0.0") {
      b = " فَاعِلَاتُ فَاعِلُنْ فَاعِلَاتْ   ";
      c = Madid;
      d = Mksora;
      e = Aila + Kaf;
    } else if (elm === "|.0.|.|.0.|.|.|.|.0.|.0.|.|.0.0") {
      b = " فَاعِلَاتُ فَعِلُنْ فَاعِلَاتْ   ";
      c = Madid;
      d = Mksora;
      e = Aila + Kaf + " و " + Aa;
    } else if (elm === "|.0.|.|.0.|.0.|.|.|.0.|.0.|.|.0.0") {
      b = " فَاعِلَاتُنْ فَعِلُنْ فَاعِلَاتْ   ";
      c = Madid;
      d = Mksora;
      e = Aila + Aa;
    }
    /*مبثورة */
    if (elm === "|.0.|.|.0.|.0.|.0.|.|.0.|.|.|.0") {
      b = "فَاعِلَاتُنْ فَاعِلُنْ فَعِلُنْ   ";
      c = Madid;
      d = Mabtora;
    } else if (elm === "|.|.|.0.|.0.|.0.|.|.0.|.|.|.0") {
      b = " فَعِلَاتُنْ فَاعِلُنْ فَعِلُنْ   ";
      c = Madid;
      d = Mabtora;
      e = Aila + Aa;
    } else if (elm === "|.|.|.0.|.0.|.|.|.0.|.|.|.0") {
      b = " فَعِلَاتُنْ فَعِلُنْ فَعِلُنْ   ";
      c = Madid;
      d = Mabtora;
      e = Aila + Aa;
    } else if (elm === "|.0.|.|.0.|.|.0.|.|.0.|.|.|.0") {
      b = " فَاعِلَاتُ فَاعِلُنْ فَعِلُنْ   ";
      c = Madid;
      d = Mabtora;
      e = Aila + Kaf;
    } else if (elm === "|.0.|.|.0.|.|.|.|.0.|.|.|.0") {
      b = " فَاعِلَاتُ فَعِلُنْ فَعِلُنْ   ";
      c = Madid;
      d = Mabtora;
      e = Aila + Kaf + " و " + Aa;
    } else if (elm === "|.0.|.|.0.|.0.|.|.|.0.|.|.|.0") {
      b = " فَاعِلَاتُنْ فَعِلُنْ فَعِلُنْ   ";
      c = Madid;
      d = Mabtora;
      e = Aila + Aa;
    }
    /*الوافر------------------------------------------------------------------ */
    /*تام */
    if (elm === "|.|.0.|.|.|.0.|.|.0.|.|.|.0.|.|.0.|.0") {
      b = " مُفَاعَلَتُنْ مُفَاعَلَتُنْ فَعُولُنْ  ";
      c = Waf + " " + Tam;
      d = Mktofa;
    } else if (elm === "|.|.0.|.|.|.0.|.|.0.|.0.|.0.|.|.0.|.0") {
      b = " مُفَاعَلْتُنْ مُفَاعَلَتُنْ فَعُولُنْ  ";
      c = Waf + " " + Tam;
      d = Mktofa;
      e = Aila + Asp;
    } else if (elm === "|.|.0.|.0.|.0.|.|.0.|.0.|.0.|.|.0.|.0") {
      b = " مُفَاعَلْتُنْ مُفَاعَلْتُنْ فَعُولُنْ  ";
      c = Waf + " " + Tam;
      d = Mktofa;
      e = Aila + Asp;
    } else if (elm === "|.|.0.|.|.|.0.|.|.0.|.0.|.0.|.|.0.|.0") {
      b = " مُفَاعَلَتُنْ مُفَاعَلْتُنْ فَعُولُنْ  ";
      c = Waf + " " + Tam;
      d = Mktofa;
      e = Aila + Asp;
    }
    /*مجزوء */
    /*صحيحة  */
    if (elm === "|.|.0.|.|.|.0.|.|.0.|.|.|.0") {
      b = " مُفَاعَلَتُنْ مُفَاعَلَتُنْ   ";
      c = Waf + " " + Mj;
      d = kt1;
    } else if (elm === "|.|.0.|.0.|.0.|.|.0.|.|.|.0") {
      b = " مُفَاعَلْتُنْ مُفَاعَلَتُنْ   ";
      c = Waf + " " + Mj;
      d = kt1;
      e = Aila + Asp;
    }
    /*معصوبة */
    if (elm === "|.|.0.|.|.|.0.|.|.0.|.0.|.0") {
      b = " مُفَاعَلَتُنْ مُفَاعَلْتُنْ   ";
      c = Waf + " " + Mj;
      d = Maaso;
    } else if (elm === "|.|.0.|.0.|.0.|.|.0.|.0.|.0") {
      b = " مُفَاعَلْتُنْ مُفَاعَلْتُنْ   ";
      c = Waf + " " + Mj;
      d = Maaso;
      e = Aila + Asp;
    }
    /*الكامل------------------------------------------------------------------ */
    /*التام */
    /*عروضه صحيحة */
    if (elm === "|.|.|.0.|.|.0.|.|.|.0.|.|.0.|.|.|.0.|.|.0") {
      b = "مُتَفَاعِلُنْ مُتَفَاعِلُنْ مُتَفَاعِلُنْ   ";
      c = Kamil + " " + Tam;
      d = kt1;
    } else if (elm === "|.0.|.0.|.|.0.|.0.|.0.|.|.0.|.|.|.0.|.|.0") {
      b = "مُتْفَاعِلُنْ مُتْفَاعِلُنْ مُتَفَاعِلُنْ   ";
      c = Kamil + " " + Tam;
      d = kt1;
      e = Aila + Edmare;
    } else if (elm === "|.|.|.0.|.|.0.|.0.|.0.|.|.0.|.|.|.0.|.|.0") {
      b = "مُتَفَاعِلُنْ مُتْفَاعِلُنْ مُتَفَاعِلُنْ   ";
      c = Kamil + " " + Tam;
      d = kt1;
      e = Aila + Edmare;
    } else if (elm === "|.0.|.0.|.|.0.|.|.|.0.|.|.0.|.|.|.0.|.|.0") {
      b = "مُتْفَاعِلُنْ مُتَفَاعِلُنْ مُتَفَاعِلُنْ   ";
      c = Kamil + " " + Tam;
      d = kt1;
      e = Aila + Edmare;
    } else if (elm === "|.|.|.|.|.0.|.|.|.|.|.0.|.|.|.0.|.|.0") {
      b = "مُتَفَعِلُنْ مُتَفَعِلُنْ مُتَفَاعِلُنْ   ";
      c = Kamil + " " + Tam;
      d = kt1;
      e = Aila + Ab;
    } else if (elm === "|.|.|.0.|.|.0.|.|.|.|.|.0.|.|.|.0.|.|.0") {
      b = "مُتَفَاعِلُنْ مُتَفَعِلُنْ مُتَفَاعِلُنْ   ";
      c = Kamil + " " + Tam;
      d = kt1;
      e = Aila + Ab;
    } else if (elm === "|.|.|.|.|.0.|.|.|.0.|.|.0.|.|.|.0.|.|.0") {
      b = "مُتَفَعِلُنْ مُتَفَاعِلُنْ مُتَفَاعِلُنْ   ";
      c = Kamil + " " + Tam;
      d = kt1;
      e = Aila + Ab;
    } else if (elm === "|.0.|.0.|.|.0.|.|.|.|.|.0.|.|.|.0.|.|.0") {
      b = "مُتْفَاعِلُنْ مُتَفَعِلُنْ مُتَفَاعِلُنْ   ";
      c = Kamil + " " + Tam;
      d = kt1;
      e = Aila + Ab + " و " + Edmare;
    } else if (elm === "|.|.|.|.|.0.|.0.|.0.|.|.0.|.|.|.0.|.|.0") {
      b = "مُتَفَعِلُنْ مُتْفَاعِلُنْ مُتَفَاعِلُنْ   ";
      c = Kamil + " " + Tam;
      d = kt1;
      e = Aila + Ab + " و " + Edmare;
    }
    /*-------- الضرب مقطوع -----*/
    if (elm === "|.|.|.0.|.|.0.|.|.|.0.|.|.0.|.|.|.0.|.0") {
      b = "مُتَفَاعِلُنْ مُتَفَاعِلُنْ مُتَفَاعِلْ   ";
      c = Kamil + " " + Tam;
      d = mkta;
    } else if (elm === "|.0.|.0.|.|.0.|.0.|.0.|.|.0.|.|.|.0.|.0") {
      b = "مُتْفَاعِلُنْ مُتْفَاعِلُنْ مُتَفَاعِلْ   ";
      c = Kamil + " " + Tam;
      d = mkta;
      e = Aila + Edmare;
    } else if (elm === "|.|.|.0.|.|.0.|.0.|.0.|.|.0.|.|.|.0.|.0") {
      b = "مُتَفَاعِلُنْ مُتْفَاعِلُنْ مُتَفَاعِلْ   ";
      c = Kamil + " " + Tam;
      d = mkta;
      e = Aila + Edmare;
    } else if (elm === "|.0.|.0.|.|.0.|.|.|.0.|.|.0.|.|.|.0.|.0") {
      b = "مُتْفَاعِلُنْ مُتَفَاعِلُنْ مُتَفَاعِلْ   ";
      c = Kamil + " " + Tam;
      d = mkta;
      e = Aila + Edmare;
    } else if (elm === "|.|.|.|.|.0.|.|.|.|.|.0.|.|.|.0.|.0") {
      b = "مُتَفَعِلُنْ مُتَفَعِلُنْ مُتَفَاعِلْ   ";
      c = Kamil + " " + Tam;
      d = mkta;
      e = Aila + Ab;
    } else if (elm === "|.|.|.0.|.|.0.|.|.|.|.|.0.|.|.|.0.|.0") {
      b = "مُتَفَاعِلُنْ مُتَفَعِلُنْ مُتَفَاعِلْ   ";
      c = Kamil + " " + Tam;
      d = mkta;
      e = Aila + Ab;
    } else if (elm === "|.|.|.|.|.0.|.|.|.0.|.|.0.|.|.|.0.|.0") {
      b = "مُتَفَعِلُنْ مُتَفَاعِلُنْ مُتَفَاعِلْ   ";
      c = Kamil + " " + Tam;
      d = mkta;
      e = Aila + Ab;
    } else if (elm === "|.0.|.0.|.|.0.|.|.|.|.|.0.|.|.|.0.|.0") {
      b = "مُتْفَاعِلُنْ مُتَفَعِلُنْ مُتَفَاعِلْ   ";
      c = Kamil + " " + Tam;
      d = mkta;
      e = Aila + Ab + " و " + Edmare;
    } else if (elm === "|.|.|.|.|.0.|.0.|.0.|.|.0.|.|.|.0.|.0") {
      b = "مُتَفَعِلُنْ مُتْفَاعِلُنْ مُتَفَاعِلْ   ";
      c = Kamil + " " + Tam;
      d = mkta;
      e = Aila + Ab + " و " + Edmare;
    }
    /*-------- الضرب  أحذ مضمر -----*/
    if (elm === "|.|.|.0.|.|.0.|.|.|.0.|.|.0.|.0.|.0") {
      b = "مُتَفَاعِلُنْ مُتَفَاعِلُنْ مُتْفَا   ";
      c = Kamil + " " + Tam;
      d = AHadd;
    } else if (elm === "|.0.|.0.|.|.0.|.0.|.0.|.|.0.|.0.|.0") {
      b = "مُتْفَاعِلُنْ مُتْفَاعِلُنْ مُتْفَا   ";
      c = Kamil + " " + Tam;
      d = AHadd;
      e = Aila + Edmare;
    } else if (elm === "|.|.|.0.|.|.0.|.0.|.0.|.|.0.|.0.|.0") {
      b = "مُتَفَاعِلُنْ مُتْفَاعِلُنْ مُتْفَا   ";
      c = Kamil + " " + Tam;
      d = AHadd;
      e = Aila + Edmare;
    } else if (elm === "|.0.|.0.|.|.0.|.|.|.0.|.|.0.|.0.|.0") {
      b = "مُتْفَاعِلُنْ مُتَفَاعِلُنْ مُتْفَا   ";
      c = Kamil + " " + Tam;
      d = AHadd;
      e = Aila + Edmare;
    } else if (elm === "|.|.|.|.|.0.|.|.|.|.|.0.|.0.|.0") {
      b = "مُتَفَعِلُنْ مُتَفَعِلُنْ مُتْفَا   ";
      c = Kamil + " " + Tam;
      d = AHadd;
      e = Aila + Ab;
    } else if (elm === "|.|.|.0.|.|.0.|.|.|.|.|.0.|.0.|.0") {
      b = "مُتَفَاعِلُنْ مُتَفَعِلُنْ مُتْفَا   ";
      c = Kamil + " " + Tam;
      d = AHadd;
      e = Aila + Ab;
    } else if (elm === "|.|.|.|.|.0.|.|.|.0.|.|.0.|.0.|.0") {
      b = "مُتَفَعِلُنْ مُتَفَاعِلُنْ مُتْفَا   ";
      c = Kamil + " " + Tam;
      d = AHadd;
      e = Aila + Ab;
    } else if (elm === "|.0.|.0.|.|.0.|.|.|.|.|.0.|.0.|.0") {
      b = "مُتْفَاعِلُنْ مُتَفَعِلُنْ مُتْفَا   ";
      c = Kamil + " " + Tam;
      d = AHadd;
      e = Aila + Ab + " و " + Edmare;
    } else if (elm === "|.|.|.|.|.0.|.0.|.0.|.|.0.|.0.|.0") {
      b = "مُتَفَعِلُنْ مُتْفَاعِلُنْ مُتْفَا   ";
      c = Kamil + " " + Tam;
      d = AHadd;
      e = Aila + Ab + " و " + Edmare;
    }
    /*-------- حذاء  -----*/
    if (elm === "|.|.|.0.|.|.0.|.|.|.0.|.|.0.|.|.|.0") {
      b = "مُتَفَاعِلُنْ مُتَفَاعِلُنْ مُتَفَا   ";
      c = Kamil + " " + Tam;
      d = Hadaa;
    } else if (elm === "|.0.|.0.|.|.0.|.0.|.0.|.|.0.|.|.|.0") {
      b = "مُتْفَاعِلُنْ مُتْفَاعِلُنْ مُتَفَا   ";
      c = Kamil + " " + Tam;
      d = Hadaa;
      e = Aila + Edmare;
    } else if (elm === "|.|.|.0.|.|.0.|.0.|.0.|.|.0.|.|.|.0") {
      b = "مُتَفَاعِلُنْ مُتْفَاعِلُنْ مُتَفَا   ";
      c = Kamil + " " + Tam;
      d = Hadaa;
      e = Aila + Edmare;
    } else if (elm === "|.0.|.0.|.|.0.|.|.|.0.|.|.0.|.|.|.0") {
      b = "مُتْفَاعِلُنْ مُتَفَاعِلُنْ مُتَفَا   ";
      c = Kamil + " " + Tam;
      d = Hadaa;
      e = Aila + Edmare;
    } else if (elm === "|.|.|.|.|.0.|.|.|.|.|.0.|.|.|.0") {
      b = "مُتَفَعِلُنْ مُتَفَعِلُنْ مُتَفَا   ";
      c = Kamil + " " + Tam;
      d = Hadaa;
      e = Aila + Ab;
    } else if (elm === "|.|.|.0.|.|.0.|.|.|.|.|.0.|.|.|.0") {
      b = "مُتَفَاعِلُنْ مُتَفَعِلُنْ مُتَفَا   ";
      c = Kamil + " " + Tam;
      d = Hadaa;
      e = Aila + Ab;
    } else if (elm === "|.|.|.|.|.0.|.|.|.0.|.|.0.|.|.|.0") {
      b = "مُتَفَعِلُنْ مُتَفَاعِلُنْ مُتَفَا   ";
      c = Kamil + " " + Tam;
      d = Hadaa;
      e = Aila + Ab;
    } else if (elm === "|.0.|.0.|.|.0.|.|.|.|.|.0.|.|.|.0") {
      b = "مُتْفَاعِلُنْ مُتَفَعِلُنْ مُتَفَا   ";
      c = Kamil + " " + Tam;
      d = Hadaa;
      e = Aila + Ab + " و " + Edmare;
    } else if (elm === "|.|.|.|.|.0.|.0.|.0.|.|.0.|.|.|.0") {
      b = "مُتَفَعِلُنْ مُتْفَاعِلُنْ مُتَفَا   ";
      c = Kamil + " " + Tam;
      d = Hadaa;
      e = Aila + Ab + " و " + Edmare;
    }
    /*مجزوء  الكامل  */
    if (elm === "|.|.|.0.|.|.0.|.|.|.0.|.|.0") {
      b = "مُتَفَاعِلُنْ مُتَفَاعِلُنْ    ";
      c = Kamil + " " + Mj;
      d = kt1;
    } else if (elm === "|.0.|.0.|.|.0.|.0.|.0.|.|.0") {
      b = "مُتْفَاعِلُنْ مُتْفَاعِلُنْ    ";
      c = Kamil + " " + Mj;
      d = kt1;
      e = Aila + Edmare;
    } else if (elm === "|.|.|.|.|.0.|.|.|.0.|.|.0") {
      b = "مُتَفَعِلُنْ مُتَفَاعِلُنْ    ";
      c = Kamil + " " + Mj;
      d = kt1;
      e = Aila + Ab;
    }
    /*---الضرب مقطوع--- */
    if (elm === "|.|.|.0.|.|.0.|.|.|.0.|.0") {
      b = "مُتَفَاعِلُنْ  مُتَفَاعِلْ   ";
      c = Kamil + " " + Mj;
      d = mkta;
    } else if (elm === "|.|.|.|.|.0.|.|.|.0.|.0") {
      b = "مُتَفَعِلُنْ  مُتَفَاعِلْ   ";
      c = Kamil + " " + Mj;
      d = mkta;
      e = Aila + Ab;
    } else if (elm === "|.0.|.0.|.|.0.|.|.|.0.|.0") {
      b = "مُتْفَاعِلُنْ  مُتَفَاعِلْ   ";
      c = Kamil + " " + Mj;
      d = mkta;
      e = Aila + Edmare;
    }
    /*---الضرب مذيل--- */
    if (elm === "|.|.|.0.|.|.0.|.|.|.0.|.|.0.0") {
      b = "مُتَفَاعِلُنْ مُتَفَاعِلَانْ   ";
      c = Kamil + " " + Mj;
      d = Moda;
    } else if (elm === "|.0.|.0.|.|.0.|.|.|.0.|.|.0.0") {
      b = "مُتْفَاعِلُنْ مُتَفَاعِلَانْ   ";
      c = Kamil + " " + Mj;
      d = Moda;
      e = Aila + Edmare;
    }
    if (elm === "|.|.|.|.|.0.|.|.|.0.|.|.0.0") {
      b = "مُتَفَعِلُنْ مُتَفَاعِلَانْ   ";
      c = Kamil + " " + Mj;
      d = Moda;
      e = Aila + Ab;
    }
    /*----الضرب مرفل--- */
    if (elm === "|.|.|.0.|.|.0.|.|.|.0.|.|.0.|.0") {
      b = "مُتَفَاعِلُنْ مُتَفَاعِلَاتُنْ   ";
      c = Kamil + " " + Mj;
      d = Mora;
    } else if (elm === "|.0.|.0.|.|.0.|.|.|.0.|.|.0.|.0") {
      b = "مُتْفَاعِلُنْ مُتَفَاعِلَاتُنْ   ";
      c = Kamil + " " + Mj;
      d = Mora;
      e = Aila + Edmare;
    }
    if (elm === "|.|.|.|.|.0.|.|.|.0.|.|.0.|.0") {
      b = "مُتَفَعِلُنْ مُتَفَاعِلَاتُنْ   ";
      c = Kamil + " " + Mj;
      d = Mora;
      e = Aila + Ab;
    }
    /*الهزرج-------------------------------------*/
    if (elm === "|.|.0.|.0.|.0.|.|.0.|.0.|.0") {
      b = "مَفَاعِيلُنْ مَفَاعِيلُنْ   ";
      c = Hazraj + " " + Mj;
      d = kt1;
    } else if (elm === "|.|.0.|.0.|.|.|.0.|.0.|.0") {
      b = "مَفَاعِيلُ مَفَاعِيلُنْ   ";
      c = Hazraj + " " + Mj;
      d = kt1;
      e = Aila + Kaf;
    }
    /*------*/
    if (elm === "|.|.0.|.0.|.0.|.|.0.|.0") {
      b = "مَفَاعِيلُنْ مَفَاعِي   ";
      c = Hazraj + " " + Mj;
      d = kt1;
    } else if (elm === "|.|.0.|.0.|.|.|.0.|.0") {
      b = "مَفَاعِيلُ مَفَاعِي   ";
      c = Hazraj + " " + Mj;
      d = kt1;
      e = Aila + Kaf;
    }
    /*الرزج------------------------------------------------------------------------------*/
    /*العروض  صحيحة */
    if (elm === "|.0.|.0.|.|.0.|.0.|.0.|.|.0.|.0.|.0.|.|.0") {
      b = "مُسْتَفْعِلُنْ مُسْتَفْعِلُنْ مُسْتَفْعِلُنْ   ";
      c = Rajaz + " " + Tam;
      d = kt1;
    } else if (elm === "|.0.|.0.|.|.0.|.|.0.|.|.0.|.0.|.0.|.|.0") {
      b = "مُسْتَفْعِلُنْ مُتَفْعِلُنْ مُسْتَفْعِلُنْ   ";
      c = Rajaz + " " + Tam;
      d = kt1;
      e = Aila + Aa;
    } else if (elm === "|.|.0.|.|.0.|.|.0.|.|.0.|.0.|.0.|.|.0") {
      b = "مُتَفْعِلُنْ مُتَفْعِلُنْ مُسْتَفْعِلُنْ   ";
      c = Rajaz + " " + Tam;
      d = kt1;
      e = Aila + Aa;
    } else if (elm === "|.|.0.|.|.0.|.0.|.0.|.|.0.|.0.|.0.|.|.0") {
      b = "مُتَفْعِلُنْ مُسْتَفْعِلُنْ مُسْتَفْعِلُنْ   ";
      c = Rajaz + " " + Tam;
      d = kt1;
      e = Aila + Aa;
    } else if (elm === "|.0.|.|.|.0.|.0.|.0.|.|.0.|.0.|.0.|.|.0") {
      b = "مُسْتَعِلُنْ مُسْتَفْعِلُنْ مُسْتَفْعِلُنْ   ";
      c = Rajaz + " " + Tam;
      d = kt1;
      e = Aila + Ab;
    } else if (elm === "|.0.|.0.|.|.0.|.0.|.|.|.0.|.0.|.0.|.|.0") {
      b = "مُسْتَفْعِلُنْ مُسْتَعِلُنْ مُسْتَفْعِلُنْ   ";
      c = Rajaz + " " + Tam;
      d = kt1;
      e = Aila + Ab;
    } else if (elm === "|.0.|.|.|.0.|.0.|.|.|.0.|.0.|.0.|.|.0") {
      b = "مُسْتَعِلُنْ مُسْتَعِلُنْ مُسْتَفْعِلُنْ   ";
      c = Rajaz + " " + Tam;
      d = kt1;
      e = Aila + Ab;
    } else if (elm === "|.|.|.|.0.|.0.|.0.|.|.0.|.0.|.0.|.|.0") {
      b = "مُتَعِلُنْ مُسْتَفْعِلُنْ مُسْتَفْعِلُنْ ";
      c = Rajaz + " " + Tam;
      d = kt1;
      e = Aila + Ac;
    } else if (elm === "|.0.|.0.|.|.0.|.|.|.|.0.|.0.|.0.|.|.0") {
      b = "مُسْتَفْعِلُنْ مُتَعِلُنْ مُسْتَفْعِلُنْ   ";
      c = Rajaz + " " + Tam;
      d = kt1;
      e = Aila + Ac;
    } else if (elm === "|.|.|.|.0.|.|.|.|.0.|.0.|.0.|.|.0") {
      b = "مُتَعِلُنْ مُتَعِلُنْ مُسْتَفْعِلُنْ   ";
      c = Rajaz + " " + Tam;
      d = kt1;
      e = Aila + Ac;
    } else if (elm === "|.0.|.|.|.0.|.0.|.0.|.|.0.|.0.|.0.|.|.0") {
      b = "مُسْتَعِلُنْ مُتَعِلُنْ مُسْتَفْعِلُنْ   ";
      c = Rajaz + " " + Tam;
      d = kt1;
      e = Aila + Ab + " و " + Ac;
    } else if (elm === "|.0.|.0.|.|.0.|.0.|.|.|.0.|.0.|.0.|.|.0") {
      b = "مُتَعِلُنْ مُسْتَعِلُنْ مُسْتَفْعِلُنْ   ";
      c = Rajaz + " " + Tam;
      d = kt1;
      e = Aila + Ab + " و " + Ac;
    } else if (elm === "|.0.|.|.|.0.|.|.0.|.|.0.|.0.|.0.|.|.0") {
      b = "مُسْتَعِلُنْ مُتَفْعِلُنْ مُسْتَفْعِلُنْ   ";
      c = Rajaz + " " + Tam;
      d = kt1;
      e = Aila + Aa + " و " + Ab;
    } else if (elm === "|.|.0.|.|.0.|.0.|.|.|.0.|.0.|.0.|.|.0") {
      b = "مُتَفْعِلُنْ مُسْتَعِلُنْ مُسْتَفْعِلُنْ ";
      c = Rajaz + " " + Tam;
      d = kt1;
      e = Aila + Aa + " و " + Ab;
    } else if (elm === "|.0.|.|.|.0.|.|.|.|.0.|.0.|.0.|.|.0") {
      b = "مُسْتَعِلُنْ مُتَعِلُنْ مُسْتَفْعِلُنْ   ";
      c = Rajaz + " " + Tam;
      d = kt1;
      e = Aila + Aa + " و " + Ac;
    } else if (elm === "|.|.|.|.0.|.0.|.|.|.0.|.0.|.0.|.|.0") {
      b = "مُتَعِلُنْ مُسْتَعِلُنْ مُسْتَفْعِلُنْ ";
      c = Rajaz + " " + Tam;
      d = kt1;
      e = Aila + Aa + " و " + Ac;
    }
    /*العروض  أو الضرب ذخلهما زحاف من زحافات الحشو */
    /*الخبن */
    if (elm === "|.0.|.0.|.|.0.|.0.|.0.|.|.0.|.|.0.|.|.0") {
      b = "مُسْتَفْعِلُنْ مُسْتَفْعِلُنْ مُتَفْعِلُنْ   ";
      c = Rajaz + " " + Tam;
      d = mkhb;
    } else if (elm === "|.0.|.0.|.|.0.|.|.0.|.|.0.|.|.0.|.|.0") {
      b = "مُسْتَفْعِلُنْ مُتَفْعِلُنْ مُتَفْعِلُنْ   ";
      c = Rajaz + " " + Tam;
      d = mkhb;
      e = Aila + Aa;
    } else if (elm === "|.|.0.|.|.0.|.|.0.|.|.0.|.0.|.0.|.|.0") {
      b = "مُتَفْعِلُنْ مُتَفْعِلُنْ مُتَفْعِلُنْ   ";
      c = Rajaz + " " + Tam;
      d = mkhb;
      e = Aila + Aa;
    } else if (elm === "|.|.0.|.|.0.|.0.|.0.|.|.0.|.|.0.|.|.0") {
      b = "مُتَفْعِلُنْ مُسْتَفْعِلُنْ مُتَفْعِلُنْ   ";
      c = Rajaz + " " + Tam;
      d = mkhb;
      e = Aila + Aa;
    } else if (elm === "|.0.|.|.|.0.|.0.|.0.|.|.0.|.|.0.|.|.0") {
      b = "مُسْتَعِلُنْ مُسْتَفْعِلُنْ مُتَفْعِلُنْ   ";
      c = Rajaz + " " + Tam;
      d = mkhb;
      e = Aila + Ab;
    } else if (elm === "|.0.|.0.|.|.0.|.0.|.|.|.0.|.|.0.|.|.0") {
      b = "مُسْتَفْعِلُنْ مُسْتَعِلُنْ مُتَفْعِلُنْ   ";
      c = Rajaz + " " + Tam;
      d = mkhb;
      e = Aila + Ab;
    } else if (elm === "|.0.|.|.|.0.|.0.|.|.|.0.|.|.0.|.|.0") {
      b = "مُسْتَعِلُنْ مُسْتَعِلُنْ مُتَفْعِلُنْ   ";
      c = Rajaz + " " + Tam;
      d = mkhb;
      e = Aila + Ab;
    } else if (elm === "|.|.|.|.0.|.0.|.0.|.|.0.|.0.|.0.|.|.0") {
      b = "مُتَعِلُنْ مُسْتَفْعِلُنْ مُسْتَفْعِلُنْ ";
      c = Rajaz + " " + Tam;
      d = mkhb;
      e = Aila + Ac;
    } else if (elm === "|.0.|.0.|.|.0.|.|.|.|.0.|.|.0.|.|.0") {
      b = "مُسْتَفْعِلُنْ مُتَعِلُنْ مُتَفْعِلُنْ   ";
      c = Rajaz + " " + Tam;
      d = mkhb;
      e = Aila + Ac;
    } else if (elm === "|.|.|.|.0.|.|.|.|.0.|.|.0.|.|.0") {
      b = "مُتَعِلُنْ مُتَعِلُنْ مُتَفْعِلُنْ   ";
      c = Rajaz + " " + Tam;
      d = mkhb;
      e = Aila + Ac;
    } else if (elm === "|.0.|.|.|.0.|.0.|.0.|.|.0.|.|.0.|.|.0") {
      b = "مُسْتَعِلُنْ مُتَعِلُنْ مُتَفْعِلُنْ   ";
      c = Rajaz + " " + Tam;
      d = mkhb;
      e = Aila + Ab + " و " + Ac;
    } else if (elm === "|.0.|.0.|.|.0.|.0.|.|.|.0.|.|.0.|.|.0") {
      b = "مُتَعِلُنْ مُسْتَعِلُنْ مُتَفْعِلُنْ   ";
      c = Rajaz + " " + Tam;
      d = mkhb;
      e = Aila + Ab + " و " + Ac;
    } else if (elm === "|.0.|.|.|.0.|.|.0.|.|.0.|.|.0.|.|.0") {
      b = "مُسْتَعِلُنْ مُتَفْعِلُنْ مُتَفْعِلُنْ   ";
      c = Rajaz + " " + Tam;
      d = mkhb;
      e = Aila + Aa + " و " + Ab;
    } else if (elm === "|.|.0.|.|.0.|.0.|.|.|.0.|.|.0.|.|.0") {
      b = "مُتَفْعِلُنْ مُسْتَعِلُنْ مُتَفْعِلُنْ ";
      c = Rajaz + " " + Tam;
      d = mkhb;
      e = Aila + Aa + " و " + Ab;
    } else if (elm === "|.0.|.|.|.0.|.|.|.|.0.|.|.0.|.|.0") {
      b = "مُسْتَعِلُنْ مُتَعِلُنْ مُتَفْعِلُنْ   ";
      c = Rajaz + " " + Tam;
      d = mkhb;
      e = Aila + Aa + " و " + Ac;
    } else if (elm === "|.|.|.|.0.|.0.|.|.|.0.|.|.0.|.|.0") {
      b = "مُتَعِلُنْ مُسْتَعِلُنْ مُتَفْعِلُنْ ";
      c = Rajaz + " " + Tam;
      d = mkhb;
      e = Aila + Aa + " و " + Ac;
    }
    /*الطي */
    if (elm === "|.0.|.0.|.|.0.|.0.|.0.|.|.0.|.0.|.|.|.0") {
      b = "مُسْتَفْعِلُنْ مُسْتَفْعِلُنْ مُسْتَعِلُنْ   ";
      c = Rajaz + " " + Tam;
      d = MatW;
    } else if (elm === "|.0.|.0.|.|.0.|.|.0.|.|.0.|.0.|.|.|.0") {
      b = "مُسْتَفْعِلُنْ مُتَفْعِلُنْ مُسْتَعِلُنْ   ";
      c = Rajaz + " " + Tam;
      d = MatW;
      e = Aila + Aa;
    } else if (elm === "|.|.0.|.|.0.|.|.0.|.|.0.|.0.|.|.|.0") {
      b = "مُتَفْعِلُنْ مُتَفْعِلُنْ مُسْتَعِلُنْ   ";
      c = Rajaz + " " + Tam;
      d = MatW;
      e = Aila + Aa;
    } else if (elm === "|.|.0.|.|.0.|.0.|.0.|.|.0.|.0.|.|.|.0") {
      b = "مُتَفْعِلُنْ مُسْتَفْعِلُنْ مُسْتَعِلُنْ   ";
      c = Rajaz + " " + Tam;
      d = MatW;
      e = Aila + Aa;
    } else if (elm === "|.0.|.|.|.0.|.0.|.0.|.|.0.|.0.|.|.|.0") {
      b = "مُسْتَعِلُنْ مُسْتَفْعِلُنْ مُسْتَعِلُنْ   ";
      c = Rajaz + " " + Tam;
      d = MatW;
      e = Aila + Ab;
    } else if (elm === "|.0.|.0.|.|.0.|.0.|.|.|.0.|.0.|.|.|.0") {
      b = "مُسْتَفْعِلُنْ مُسْتَعِلُنْ مُسْتَعِلُنْ   ";
      c = Rajaz + " " + Tam;
      d = MatW;
      e = Aila + Ab;
    } else if (elm === "|.0.|.|.|.0.|.0.|.|.|.0.|.0.|.|.|.0") {
      b = "مُسْتَعِلُنْ مُسْتَعِلُنْ مُسْتَعِلُنْ   ";
      c = Rajaz + " " + Tam;
      d = MatW;
      e = Aila + Ab;
    } else if (elm === "|.|.|.|.0.|.0.|.0.|.|.0.|.0.|.|.|.0") {
      b = "مُتَعِلُنْ مُسْتَفْعِلُنْ مُسْتَعِلُنْ ";
      c = Rajaz + " " + Tam;
      d = MatW;
      e = Aila + Ac;
    } else if (elm === "|.0.|.0.|.|.0.|.|.|.|.0.|.0.|.|.|.0") {
      b = "مُسْتَفْعِلُنْ مُتَعِلُنْ مُسْتَعِلُنْ   ";
      c = Rajaz + " " + Tam;
      d = MatW;
      e = Aila + Ac;
    } else if (elm === "|.|.|.|.0.|.|.|.|.0.|.0.|.|.|.0") {
      b = "مُتَعِلُنْ مُتَعِلُنْ مُسْتَعِلُنْ   ";
      c = Rajaz + " " + Tam;
      d = MatW;
      e = Aila + Ac;
    } else if (elm === "|.0.|.|.|.0.|.0.|.0.|.|.0.|.0.|.|.|.0") {
      b = "مُسْتَعِلُنْ مُتَعِلُنْ مُسْتَعِلُنْ   ";
      c = Rajaz + " " + Tam;
      d = MatW;
      e = Aila + Ab + " و " + Ac;
    } else if (elm === "|.0.|.0.|.|.0.|.0.|.|.|.0.|.0.|.|.|.0") {
      b = "مُتَعِلُنْ مُسْتَعِلُنْ مُسْتَعِلُنْ   ";
      c = Rajaz + " " + Tam;
      d = MatW;
      e = Aila + Ab + " و " + Ac;
    } else if (elm === "|.0.|.|.|.0.|.|.0.|.|.0.|.0.|.|.|.0") {
      b = "مُسْتَعِلُنْ مُتَفْعِلُنْ مُسْتَعِلُنْ   ";
      c = Rajaz + " " + Tam;
      d = MatW;
      e = Aila + Aa + " و " + Ab;
    } else if (elm === "|.|.0.|.|.0.|.0.|.|.|.0.|.0.|.|.|.0") {
      b = "مُتَفْعِلُنْ مُسْتَعِلُنْ مُسْتَعِلُنْ ";
      c = Rajaz + " " + Tam;
      d = MatW;
      e = Aila + Aa + " و " + Ab;
    } else if (elm === "|.0.|.|.|.0.|.|.|.|.0.|.0.|.|.|.0") {
      b = "مُسْتَعِلُنْ مُتَعِلُنْ مُسْتَعِلُنْ   ";
      c = Rajaz + " " + Tam;
      d = MatW;
      e = Aila + Aa + " و " + Ac;
    } else if (elm === "|.|.|.|.0.|.0.|.|.|.0.|.0.|.|.|.0") {
      b = "مُتَعِلُنْ مُسْتَعِلُنْ مُسْتَعِلُنْ ";
      c = Rajaz + " " + Tam;
      d = MatW;
      e = Aila + Aa + " و " + Ac;
    }
    /*الخبل */
    if (elm === "|.0.|.0.|.|.0.|.0.|.0.|.|.0.|.|.|.|.0") {
      b = "مُسْتَفْعِلُنْ مُسْتَفْعِلُنْ مُتَعِلُنْ   ";
      c = Rajaz + " " + Tam;
      d = MakB;
    } else if (elm === "|.0.|.0.|.|.0.|.|.0.|.|.0.|.0.|.|.|.0") {
      b = "مُسْتَفْعِلُنْ مُتَفْعِلُنْ مُسْتَعِلُنْ   ";
      c = Rajaz + " " + Tam;
      d = kt1;
      e = Aila + Aa;
    } else if (elm === "|.|.0.|.|.0.|.|.0.|.|.0.|.|.|.|.0") {
      b = "مُتَفْعِلُنْ مُتَفْعِلُنْ مُتَعِلُنْ   ";
      c = Rajaz + " " + Tam;
      d = MakB;
      e = Aila + Aa;
    } else if (elm === "|.|.0.|.|.0.|.0.|.0.|.|.0.|.|.|.|.0") {
      b = "مُتَفْعِلُنْ مُسْتَفْعِلُنْ مُتَعِلُنْ   ";
      c = Rajaz + " " + Tam;
      d = MakB;
      e = Aila + Aa;
    } else if (elm === "|.0.|.|.|.0.|.0.|.0.|.|.0.|.|.|.|.0") {
      b = "مُسْتَعِلُنْ مُسْتَفْعِلُنْ مُتَعِلُنْ   ";
      c = Rajaz + " " + Tam;
      d = MakB;
      e = Aila + Ab;
    } else if (elm === "|.0.|.0.|.|.0.|.0.|.|.|.0.|.|.|.|.0") {
      b = "مُسْتَفْعِلُنْ مُسْتَعِلُنْ مُتَعِلُنْ   ";
      c = Rajaz + " " + Tam;
      d = MakB;
      e = Aila + Ab;
    } else if (elm === "|.0.|.|.|.0.|.0.|.|.|.0.|.|.|.|.0") {
      b = "مُسْتَعِلُنْ مُسْتَعِلُنْ مُتَعِلُنْ   ";
      c = Rajaz + " " + Tam;
      d = MakB;
      e = Aila + Ab;
    } else if (elm === "|.|.|.|.0.|.0.|.0.|.|.0.|.|.|.|.0") {
      b = "مُتَعِلُنْ مُسْتَفْعِلُنْ مُتَعِلُنْ ";
      c = Rajaz + " " + Tam;
      d = MakB;
      e = Aila + Ac;
    } else if (elm === "|.0.|.0.|.|.0.|.|.|.|.0.|.|.|.|.0") {
      b = "مُسْتَفْعِلُنْ مُتَعِلُنْ مُتَعِلُنْ   ";
      c = Rajaz + " " + Tam;
      d = MakB;
      e = Aila + Ac;
    } else if (elm === "|.|.|.|.0.|.|.|.|.0.|.|.|.|.0") {
      b = "مُتَعِلُنْ مُتَعِلُنْ مُتَعِلُنْ   ";
      c = Rajaz + " " + Tam;
      d = MakB;
      e = Aila + Ac;
    } else if (elm === "|.0.|.|.|.0.|.0.|.0.|.|.0.|.|.|.|.0") {
      b = "مُسْتَعِلُنْ مُتَعِلُنْ مُتَعِلُنْ   ";
      c = Rajaz + " " + Tam;
      d = MakB;
      e = Aila + Ab + " و " + Ac;
    } else if (elm === "|.0.|.0.|.|.0.|.0.|.|.|.0.|.|.|.|.0") {
      b = "مُتَعِلُنْ مُسْتَعِلُنْ مُتَعِلُنْ   ";
      c = Rajaz + " " + Tam;
      d = MakB;
      e = Aila + Ab + " و " + Ac;
    } else if (elm === "|.0.|.|.|.0.|.|.0.|.|.0.|.|.|.|.0") {
      b = "مُسْتَعِلُنْ مُتَفْعِلُنْ مُتَعِلُنْ   ";
      c = Rajaz + " " + Tam;
      d = MakB;
      e = Aila + Aa + " و " + Ab;
    } else if (elm === "|.|.0.|.|.0.|.0.|.|.|.0.|.|.|.|.0") {
      b = "مُتَفْعِلُنْ مُسْتَعِلُنْ مُتَعِلُنْ ";
      c = Rajaz + " " + Tam;
      d = MakB;
      e = Aila + Aa + " و " + Ab;
    } else if (elm === "|.0.|.|.|.0.|.|.|.|.0.|.|.|.|.0") {
      b = "مُسْتَعِلُنْ مُتَعِلُنْ مُتَعِلُنْ   ";
      c = Rajaz + " " + Tam;
      d = MakB;
      e = Aila + Aa + " و " + Ac;
    } else if (elm === "|.|.|.|.0.|.0.|.|.|.0.|.|.|.|.0") {
      b = "مُتَعِلُنْ مُسْتَعِلُنْ مُتَعِلُنْ ";
      c = Rajaz + " " + Tam;
      d = MakB;
      e = Aila + Aa + " و " + Ac;
    }
    /*مقطوعة */
    if (elm === "|.0.|.0.|.|.0.|.0.|.0.|.|.0.|.0.|.0.|.0") {
      b = "مُسْتَفْعِلُنْ مُسْتَفْعِلُنْ مُسْتَفْعِلْ   ";
      c = Rajaz + " " + Tam;
      d = mkta;
    } else if (elm === "|.0.|.0.|.|.0.|.|.0.|.|.0.|.0.|.0.|.0") {
      b = "مُسْتَفْعِلُنْ مُتَفْعِلُنْ مُسْتَفْعِلْ   ";
      c = Rajaz + " " + Tam;
      d = mkta;
      e = Aila + Aa;
    } else if (elm === "|.|.0.|.|.0.|.|.0.|.|.0.|.0.|.0.|.0") {
      b = "مُتَفْعِلُنْ مُتَفْعِلُنْ مُسْتَفْعِلْ   ";
      c = Rajaz + " " + Tam;
      d = mkta;
      e = Aila + Aa;
    } else if (elm === "|.|.0.|.|.0.|.0.|.0.|.|.0.|.0.|.0.|.0") {
      b = "مُتَفْعِلُنْ مُسْتَفْعِلُنْ مُسْتَفْعِلْ   ";
      c = Rajaz + " " + Tam;
      d = mkta;
      e = Aila + Aa;
    } else if (elm === "|.0.|.|.|.0.|.0.|.0.|.|.0.|.0.|.0.|.0") {
      b = "مُسْتَعِلُنْ مُسْتَفْعِلُنْ مُسْتَفْعِلْ   ";
      c = Rajaz + " " + Tam;
      d = mkta;
      e = Aila + Ab;
    } else if (elm === "|.0.|.0.|.|.0.|.0.|.|.|.0.|.0.|.0.|.0") {
      b = "مُسْتَفْعِلُنْ مُسْتَعِلُنْ مُسْتَفْعِلْ   ";
      c = Rajaz + " " + Tam;
      d = mkta;
      e = Aila + Ab;
    } else if (elm === "|.0.|.|.|.0.|.0.|.|.|.0.|.0.|.0.|.0") {
      b = "مُسْتَعِلُنْ مُسْتَعِلُنْ مُسْتَفْعِلْ   ";
      c = Rajaz + " " + Tam;
      d = mkta;
      e = Aila + Ab;
    } else if (elm === "|.|.|.|.0.|.0.|.0.|.|.0.|.0.|.0.|.0") {
      b = "مُتَعِلُنْ مُسْتَفْعِلُنْ مُسْتَفْعِلْ ";
      c = Rajaz + " " + Tam;
      d = mkta;
      e = Aila + Ac;
    } else if (elm === "|.0.|.0.|.|.0.|.|.|.|.0.|.0.|.0.|.0") {
      b = "مُسْتَفْعِلُنْ مُتَعِلُنْ مُسْتَفْعِلْ   ";
      c = Rajaz + " " + Tam;
      d = mkta;
      e = Aila + Ac;
    } else if (elm === "|.|.|.|.0.|.|.|.|.0.|.0.|.0.|.0") {
      b = "مُتَعِلُنْ مُتَعِلُنْ مُسْتَفْعِلْ   ";
      c = Rajaz + " " + Tam;
      d = mkta;
      e = Aila + Ac;
    } else if (elm === "|.0.|.|.|.0.|.0.|.0.|.|.0.|.0.|.0.|.0") {
      b = "مُسْتَعِلُنْ مُتَعِلُنْ مُسْتَفْعِلْ   ";
      c = Rajaz + " " + Tam;
      d = mkta;
      e = Aila + Ab + " و " + Ac;
    } else if (elm === "|.0.|.0.|.|.0.|.0.|.|.|.0.|.0.|.0.|.0") {
      b = "مُتَعِلُنْ مُسْتَعِلُنْ مُسْتَفْعِلْ   ";
      c = Rajaz + " " + Tam;
      d = mkta;
      e = Aila + Ab + " و " + Ac;
    } else if (elm === "|.0.|.|.|.0.|.|.0.|.|.0.|.0.|.0.|.0") {
      b = "مُسْتَعِلُنْ مُتَفْعِلُنْ مُسْتَفْعِلْ   ";
      c = Rajaz + " " + Tam;
      d = mkta;
      e = Aila + Aa + " و " + Ab;
    } else if (elm === "|.|.0.|.|.0.|.0.|.|.|.0.|.0.|.0.|.0") {
      b = "مُتَفْعِلُنْ مُسْتَعِلُنْ مُسْتَفْعِلْ ";
      c = Rajaz + " " + Tam;
      d = mkta;
      e = Aila + Aa + " و " + Ab;
    } else if (elm === "|.0.|.|.|.0.|.|.|.|.0.|.0.|.0.|.0") {
      b = "مُسْتَعِلُنْ مُتَعِلُنْ مُسْتَفْعِلْ   ";
      c = Rajaz + " " + Tam;
      d = mkta;
      e = Aila + Aa + " و " + Ac;
    } else if (elm === "|.|.|.|.0.|.0.|.|.|.0.|.0.|.0.|.0") {
      b = "مُتَعِلُنْ مُسْتَعِلُنْ مُسْتَفْعِلْ ";
      c = Rajaz + " " + Tam;
      d = mkta;
      e = Aila + Aa + " و " + Ac;
    }
    /*المجزوء  */
    /*صحيحة */
    if (elm === "|.0.|.0.|.|.0.|.0.|.0.|.|.0") {
      b = "مُسْتَفْعِلُنْ مُسْتَفْعِلُنْ    ";
      c = Rajaz + " " + Mj;
      d = kt1;
      e = "  ";
    } else if (elm === "|.0.|.|.|.0.|.0.|.0.|.|.0") {
      b = "مُسْتَعِلُنْ مُسْتَفْعِلُنْ    ";
      c = Rajaz + " " + Mj;
      d = kt1;
      e = Aila + Ab;
    } else if (elm === "|.|.|.|.0.|.0.|.0.|.|.0") {
      b = "مُتَعِلُنْ مُسْتَفْعِلُنْ    ";
      c = Rajaz + " " + Mj;
      d = kt1;
      e = Aila + Ac;
    } else if (elm === "|.|.0.|.|.0.|.0.|.0.|.|.0") {
      b = "مُتَفْعِلُنْ مُسْتَفْعِلُنْ    ";
      c = Rajaz + " " + Mj;
      d = kt1;
      e = Aila + Aa;
    }
    /*مخبونة */
    if (elm === "|.0.|.0.|.|.0.|.|.0.|.|.0") {
      b = "مُسْتَفْعِلُنْ مُتَفْعِلُنْ    ";
      c = Rajaz + " " + Mj;
      d = mkhb;
    } else if (elm === "|.0.|.|.|.0.|.|.0.|.|.0") {
      b = "مُسْتَعِلُنْ مُتَفْعِلُنْ    ";
      c = Rajaz + " " + Mj;
      d = mkhb;
      e = Aila + Ab;
    } else if (elm === "|.|.|.|.0.|.|.0.|.|.0") {
      b = "مُتَعِلُنْ مُتَفْعِلُنْ    ";
      c = Rajaz + " " + Mj;
      d = mkhb;
      e = Aila + Ac;
    } else if (elm === "|.|.0.|.|.0.|.|.0.|.|.0") {
      b = "مُتَفْعِلُنْ مُتَفْعِلُنْ    ";
      c = Rajaz + " " + Mj;
      d = mkhb;
      e = Aila + Aa;
    }
    /*مطوية */
    if (elm === "|.0.|.0.|.|.0.|.0.|.|.|.0") {
      b = "مُسْتَفْعِلُنْ مُسْتَعِلُنْ    ";
      c = Rajaz + " " + Mj;
      d = MatW;
      e = "  ";
    } else if (elm === "|.0.|.|.|.0.|.0.|.|.|.0") {
      b = "مُسْتَعِلُنْ مُسْتَعِلُنْ    ";
      c = Rajaz + " " + Mj;
      d = MatW;
      e = Aila + Ab;
    } else if (elm === "|.|.|.|.0.|.0.|.|.|.0") {
      b = "مُتَعِلُنْ مُسْتَعِلُنْ    ";
      c = Rajaz + " " + Mj;
      d = MatW;
      e = Aila + Ac;
    } else if (elm === "|.|.0.|.|.0.|.0.|.|.|.0") {
      b = "مُتَفْعِلُنْ مُسْتَعِلُنْ    ";
      c = Rajaz + " " + Mj;
      d = MatW;
      e = Aila + Aa;
    }
    /*مخبولة */
    if (elm === "|.0.|.0.|.|.0.|.|.|.|.0") {
      b = "مُسْتَفْعِلُنْ مُتَعِلُنْ    ";
      c = Rajaz + " " + Mj;
      d = MakB;
    } else if (elm === "|.0.|.|.|.0.|.|.|.|.0") {
      b = "مُسْتَعِلُنْ مُتَعِلُنْ    ";
      c = Rajaz + " " + Mj;
      d = MakB;
      e = Aila + Ab;
    } else if (elm === "|.|.|.|.0.|.|.|.|.0") {
      b = "مُتَعِلُنْ مُتَعِلُنْ    ";
      c = Rajaz + " " + Mj;
      d = MakB;
      e = Aila + Ac;
    } else if (elm === "|.|.0.|.|.0.|.|.|.|.0") {
      b = "مُتَفْعِلُنْ مُتَعِلُنْ    ";
      c = Rajaz + " " + Mj;
      d = MakB;
      e = Aila + Aa;
    }
    /*منهوك الرزج */
    if (elm === "|.0.|.0.|.|.0") {
      b = "مُسْتَفْعِلُنْ     ";
      c = Rajaz + " " + ManHo;
      d = kt1;
    }
    /*الرمل -------------------------------------------------------------- */
    /*تام */
    /*العروض صحيحة */
    if (elm === "|.0.|.|.0.|.0.|.0.|.|.0.|.0.|.0.|.|.0.|.0") {
      b = " فَاعِلَاتُنْ فَاعِلَاتُنْ فَاعِلَاتُنْ   ";
      d = kt1;
      c = Ramal + " " + Tam;
    } else if (elm === "|.|.|.0.|.0.|.0.|.|.0.|.0.|.0.|.|.0.|.0") {
      b = " فَعِلَاتُنْ فَاعِلَاتُنْ فَاعِلَاتُنْ   ";
      d = kt1;
      c = Ramal + " " + Tam;
      e = Aila + Aa;
    } else if (elm === "|.0.|.|.0.|.0.|.|.|.0.|.0.|.0.|.|.0.|.0") {
      b = " فَاعِلَاتُنْ فَعِلَاتُنْ فَاعِلَاتُنْ   ";
      d = kt1;
      c = Ramal + " " + Tam;
      e = Aila + Aa;
    } else if (elm === "|.|.|.0.|.0.|.|.|.0.|.0.|.0.|.|.0.|.0") {
      b = " فَعِلَاتُنْ فَعِلَاتُنْ فَاعِلَاتُنْ   ";
      c = Ramal + " " + Tam;
      d = kt1;
      e = Aila + Aa;
    } else if (elm === "|.0.|.|.0.|.|.0.|.|.0.|.0.|.0.|.|.0.|.0") {
      b = " فَاعِلَاتُ فَاعِلَاتُنْ فَاعِلَاتُنْ   ";
      c = Ramal + " " + Tam;
      d = kt1;
      e = Aila + Kaf;
    } else if (elm === "|.0.|.|.0.|.0.|.0.|.|.0.|.|.0.|.|.0.|.0") {
      b = " فَاعِلَاتُنْ فَاعِلَاتُ فَاعِلَاتُنْ   ";
      c = Ramal + " " + Tam;
      d = kt1;
      e = Aila + Kaf;
    } else if (elm === "|.0.|.|.0.|.|.0.|.|.0.|.|.0.|.|.0.|.0") {
      b = " فَاعِلَاتُ فَاعِلَاتُ فَاعِلَاتُنْ   ";
      c = Ramal + " " + Tam;
      d = kt1;
      e = Aila + Kaf;
    } else if (elm === "|.|.|.0.|.|.0.|.|.0.|.0.|.0.|.|.0.|.0") {
      b = " فَعِلَاتُ فَاعِلَاتُنْ فَاعِلَاتُنْ   ";
      c = Ramal + " " + Tam;
      d = kt1;
      e = Aila + Chakl;
    } else if (elm === "|.0.|.|.0.|.0.|.|.|.0.|.|.0.|.|.0.|.0") {
      b = " فَاعِلَاتُنْ فَعِلَاتُ فَاعِلَاتُنْ   ";
      c = Ramal + " " + Tam;
      d = kt1;
      e = Aila + Chakl;
    } else if (elm === "|.|.|.0.|.|.|.|.0.|.|.0.|.|.0.|.0") {
      b = " فَعِلَاتُ فَعِلَاتُ فَاعِلَاتُنْ   ";
      c = Ramal + " " + Tam;
      d = kt1;
      e = Aila + Chakl;
    } else if (elm === "|.|.|.0.|.|.|.|.0.|.0.|.0.|.|.0.|.0") {
      b = " فَعِلَاتُ فَعِلَاتُنْ فَاعِلَاتُنْ   ";
      c = Ramal + " " + Tam;
      d = kt1;
      e = Aila + Chakl + " و " + Aa;
    } else if (elm === "|.|.|.0.|.0.|.|.|.0.|.|.0.|.|.0.|.0") {
      b = " فَعِلَاتُنْ فَعِلَاتُ فَاعِلَاتُنْ   ";
      c = Ramal + " " + Tam;
      d = kt1;
      e = Aila + Chakl + " و " + Aa;
    } else if (elm === "|.0.|.|.0.|.|.|.|.0.|.0.|.0.|.|.0.|.0") {
      b = " فَاعِلَاتُ فَعِلَاتُنْ فَاعِلَاتُنْ   ";
      c = Ramal + " " + Tam;
      d = kt1;
      e = Aila + Kaf + " و " + Aa;
    } else if (elm === "|.|.|.0.|.0.|.0.|.|.0.|.|.0.|.|.0.|.0") {
      b = " فَعِلَاتُنْ فَاعِلَاتُ فَاعِلَاتُنْ   ";
      c = Ramal + " " + Tam;
      d = kt1;
      e = Aila + Kaf + " و " + Aa;
    } else if (elm === "|.0.|.|.0.|.|.|.|.0.|.|.0.|.|.0.|.0") {
      b = " فَاعِلَاتُ فَعِلَاتُ فَاعِلَاتُنْ   ";
      c = Ramal + " " + Tam;
      d = kt1;
      e = Aila + Kaf + " و " + Chakl;
    } else if (elm === "|.|.|.0.|.|.0.|.|.0.|.|.0.|.|.0.|.0") {
      b = " فَعِلَاتُ فَاعِلَاتُ فَاعِلَاتُنْ   ";
      c = Ramal + " " + Tam;
      d = kt1;
      e = Aila + Kaf + " و " + Chakl;
    }
    /*العروض مخبونة */
    if (elm === "|.0.|.|.0.|.0.|.0.|.|.0.|.0.|.|.|.0.|.0") {
      b = " فَاعِلَاتُنْ فَاعِلَاتُنْ فَعِلَاتُنْ   ";
      c = Ramal + " " + Tam;
      d = mkhb;
    } else if (elm === "|.|.|.0.|.0.|.0.|.|.0.|.0.|.|.|.0.|.0") {
      b = " فَعِلَاتُنْ فَاعِلَاتُنْ    ";
      c = Ramal + " " + Tam;
      d = mkhb;
      e = Aila + Aa;
    } else if (elm === "|.0.|.|.0.|.0.|.|.|.0.|.0.|.|.|.0.|.0") {
      b = " فَاعِلَاتُنْ فَعِلَاتُنْ فَعِلَاتُنْ   ";
      c = Ramal + " " + Tam;
      d = mkhb;
      e = Aila + Aa;
    } else if (elm === "|.|.|.0.|.0.|.|.|.0.|.0.|.|.|.0.|.0") {
      b = " فَعِلَاتُنْ فَعِلَاتُنْ فَعِلَاتُنْ   ";
      c = Ramal + " " + Tam;
      d = mkhb;
      e = Aila + Aa;
    } else if (elm === "|.0.|.|.0.|.|.0.|.|.0.|.0.|.|.|.0.|.0") {
      b = " فَاعِلَاتُ فَاعِلَاتُنْ فَعِلَاتُنْ   ";
      c = Ramal + " " + Tam;
      d = mkhb;
      e = Aila + Kaf;
    } else if (elm === "|.0.|.|.0.|.0.|.0.|.|.0.|.|.|.|.0.|.0") {
      b = " فَاعِلَاتُنْ فَاعِلَاتُ فَعِلَاتُنْ   ";
      c = Ramal + " " + Tam;
      d = mkhb;
      e = Aila + Kaf;
    } else if (elm === "|.0.|.|.0.|.|.0.|.|.0.|.|.|.|.0.|.0") {
      b = " فَاعِلَاتُ فَاعِلَاتُ فَعِلَاتُنْ   ";
      c = Ramal + " " + Tam;
      d = mkhb;
      e = Aila + Kaf;
    } else if (elm === "|.|.|.0.|.|.0.|.|.0.|.0.|.|.|.0.|.0") {
      b = " فَعِلَاتُ فَاعِلَاتُنْ فَعِلَاتُنْ   ";
      c = Ramal + " " + Tam;
      d = mkhb;
      e = Aila + Chakl;
    } else if (elm === "|.0.|.|.0.|.0.|.|.|.0.|.|.|.|.0.|.0") {
      b = " فَاعِلَاتُنْ فَعِلَاتُ فَعِلَاتُنْ   ";
      c = Ramal + " " + Tam;
      d = mkhb;
      e = Aila + Chakl;
    } else if (elm === "|.|.|.0.|.|.|.|.0.|.|.|.|.0.|.0") {
      b = " فَعِلَاتُ فَعِلَاتُ فَعِلَاتُنْ   ";
      c = Ramal + " " + Tam;
      d = mkhb;
      e = Aila + Chakl;
    } else if (elm === "|.|.|.0.|.|.|.|.0.|.0.|.|.|.0.|.0") {
      b = " فَعِلَاتُ فَعِلَاتُنْ فَعِلَاتُنْ   ";
      c = Ramal + " " + Tam;
      d = mkhb;
      e = Aila + Chakl + " و " + Aa;
    } else if (elm === "|.|.|.0.|.0.|.|.|.0.|.|.|.|.0.|.0") {
      b = " فَعِلَاتُنْ فَعِلَاتُ فَعِلَاتُنْ   ";
      c = Ramal + " " + Tam;
      d = mkhb;
      e = Aila + Chakl + " و " + Aa;
    } else if (elm === "|.0.|.|.0.|.|.|.|.0.|.0.|.|.|.0.|.0") {
      b = " فَاعِلَاتُ فَعِلَاتُنْ فَعِلَاتُنْ   ";
      c = Ramal + " " + Tam;
      d = mkhb;
      e = Aila + Kaf + " و " + Aa;
    } else if (elm === "|.|.|.0.|.0.|.0.|.|.0.|.|.|.|.0.|.0") {
      b = " فَعِلَاتُنْ فَاعِلَاتُ فَعِلَاتُنْ   ";
      c = Ramal + " " + Tam;
      d = mkhb;
      e = Aila + Kaf + " و " + Aa;
    } else if (elm === "|.0.|.|.0.|.|.|.|.0.|.|.|.|.0.|.0") {
      b = " فَاعِلَاتُ فَعِلَاتُ فَعِلَاتُنْ   ";
      c = Ramal + " " + Tam;
      d = mkhb;
      e = Aila + Kaf + " و " + Chakl;
    } else if (elm === "|.|.|.0.|.|.0.|.|.0.|.|.|.|.0.|.0") {
      b = " فَعِلَاتُ فَاعِلَاتُ فَعِلَاتُنْ   ";
      c = Ramal + " " + Tam;
      d = mkhb;
      e = Aila + Kaf + " و " + Chakl;
    }

    /*العروض محذوفة */
    if (elm === "|.0.|.|.0.|.0.|.0.|.|.0.|.0.|.0.|.|.0") {
      b = " فَاعِلَاتُنْ فَاعِلَاتُنْ فَاعِلُنْ   ";
      c = Ramal + " " + Tam;
      d = kt3;
    } else if (elm === "|.|.|.0.|.0.|.0.|.|.0.|.0.|.0.|.|.0") {
      b = " فَعِلَاتُنْ فَاعِلَاتُنْ فَاعِلُنْ   ";
      c = Ramal + " " + Tam;
      d = kt3;
      e = Aila + Aa;
    } else if (elm === "|.0.|.|.0.|.0.|.|.|.0.|.0.|.0.|.|.0") {
      b = " فَاعِلَاتُنْ فَعِلَاتُنْ فَاعِلُنْ   ";
      c = Ramal + " " + Tam;
      d = kt3;
      e = Aila + Aa;
    } else if (elm === "|.|.|.0.|.0.|.|.|.0.|.0.|.0.|.|.0") {
      b = " فَعِلَاتُنْ فَعِلَاتُنْ فَاعِلُنْ   ";
      c = Ramal + " " + Tam;
      d = kt3;
      e = Aila + Aa;
    } else if (elm === "|.0.|.|.0.|.|.0.|.|.0.|.0.|.0.|.|.0") {
      b = " فَاعِلَاتُ فَاعِلَاتُنْ فَاعِلُنْ   ";
      c = Ramal + " " + Tam;
      d = kt3;
      e = Aila + Kaf;
    } else if (elm === "|.0.|.|.0.|.0.|.0.|.|.0.|.|.0.|.|.0") {
      b = " فَاعِلَاتُنْ فَاعِلَاتُ فَاعِلُنْ   ";
      c = Ramal + " " + Tam;
      d = kt3;
      e = Aila + Kaf;
    } else if (elm === "|.0.|.|.0.|.|.0.|.|.0.|.|.0.|.|.0") {
      b = " فَاعِلَاتُ فَاعِلَاتُ فَاعِلُنْ   ";
      c = Ramal + " " + Tam;
      d = kt3;
      e = Aila + Kaf;
    } else if (elm === "|.|.|.0.|.|.0.|.|.0.|.0.|.0.|.|.0") {
      b = " فَعِلَاتُ فَاعِلَاتُنْ فَاعِلُنْ   ";
      c = Ramal + " " + Tam;
      d = kt3;
      e = Aila + Chakl;
    } else if (elm === "|.0.|.|.0.|.0.|.|.|.0.|.|.0.|.|.0") {
      b = " فَاعِلَاتُنْ فَعِلَاتُ فَاعِلُنْ   ";
      c = Ramal + " " + Tam;
      d = kt3;
      e = Aila + Chakl;
    } else if (elm === "|.|.|.0.|.|.|.|.0.|.|.0.|.|.0") {
      b = " فَعِلَاتُ فَعِلَاتُ فَاعِلُنْ   ";
      c = Ramal + " " + Tam;
      d = kt3;
      e = Aila + Chakl;
    } else if (elm === "|.|.|.0.|.|.|.|.0.|.0.|.0.|.|.0") {
      b = " فَعِلَاتُ فَعِلَاتُنْ فَاعِلُنْ   ";
      c = Ramal + " " + Tam;
      d = kt3;
      e = Aila + Chakl + " و " + Aa;
    } else if (elm === "|.|.|.0.|.0.|.|.|.0.|.|.0.|.|.0") {
      b = " فَعِلَاتُنْ فَعِلَاتُ فَاعِلُنْ   ";
      c = Ramal + " " + Tam;
      d = kt3;
      e = Aila + Chakl + " و " + Aa;
    } else if (elm === "|.0.|.|.0.|.|.|.|.0.|.0.|.0.|.|.0") {
      b = " فَاعِلَاتُ فَعِلَاتُنْ فَاعِلُنْ   ";
      c = Ramal + " " + Tam;
      d = kt3;
      e = Aila + Kaf + " و " + Aa;
    } else if (elm === "|.|.|.0.|.0.|.0.|.|.0.|.|.0.|.|.0") {
      b = " فَعِلَاتُنْ فَاعِلَاتُ فَاعِلُنْ   ";
      c = Ramal + " " + Tam;
      d = kt3;
      e = Aila + Kaf + " و " + Aa;
    } else if (elm === "|.0.|.|.0.|.|.|.|.0.|.|.0.|.|.0") {
      b = " فَاعِلَاتُ فَعِلَاتُ فَاعِلُنْ   ";
      c = Ramal + " " + Tam;
      d = kt3;
      e = Aila + Kaf + " و " + Chakl;
    } else if (elm === "|.|.|.0.|.|.0.|.|.0.|.|.0.|.|.0") {
      b = " فَعِلَاتُ فَاعِلَاتُ فَاعِلُنْ   ";
      c = Ramal + " " + Tam;
      d = kt3;
      e = Aila + Kaf + " و " + Chakl;
    }
    /*العروض مقصورة */
    if (elm === "|.0.|.|.0.|.0.|.0.|.|.0.|.0.|.0.|.|.0.0") {
      b = " فَاعِلَاتُنْ فَاعِلَاتُنْ فَاعِلَاتْ   ";
      c = Ramal + " " + Tam;
      d = Mksora;
    } else if (elm === "|.|.|.0.|.0.|.0.|.|.0.|.0.|.0.|.|.0.0") {
      b = " فَعِلَاتُنْ فَاعِلَاتُنْ فَاعِلَاتْ   ";
      c = Ramal + " " + Tam;
      d = Mksora;
      e = Aila + Aa;
    } else if (elm === "|.0.|.|.0.|.0.|.|.|.0.|.0.|.0.|.|.0.0") {
      b = " فَاعِلَاتُنْ فَعِلَاتُنْ فَاعِلَاتْ   ";
      c = Ramal + " " + Tam;
      d = Mksora;
      e = Aila + Aa;
    } else if (elm === "|.|.|.0.|.0.|.|.|.0.|.0.|.0.|.|.0.0") {
      b = " فَعِلَاتُنْ فَعِلَاتُنْ فَاعِلَاتْ   ";
      c = Ramal + " " + Tam;
      d = Mksora;
      e = Aila + Aa;
    } else if (elm === "|.0.|.|.0.|.|.0.|.|.0.|.0.|.0.|.|.0.0") {
      b = " فَاعِلَاتُ فَاعِلَاتُنْ فَاعِلَاتْ   ";
      c = Ramal + " " + Tam;
      d = Mksora;
      e = Aila + Kaf;
    } else if (elm === "|.0.|.|.0.|.0.|.0.|.|.0.|.|.0.|.|.0.0") {
      b = " فَاعِلَاتُنْ فَاعِلَاتُ فَاعِلَاتْ   ";
      c = Ramal + " " + Tam;
      d = Mksora;
      e = Aila + Kaf;
    } else if (elm === "|.0.|.|.0.|.|.0.|.|.0.|.|.0.|.|.0.0") {
      b = " فَاعِلَاتُ فَاعِلَاتُ فَاعِلَاتْ   ";
      c = Ramal + " " + Tam;
      d = Mksora;
      e = Aila + Kaf;
    } else if (elm === "|.|.|.0.|.|.0.|.|.0.|.0.|.0.|.|.0.0") {
      b = " فَعِلَاتُ فَاعِلَاتُنْ فَاعِلَاتْ   ";
      c = Ramal + " " + Tam;
      d = Mksora;
      e = Aila + Chakl;
    } else if (elm === "|.0.|.|.0.|.0.|.|.|.0.|.|.0.|.|.0.0") {
      b = " فَاعِلَاتُنْ فَعِلَاتُ فَاعِلَاتْ   ";
      c = Ramal + " " + Tam;
      d = Mksora;
      e = Aila + Chakl;
    } else if (elm === "|.|.|.0.|.|.|.|.0.|.|.0.|.|.0.0") {
      b = " فَعِلَاتُ فَعِلَاتُ فَاعِلَاتْ   ";
      c = Ramal + " " + Tam;
      d = Mksora;
      e = Aila + Chakl;
    } else if (elm === "|.|.|.0.|.|.|.|.0.|.0.|.0.|.|.0.0") {
      b = " فَعِلَاتُ فَعِلَاتُنْ فَاعِلَاتْ   ";
      c = Ramal + " " + Tam;
      d = Mksora;
      e = Aila + Chakl + " و " + Aa;
    } else if (elm === "|.|.|.0.|.0.|.|.|.0.|.|.0.|.|.0.0") {
      b = " فَعِلَاتُنْ فَعِلَاتُ فَاعِلَاتْ   ";
      c = Ramal + " " + Tam;
      d = Mksora;
      e = Aila + Chakl + " و " + Aa;
    } else if (elm === "|.0.|.|.0.|.|.|.|.0.|.0.|.0.|.|.0.0") {
      b = " فَاعِلَاتُ فَعِلَاتُنْ فَاعِلَاتْ   ";
      c = Ramal + " " + Tam;
      d = Mksora;
      e = Aila + Kaf + " و " + Aa;
    } else if (elm === "|.|.|.0.|.0.|.0.|.|.0.|.|.0.|.|.0.0") {
      b = " فَعِلَاتُنْ فَاعِلَاتُ فَاعِلَاتْ   ";
      c = Ramal + " " + Tam;
      d = Mksora;
      e = Aila + Kaf + " و " + Aa;
    } else if (elm === "|.0.|.|.0.|.|.|.|.0.|.|.0.|.|.0.0") {
      b = " فَاعِلَاتُ فَعِلَاتُ فَاعِلَاتْ   ";
      c = Ramal + " " + Tam;
      d = Mksora;
      e = Aila + Kaf + " و " + Chakl;
    } else if (elm === "|.|.|.0.|.|.0.|.|.0.|.|.0.|.|.0.0") {
      b = " فَعِلَاتُ فَاعِلَاتُ فَاعِلَاتْ   ";
      c = Ramal + " " + Tam;
      d = Mksora;
      e = Aila + Kaf + " و " + Chakl;
    }
    /*مجزوء  الرمل */
    /*صحيحة */
    if (elm === "|.0.|.|.0.|.0.|.0.|.|.0.|.0") {
      b = " فَاعِلَاتُنْ  فَاعِلَاتُنْ   ";
      c = Ramal + " " + Mj;
      d = kt1;
    } else if (elm === "|.|.|.0.|.0.|.0.|.|.0.|.0") {
      b = " فَعِلَاتُنْ  فَاعِلَاتُنْ   ";
      c = Ramal + " " + Mj;
      d = kt1;
      e = Aila + Aa;
    } else if (elm === "|.0.|.|.0.|.|.0.|.|.0.|.0") {
      b = " فَاعِلَاتُ  فَاعِلَاتُنْ   ";
      c = Ramal + " " + Mj;
      d = kt1;
      e = Aila + Kaf;
    } else if (elm === "|.|.|.0.|.|.0.|.|.0.|.0") {
      b = " فَعِلَاتُ  فَاعِلَاتُنْ   ";
      c = Ramal + " " + Mj;
      d = kt1;
      e = Aila + Chakl;
    }
    /*مخبونة */
    if (elm === "|.0.|.|.0.|.0.|.|.|.0.|.0") {
      b = " فَاعِلَاتُنْ  فَعِلَاتُنْ   ";
      c = Ramal + " " + Mj;
      d = mkhb;
    } else if (elm === "|.|.|.0.|.0.|.|.|.0.|.0") {
      b = " فَعِلَاتُنْ  فَعِلَاتُنْ   ";
      c = Ramal + " " + Mj;
      d = mkhb;
      e = Aila + Aa;
    } else if (elm === "|.0.|.|.0.|.|.|.|.0.|.0") {
      b = " فَاعِلَاتُ  فَعِلَاتُنْ   ";
      c = Ramal + " " + Mj;
      d = mkhb;
      e = Aila + Kaf;
    } else if (elm === "|.|.|.0.|.|.|.|.0.|.0") {
      b = " فَعِلَاتُ  فَعِلَاتُنْ   ";
      c = Ramal + " " + Mj;
      d = mkhb;
      e = Aila + Chakl;
    }
    /*محذوفة */
    if (elm === "|.0.|.|.0.|.0.|.0.|.|.0") {
      b = " فَاعِلَاتُنْ  فَاعِلُنْ   ";
      c = Ramal + " " + Mj;
      d = kt3;
    } else if (elm === "|.|.|.0.|.0.|.0.|.|.0") {
      b = " فَعِلَاتُنْ  فَاعِلُنْ   ";
      c = Ramal + " " + Mj;
      d = kt3;
      e = Aila + Aa;
    } else if (elm === "|.0.|.|.0.|.|.0.|.|.0") {
      b = " فَاعِلَاتُ  فَاعِلُنْ   ";
      c = Ramal + " " + Mj;
      d = kt3;
      e = Aila + Kaf;
    } else if (elm === "|.|.|.0.|.|.0.|.|.0") {
      b = " فَعِلَاتُ  فَاعِلُنْ   ";
      c = Ramal + " " + Mj;
      d = kt3;
      e = Aila + Chakl;
    }
    /*مسبغ */
    if (elm === "|.0.|.|.0.|.0.|.0.|.|.0.|.0.0") {
      b = " فَاعِلَاتُنْ  فَاعِلَاتَانْ   ";
      c = Ramal + " " + Mj;
      d = Mosbak;
    } else if (elm === "|.|.|.0.|.0.|.0.|.|.0.|.0.0") {
      b = " فَعِلَاتُنْ  فَاعِلَاتَانْ   ";
      c = Ramal + " " + Mj;
      d = Mosbak;
      e = Aila + Aa;
    } else if (elm === "|.0.|.|.0.|.|.0.|.|.0.|.0.0") {
      b = " فَاعِلَاتُ  فَاعِلَاتَانْ   ";
      c = Ramal + " " + Mj;
      d = Mosbak;
      e = Aila + Kaf;
    } else if (elm === "|.|.|.0.|.|.0.|.|.0.|.0.0") {
      b = " فَعِلَاتُ  فَاعِلَاتَانْ   ";
      c = Ramal + " " + Mj;
      d = Mosbak;
      e = Aila + Chakl;
    }
    /*السريع ------------------------------------------------------------------ */
    /*مطوية مكسوفة */
    if (elm === "|.0.|.0.|.|.0.|.0.|.0.|.|.0.|.0.|.|.0") {
      b = " مُسْتَفْعِلُنْ مُسْتَفْعِلُنْ فَاعِلُنْ   ";
      c = Sariaa + " " + Tam;
      d = MtMk;
    } else if (elm === "|.|.0.|.|.0.|.0.|.0.|.|.0.|.0.|.|.0") {
      b = " مُتَفْعِلُنْ مُسْتَفْعِلُنْ فَاعِلُنْ   ";
      c = Sariaa;
      d = MtMk;
      e = Aila + Aa;
    } else if (elm === "|.0.|.0.|.|.0.|.|.0.|.|.0.|.0.|.|.0") {
      b = " مُسْتَفْعِلُنْ مُتَفْعِلُنْ فَاعِلُنْ   ";
      c = Sariaa;
      d = MtMk;
      e = Aila + Aa;
    } else if (elm === "|.|.0.|.|.0.|.|.0.|.|.0.|.0.|.|.0") {
      b = " مُتَفْعِلُنْ مُتَفْعِلُنْ فَاعِلُنْ   ";
      c = Sariaa;
      d = MtMk;
      e = Aila + Aa;
    } else if (elm === "|.0.|.|.|.0.|.0.|.0.|.|.0.|.0.|.|.0") {
      b = " مُسْتَعِلُنْ مُسْتَفْعِلُنْ فَاعِلُنْ   ";
      c = Sariaa;
      d = MtMk;
      e = Aila + Ab;
    } else if (elm === "|.0.|.0.|.|.0.|.0.|.|.|.0.|.0.|.|.0") {
      b = " مُسْتَفْعِلُنْ مُسْتَعِلُنْ فَاعِلُنْ   ";
      c = Sariaa;
      d = MtMk;
      e = Aila + Ab;
    } else if (elm === "|.0.|.|.|.0.|.0.|.|.|.0.|.0.|.|.0") {
      b = " مُسْتَعِلُنْ مُسْتَعِلُنْ فَاعِلُنْ   ";
      c = Sariaa;
      d = MtMk;
      e = Aila + Ab;
    } else if (elm === "|.|.|.|.0.|.0.|.0.|.|.0.|.0.|.|.0") {
      b = " مُتَعِلُنْ مُسْتَفْعِلُنْ فَاعِلُنْ   ";
      c = Sariaa;
      d = MtMk;
      e = Aila + Ac;
    } else if (elm === "|.0.|.0.|.|.0.|.|.|.|.0.|.0.|.|.0") {
      b = " مُسْتَفْعِلُنْ مُتَعِلُنْ فَاعِلُنْ   ";
      c = Sariaa;
      d = MtMk;
      e = Aila + Ac;
    } else if (elm === "|.|.|.|.0.|.|.|.|.0.|.0.|.|.0") {
      b = " مُتَعِلُنْ مُتَعِلُنْ فَاعِلُنْ   ";
      c = Sariaa;
      d = MtMk;
      e = Aila + Ac;
    } else if (elm === "|.|.0.|.|.0.|.|.|.|.0.|.0.|.|.0") {
      b = " مُتَفْعِلُنْ مُتَعِلُنْ فَاعِلُنْ   ";
      c = Sariaa;
      d = MtMk;
      e = Aila + Ac + " و " + Aa;
    } else if (elm === "|.|.|.|.0.|.|.0.|.|.0.|.0.|.|.0") {
      b = " مُتَعِلُنْ مُتَفْعِلُنْ فَاعِلُنْ   ";
      c = Sariaa;
      d = MtMk;
      e = Aila + Ac + " و " + Aa;
    } else if (elm === "|.0.|.|.|.0.|.|.|.|.0.|.0.|.|.0") {
      b = " مُسْتَعِلُنْ مُتَعِلُنْ فَاعِلُنْ   ";
      c = Sariaa;
      d = MtMk;
      e = Aila + Ac + " و " + Ab;
    } else if (elm === "|.|.|.|.0.|.0.|.|.|.0.|.0.|.|.0") {
      b = " مُتَعِلُنْ مُسْتَعِلُنْ فَاعِلُنْ   ";
      c = Sariaa;
      d = MtMk;
      e = Aila + Aa + " و " + Ab;
    } else if (elm === "|.0.|.|.|.0.|.|.0.|.|.0.|.0.|.|.0") {
      b = " مُسْتَعِلُنْ مُتَفْعِلُنْ فَاعِلُنْ   ";
      c = Sariaa;
      d = MtMk;
      e = Aila + Aa + " و " + Ab;
    } else if (elm === "|.|.0.|.|.0.|.0.|.|.|.0.|.0.|.|.0") {
      b = " مُتَفْعِلُنْ مُسْتَعِلُنْ فَاعِلُنْ   ";
      c = Sariaa;
      d = MtMk;
      e = Aila + Aa + " و " + Ab;
    }

    /*أصلم */
    if (elm === "|.0.|.0.|.|.0.|.0.|.0.|.|.0.|.0.|.0") {
      b = " مُسْتَفْعِلُنْ مُسْتَفْعِلُنْ مَفْعُو   ";
      c = Sariaa;
      d = Aslam;
    } else if (elm === "|.|.0.|.|.0.|.0.|.0.|.|.0.|.0.|.0") {
      b = " مُتَفْعِلُنْ مُسْتَفْعِلُنْ مَفْعُو   ";
      c = Sariaa;
      d = Aslam;
      e = Aila + Aa;
    } else if (elm === "|.0.|.0.|.|.0.|.|.0.|.|.0.|.0.|.0") {
      b = " مُسْتَفْعِلُنْ مُتَفْعِلُنْ مَفْعُو   ";
      c = Sariaa;
      d = Aslam;
      e = Aila + Aa;
    } else if (elm === "|.|.0.|.|.0.|.|.0.|.|.0.|.0.|.0") {
      b = " مُتَفْعِلُنْ مُتَفْعِلُنْ مَفْعُو   ";
      c = Sariaa;
      d = Aslam;
      e = Aila + Aa;
    } else if (elm === "|.0.|.|.|.0.|.0.|.0.|.|.0.|.0.|.0") {
      b = " مُسْتَعِلُنْ مُسْتَفْعِلُنْ مَفْعُو   ";
      c = Sariaa;
      d = Aslam;
      e = Aila + Ab;
    } else if (elm === "|.0.|.0.|.|.0.|.0.|.|.|.0.|.0.|.0") {
      b = " مُسْتَفْعِلُنْ مُسْتَعِلُنْ مَفْعُو   ";
      c = Sariaa;
      d = Aslam;
      e = Aila + Ab;
    } else if (elm === "|.0.|.|.|.0.|.0.|.|.|.0.|.0.|.0") {
      b = " مُسْتَعِلُنْ مُسْتَعِلُنْ مَفْعُو   ";
      c = Sariaa;
      d = Aslam;
      e = Aila + Ab;
    } else if (elm === "|.|.|.|.0.|.0.|.0.|.|.0.|.0.|.0") {
      b = " مُتَعِلُنْ مُسْتَفْعِلُنْ مَفْعُو   ";
      c = Sariaa;
      d = Aslam;
      e = Aila + Ac;
    } else if (elm === "|.0.|.0.|.|.0.|.|.|.|.0.|.0.|.0") {
      b = " مُسْتَفْعِلُنْ مُتَعِلُنْ مَفْعُو   ";
      c = Sariaa;
      d = Aslam;
      e = Aila + Ac;
    } else if (elm === "|.|.|.|.0.|.|.|.|.0.|.0.|.0") {
      b = " مُتَعِلُنْ مُتَعِلُنْ مَفْعُو   ";
      c = Sariaa;
      d = Aslam;
      e = Aila + Ac;
    } else if (elm === "|.|.0.|.|.0.|.|.|.|.0.|.0.|.0") {
      b = " مُتَفْعِلُنْ مُتَعِلُنْ مَفْعُو   ";
      c = Sariaa;
      d = Aslam;
      e = Aila + Ac + " و " + Aa;
    } else if (elm === "|.|.|.|.0.|.|.0.|.|.0.|.0.|.0") {
      b = " مُتَعِلُنْ مُتَفْعِلُنْ مَفْعُو   ";
      c = Sariaa;
      d = Aslam;
      e = Aila + Ac + " و " + Aa;
    } else if (elm === "|.0.|.|.|.0.|.|.|.|.0.|.0.|.0") {
      b = " مُسْتَعِلُنْ مُتَعِلُنْ مَفْعُو   ";
      c = Sariaa;
      d = Aslam;
      e = Aila + Ac + " و " + Ab;
    } else if (elm === "|.|.|.|.0.|.0.|.|.|.0.|.0.|.0") {
      b = " مُتَعِلُنْ مُسْتَعِلُنْ مَفْعُو   ";
      c = Sariaa;
      d = Aslam;
      e = Aila + Aa + " و " + Ab;
    } else if (elm === "|.0.|.|.|.0.|.|.0.|.|.0.|.0.|.0") {
      b = " مُسْتَعِلُنْ مُتَفْعِلُنْ مَفْعُو   ";
      c = Sariaa;
      d = Aslam;
      e = Aila + Aa + " و " + Ab;
    } else if (elm === "|.|.0.|.|.0.|.0.|.|.|.0.|.0.|.0") {
      b = " مُتَفْعِلُنْ مُسْتَعِلُنْ مَفْعُو   ";
      c = Sariaa;
      d = Aslam;
      e = Aila + Aa + " و " + Ab;
    }

    /*مطوي موقوف */
    if (elm === "|.0.|.0.|.|.0.|.0.|.0.|.|.0.|.0.|.|.0.0") {
      b = "مُسْتَفْعِلُنْ مُسْتَفْعِلُنْ مَفْعُلَاتْ   ";
      c = Sariaa;
      d = MtMwkof;
    } else if (elm === "|.|.0.|.|.0.|.0.|.0.|.|.0.|.0.|.|.0.0") {
      b = " مُتَفْعِلُنْ مُسْتَفْعِلُنْ مَفْعُلَاتْ   ";
      c = Sariaa;
      d = MtMwkof;
      e = Aila + Aa;
    } else if (elm === "|.0.|.0.|.|.0.|.|.0.|.|.0.|.0.|.|.0.0") {
      b = " مُسْتَفْعِلُنْ مُتَفْعِلُنْ مَفْعُلَاتْ   ";
      c = Sariaa;
      d = MtMwkof;
      e = Aila + Aa;
    } else if (elm === "|.|.0.|.|.0.|.|.0.|.|.0.|.0.|.|.0.0") {
      b = " مُتَفْعِلُنْ مُتَفْعِلُنْ مَفْعُلَاتْ   ";
      c = Sariaa;
      d = MtMwkof;
      e = Aila + Aa;
    } else if (elm === "|.0.|.|.|.0.|.0.|.0.|.|.0.|.0.|.|.0.0") {
      b = " مُسْتَعِلُنْ مُسْتَفْعِلُنْ مَفْعُلَاتْ   ";
      c = Sariaa;
      d = MtMwkof;
      e = Aila + Ab;
    } else if (elm === "|.0.|.0.|.|.0.|.0.|.|.|.0.|.0.|.|.0.0") {
      b = " مُسْتَفْعِلُنْ مُسْتَعِلُنْ مَفْعُلَاتْ   ";
      c = Sariaa;
      d = MtMwkof;
      e = Aila + Ab;
    } else if (elm === "|.0.|.|.|.0.|.0.|.|.|.0.|.0.|.|.0.0") {
      b = " مُسْتَعِلُنْ مُسْتَعِلُنْ مَفْعُلَاتْ   ";
      c = Sariaa;
      d = MtMwkof;
      e = Aila + Ab;
    } else if (elm === "|.|.|.|.0.|.0.|.0.|.|.0.|.0.|.|.0.0") {
      b = " مُتَعِلُنْ مُسْتَفْعِلُنْ مَفْعُلَاتْ   ";
      c = Sariaa;
      d = MtMwkof;
      e = Aila + Ac;
    } else if (elm === "|.0.|.0.|.|.0.|.|.|.|.0.|.0.|.|.0.0") {
      b = " مُسْتَفْعِلُنْ مُتَعِلُنْ مَفْعُلَاتْ   ";
      c = Sariaa;
      d = MtMwkof;
      e = Aila + Ac;
    } else if (elm === "|.|.|.|.0.|.|.|.|.0.|.0.|.|.0.0") {
      b = " مُتَعِلُنْ مُتَعِلُنْ مَفْعُلَاتْ   ";
      c = Sariaa;
      d = MtMwkof;
      e = Aila + Ac;
    } else if (elm === "|.|.0.|.|.0.|.|.|.|.0.|.0.|.|.0.0") {
      b = " مُتَفْعِلُنْ مُتَعِلُنْ مَفْعُلَاتْ   ";
      c = Sariaa;
      d = MtMwkof;
      e = Aila + Ac + " و " + Aa;
    } else if (elm === "|.|.|.|.0.|.|.0.|.|.0.|.0.|.|.0.0") {
      b = " مُتَعِلُنْ مُتَفْعِلُنْ مَفْعُلَاتْ   ";
      c = Sariaa;
      d = MtMwkof;
      e = Aila + Ac + " و " + Aa;
    } else if (elm === "|.0.|.|.|.0.|.|.|.|.0.|.0.|.|.0.0") {
      b = " مُسْتَعِلُنْ مُتَعِلُنْ مَفْعُلَاتْ   ";
      c = Sariaa;
      d = MtMwkof;
      e = Aila + Ac + " و " + Ab;
    } else if (elm === "|.|.|.|.0.|.0.|.|.|.0.|.0.|.|.0.0") {
      b = " مُتَعِلُنْ مُسْتَعِلُنْ مَفْعُلَاتْ   ";
      c = Sariaa;
      d = MtMwkof;
      e = Aila + Aa + " و " + Ab;
    } else if (elm === "|.0.|.|.|.0.|.|.0.|.|.0.|.0.|.|.0.0") {
      b = " مُسْتَعِلُنْ مُتَفْعِلُنْ مَفْعُلَاتْ   ";
      c = Sariaa;
      d = MtMwkof;
      e = Aila + Aa + " و " + Ab;
    } else if (elm === "|.|.0.|.|.0.|.0.|.|.|.0.|.0.|.|.0.0") {
      b = " مُتَفْعِلُنْ مُسْتَعِلُنْ مَفْعُلَاتْ   ";
      c = Sariaa;
      d = MtMwkof;
      e = Aila + Aa + " و " + Ab;
    }

    /*مخبولة مكسوفة */
    if (elm === "|.0.|.0.|.|.0.|.0.|.0.|.|.0.|.|.|.0") {
      b = "مُسْتَفْعِلُنْ مُسْتَفْعِلُنْ فَعَلُنْ   ";
      c = Sariaa;
      d = MkhMksofa;
    } else if (elm === "|.|.0.|.|.0.|.0.|.0.|.|.0.|.|.|.0") {
      b = " مُتَفْعِلُنْ مُسْتَفْعِلُنْ فَعَلُنْ   ";
      c = Sariaa;
      d = MkhMksofa;
      e = Aila + Aa;
    } else if (elm === "|.0.|.0.|.|.0.|.|.0.|.|.0.|.|.|.0") {
      b = " مُسْتَفْعِلُنْ مُتَفْعِلُنْ فَعَلُنْ   ";
      c = Sariaa;
      d = MkhMksofa;
      e = Aila + Aa;
    } else if (elm === "|.|.0.|.|.0.|.|.0.|.|.0.|.|.|.0") {
      b = " مُتَفْعِلُنْ مُتَفْعِلُنْ فَعَلُنْ   ";
      c = Sariaa;
      d = MkhMksofa;
      e = Aila + Aa;
    } else if (elm === "|.0.|.|.|.0.|.0.|.0.|.|.0.|.|.|.0") {
      b = " مُسْتَعِلُنْ مُسْتَفْعِلُنْ فَعَلُنْ   ";
      c = Sariaa;
      d = MkhMksofa;
      e = Aila + Ab;
    } else if (elm === "|.0.|.0.|.|.0.|.0.|.|.|.0.|.|.|.0") {
      b = " مُسْتَفْعِلُنْ مُسْتَعِلُنْ فَعَلُنْ   ";
      c = Sariaa;
      d = MkhMksofa;
      e = Aila + Ab;
    } else if (elm === "|.0.|.|.|.0.|.0.|.|.|.0.|.|.|.0") {
      b = " مُسْتَعِلُنْ مُسْتَعِلُنْ فَعَلُنْ   ";
      c = Sariaa;
      d = MkhMksofa;
      e = Aila + Ab;
    } else if (elm === "|.|.|.|.0.|.0.|.0.|.|.0.|.|.|.0") {
      b = " مُتَعِلُنْ مُسْتَفْعِلُنْ فَعَلُنْ   ";
      c = Sariaa;
      d = MkhMksofa;
      e = Aila + Ac;
    } else if (elm === "|.0.|.0.|.|.0.|.|.|.|.0.|.|.|.0") {
      b = " مُسْتَفْعِلُنْ مُتَعِلُنْ فَعَلُنْ   ";
      c = Sariaa;
      d = MkhMksofa;
      e = Aila + Ac;
    } else if (elm === "|.|.|.|.0.|.|.|.|.0.|.|.|.0") {
      b = " مُتَعِلُنْ مُتَعِلُنْ فَعَلُنْ   ";
      c = Sariaa;
      d = MkhMksofa;
      e = Aila + Ac;
    } else if (elm === "|.|.0.|.|.0.|.|.|.|.0.|.|.|.0") {
      b = " مُتَفْعِلُنْ مُتَعِلُنْ فَعَلُنْ   ";
      c = Sariaa;
      d = MkhMksofa;
      e = Aila + Ac + " و " + Aa;
    } else if (elm === "|.|.|.|.0.|.|.0.|.|.0.|.|.|.0") {
      b = " مُتَعِلُنْ مُتَفْعِلُنْ فَعَلُنْ   ";
      c = Sariaa;
      d = MkhMksofa;
      e = Aila + Ac + " و " + Aa;
    } else if (elm === "|.0.|.|.|.0.|.|.|.|.0.|.|.|.0") {
      b = " مُسْتَعِلُنْ مُتَعِلُنْ فَعَلُنْ   ";
      c = Sariaa;
      d = MkhMksofa;
      e = Aila + Ac + " و " + Ab;
    } else if (elm === "|.|.|.|.0.|.0.|.|.|.0.|.|.|.0") {
      b = " مُتَعِلُنْ مُسْتَعِلُنْ فَعَلُنْ   ";
      c = Sariaa;
      d = MkhMksofa;
      e = Aila + Aa + " و " + Ab;
    } else if (elm === "|.0.|.|.|.0.|.|.0.|.|.0.|.|.|.0") {
      b = " مُسْتَعِلُنْ مُتَفْعِلُنْ فَعَلُنْ   ";
      c = Sariaa;
      d = MkhMksofa;
      e = Aila + Aa + " و " + Ab;
    } else if (elm === "|.|.0.|.|.0.|.0.|.|.|.0.|.|.|.0") {
      b = " مُتَفْعِلُنْ مُسْتَعِلُنْ فَعَلُنْ   ";
      c = Sariaa;
      d = MkhMksofa;
      e = Aila + Aa + " و " + Ab;
    }

    /*المنسرح ----------------------------------------------------------------- */
    /*مطوية */
    if (elm === "|.0.|.0.|.|.0.|.0.|.0.|.0.|.|.0.|.|.|.0") {
      b = " مُسْتَفْعِلُنْ مَفْعُولَاتُ مُسْتَعِلُنْ    ";
      c = Monsaih + " " + Tam;
      d = MatW;
    } else if (elm === "|.|.0.|.|.0.|.0.|.0.|.0.|.|.0.|.|.|.0") {
      b = " مُتَفْعِلُنْ مَفْعُولَاتُ مُسْتَعِلُنْ    ";
      c = Monsaih + " " + Tam;
      d = MatW;
      e = Aila + Aa;
    } else if (elm === "|.|.0.|.|.0.|.0.|.|.0.|.|.0.|.|.|.0") {
      b = " مُتَفْعِلُنْ مَفْعُلَاتُ مُسْتَعِلُنْ    ";
      c = Monsaih + " " + Tam;
      d = MatW;
      e = Aila + Aa + " و " + Ab;
    } else if (elm === "|.|.0.|.|.0.|.|.|.0.|.|.0.|.|.|.0") {
      b = " مُتَفْعِلُنْ فَعُلَاتُ مُسْتَعِلُنْ    ";
      c = Monsaih + " " + Tam;
      d = MatW;
      e = Aila + Aa + " و " + Ac;
    } else if (elm === "|.0.|.|.|.0.|.0.|.0.|.0.|.|.0.|.|.|.0") {
      b = " مُسْتَعِلُنْ مَفْعُولَاتُ مُسْتَعِلُنْ    ";
      c = Monsaih + " " + Tam;
      d = MatW;
      e = Aila + Ab;
    } else if (elm === "|.0.|.|.|.0.|.0.|.|.0.|.|.0.|.|.|.0") {
      b = " مُسْتَعِلُنْ مَفْعُلَاتُ مُسْتَعِلُنْ    ";
      c = Monsaih + " " + Tam;
      d = MatW;
      e = Aila + Ab;
    } else if (elm === "|.0.|.0.|.|.0.|.0.|.|.0.|.|.0.|.|.|.0") {
      b = " مُسْتَفْعِلُنْ مَفْعُلَاتُ مُسْتَعِلُنْ    ";
      c = Monsaih + " " + Tam;
      d = MatW;
      e = Aila + Ab;
    } else if (elm === "|.0.|.|.|.0.|.|.|.0.|.|.0.|.|.|.0") {
      b = " مُسْتَعِلُنْ فَعُلَاتُ مُسْتَعِلُنْ    ";
      c = Monsaih + " " + Tam;
      d = MatW;
      e = Aila + Ab + " و " + Ac;
    } else if (elm === "|.|.|.|.0.|.0.|.|.0.|.|.0.|.|.|.0") {
      b = " مُتَعِلُنْ مَفْعُلَاتُ مُسْتَعِلُنْ    ";
      c = Monsaih + " " + Tam;
      d = MatW;
      e = Aila + Ab + " و " + Ac;
    } else if (elm === "|.0.|.0.|.|.0.|.|.|.0.|.|.0.|.|.|.0") {
      b = " مُسْتَفْعِلُنْ فَعُلَاتُ مُسْتَعِلُنْ    ";
      c = Monsaih + " " + Tam;
      d = MatW;
      e = Aila + Ab;
    } else if (elm === "|.|.|.|.0.|.0.|.0.|.0.|.|.0.|.|.|.0") {
      b = " مُتَعِلُنْ مَفْعُولَاتُ مُسْتَعِلُنْ    ";
      c = Monsaih + " " + Tam;
      d = MatW;
      e = Aila + Ab;
    } else if (elm === "|.|.|.|.0.|.|.|.0.|.|.0.|.|.|.0") {
      b = " مُتَعِلُنْ فَعُلَاتُ مُسْتَعِلُنْ    ";
      c = Monsaih + " " + Tam;
      d = MatW;
      e = Aila + Ab;
    }

    /*مقطوع */
    if (elm === "|.0.|.0.|.|.0.|.0.|.0.|.0.|.|.0.|.0.|.0") {
      b = " مُسْتَفْعِلُنْ مَفْعُولَاتُ مُسْتَفْعِلْ    ";
      c = Monsaih + " " + Tam;
      d = mkta;
    } else if (elm === "|.|.0.|.|.0.|.0.|.0.|.0.|.|.0.|.0.|.0") {
      b = " مُتَفْعِلُنْ مَفْعُولَاتُ مُسْتَفْعِلْ    ";
      c = Monsaih + " " + Tam;
      d = mkta;
      e = Aila + Aa;
    } else if (elm === "|.|.0.|.|.0.|.0.|.|.0.|.|.0.|.0.|.0") {
      b = " مُتَفْعِلُنْ مَفْعُلَاتُ مُسْتَفْعِلْ    ";
      c = Monsaih + " " + Tam;
      d = mkta;
      e = Aila + Aa + " و " + Ab;
    } else if (elm === "|.|.0.|.|.0.|.|.|.0.|.|.0.|.0.|.0") {
      b = " مُتَفْعِلُنْ فَعُلَاتُ مُسْتَفْعِلْ    ";
      c = Monsaih + " " + Tam;
      d = mkta;
      e = Aila + Aa + " و " + Ac;
    } else if (elm === "|.0.|.|.|.0.|.0.|.0.|.0.|.|.0.|.0.|.0") {
      b = " مُسْتَعِلُنْ مَفْعُولَاتُ مُسْتَفْعِلْ    ";
      c = Monsaih + " " + Tam;
      d = mkta;
      e = Aila + Ab;
    } else if (elm === "|.0.|.|.|.0.|.0.|.|.0.|.|.0.|.0.|.0") {
      b = " مُسْتَعِلُنْ مَفْعُلَاتُ مُسْتَفْعِلْ    ";
      c = Monsaih + " " + Tam;
      d = mkta;
      e = Aila + Ab;
    } else if (elm === "|.0.|.0.|.|.0.|.0.|.|.0.|.|.0.|.0.|.0") {
      b = " مُسْتَفْعِلُنْ مَفْعُلَاتُ مُسْتَفْعِلْ    ";
      c = Monsaih + " " + Tam;
      d = mkta;
      e = Aila + Ab;
    } else if (elm === "|.0.|.|.|.0.|.|.|.0.|.|.0.|.0.|.0") {
      b = " مُسْتَعِلُنْ فَعُلَاتُ مُسْتَفْعِلْ    ";
      c = Monsaih + " " + Tam;
      d = mkta;
      e = Aila + Ab + " و " + Ac;
    } else if (elm === "|.|.|.|.0.|.0.|.|.0.|.|.0.|.0.|.0") {
      b = " مُتَعِلُنْ مَفْعُلَاتُ مُسْتَفْعِلْ    ";
      c = Monsaih + " " + Tam;
      d = mkta;
      e = Aila + Ab + " و " + Ac;
    } else if (elm === "|.0.|.0.|.|.0.|.|.|.0.|.|.0.|.0.|.0") {
      b = " مُسْتَفْعِلُنْ فَعُلَاتُ مُسْتَفْعِلْ    ";
      c = Monsaih + " " + Tam;
      d = mkta;
      e = Aila + Ac;
    } else if (elm === "|.|.|.|.0.|.0.|.0.|.0.|.|.0.|.0.|.0") {
      b = " مُتَعِلُنْ مَفْعُولَاتُ مُسْتَفْعِلْ    ";
      c = Monsaih + " " + Tam;
      d = mkta;
      e = Aila + Ac;
    } else if (elm === "|.|.|.|.0.|.|.|.0.|.|.0.|.0.|.0") {
      b = " مُتَعِلُنْ فَعُلَاتُ مُسْتَفْعِلْ    ";
      c = Monsaih + " " + Tam;
      d = mkta;
      e = Aila + Ac;
    }

    /*منهوك المنسرح */
    /*موقوفة */
    if (elm === "|.0.|.0.|.|.0.|.0.|.0.|.0.0") {
      b = "مُسْتَفْعِلُنْ مَفْعُولَاتْ  ";
      c = Monsaih + " " + ManHo;
      d = Mwkofa;
    } else if (elm === "|.|.|.|.0.|.0.|.0.|.0.0") {
      b = "مُتَعِلُنْ مَفْعُولَاتْ  ";
      c = Monsaih + " " + ManHo;
      d = Mwkofa;
      e = Aila + Ac;
    } else if (elm === "|.0.|.|.|.0.|.0.|.0.|.0.0") {
      b = "مُسْتَعِلُنْ مَفْعُولَاتْ  ";
      c = Monsaih + " " + ManHo;
      d = Mwkofa;
      e = Aila + Ab;
    } else if (elm === "|.|.0.|.|.0.|.0.|.0.|.0.0") {
      b = "مُتَفْعِلُنْ مَفْعُولَاتْ  ";
      c = Monsaih + " " + ManHo;
      d = Mwkofa;
      e = Aila + Aa;
    }
    /*مكسوفة */
    if (elm === "|.0.|.0.|.|.0.|.0.|.0.|.0") {
      b = "مُسْتَفْعِلُنْ مَفْعُولُنْ  ";
      c = Monsaih + " " + ManHo;
      d = Mksofa;
    } else if (elm === "|.|.|.|.0.|.0.|.0.|.0") {
      b = "مُتَعِلُنْ مَفْعُولُنْ  ";
      c = Monsaih + " " + ManHo;
      d = Mksofa;
      e = Aila + Ac;
    } else if (elm === "|.0.|.|.|.0.|.0.|.0.|.0") {
      b = "مُسْتَعِلُنْ مَفْعُولُنْ  ";
      c = Monsaih + " " + ManHo;
      d = Mksofa;
      e = Aila + Ab;
    } else if (elm === "|.|.0.|.|.0.|.0.|.0.|.0") {
      b = "مُتَفْعِلُنْ مَفْعُولُنْ  ";
      c = Monsaih + " " + ManHo;
      d = Mksofa;
      e = Aila + Aa;
    }
    /* الخفيف تام ----------------------------------------------------*/
    /*صحيحة*/
    if (elm === "|.0.|.|.0.|.0.|.0.|.0.|.|.0.|.0.|.|.0.|.0") {
      b = " فَاعِلَاتُنْ مُسْتَفْعِ لُنْ فَاعِلَاتُنْ   ";
      c = Khafif + " " + Tam;
      d = kt1;
    } else if (elm === "|.|.|.0.|.0.|.0.|.0.|.|.0.|.0.|.|.0.|.0") {
      b = " فَعِلَاتُنْ مُسْتَفْعِ لُنْ فَاعِلَاتُنْ   ";
      c = Khafif + " " + Tam;
      d = kt1;
      e = Aila + Aa;
    } else if (elm === "|.0.|.|.0.|.0.|.|.0.|.|.0.|.0.|.|.0.|.0") {
      b = " فَاعِلَاتُنْ مُتَفْعِ لُنْ فَاعِلَاتُنْ   ";
      c = Khafif + " " + Tam;
      d = kt1;
      e = Aila + Aa;
    } else if (elm === "|.|.|.0.|.0.|.|.0.|.|.0.|.0.|.|.0.|.0") {
      b = " فَعِلَاتُنْ مُتَفْعِ لُنْ فَاعِلَاتُنْ   ";
      c = Khafif + " " + Tam;
      d = kt1;
      e = Aila + Aa;
    } else if (elm === "|.0.|.0.|.0.|.|.0.|.|.0.|.0.|.|.0.|.0") {
      b = " فَالَاتُنْ مُتَفْعِ لُنْ فَاعِلَاتُنْ   ";
      c = Khafif + " " + Tam;
      d = kt1;
      e = Aila + Aa + " و " + Tachaite;
    } else if (elm === "|.0.|.0.|.0.|.0.|.0.|.|.0.|.0.|.|.0.|.0") {
      b = " فَالَاتُنْ مُسْتَفْعِ لُنْ فَاعِلَاتُنْ   ";
      c = Khafif + " " + Tam;
      d = kt1;
      e = Aila + Tachaite;
    } else if (elm === "|.0.|.|.0.|.|.|.0.|.|.0.|.0.|.|.0.|.0") {
      b = " فَاعِلَاتُ مُتَفْعِ لُنْ فَاعِلَاتُنْ   ";
      c = Khafif + " " + Tam;
      d = kt1;
      e = Aila + Aa + " و " + Kaf;
    } else if (elm === "|.0.|.|.0.|.|.0.|.0.|.|.0.|.0.|.|.0.|.0") {
      b = " فَاعِلَاتُ مُسْتَفْعِ لُنْ فَاعِلَاتُنْ   ";
      c = Khafif + " " + Tam;
      d = kt1;
      e = Aila + Kaf;
    }

    /*متشعثة */
    if (elm === "|.0.|.|.0.|.0.|.0.|.0.|.|.0.|.0.|.0.|.0") {
      b = " فَاعِلَاتُنْ مُسْتَفْعِ لُنْ فَالَاتُنْ   ";
      c = Khafif + " " + Tam;
      d = MTachaite;
    } else if (elm === "|.|.|.0.|.0.|.0.|.0.|.|.0.|.0.|.0.|.0") {
      b = " فَعِلَاتُنْ مُسْتَفْعِ لُنْ فَالَاتُنْ   ";
      c = Khafif + " " + Tam;
      d = MTachaite;
      e = Aila + Aa;
    } else if (elm === "|.0.|.|.0.|.0.|.|.0.|.|.0.|.0.|.0.|.0") {
      b = " فَاعِلَاتُنْ مُتَفْعِ لُنْ فَالَاتُنْ   ";
      c = Khafif + " " + Tam;
      d = MTachaite;
      e = Aila + Aa;
    } else if (elm === "|.|.|.0.|.0.|.|.0.|.|.0.|.0.|.0.|.0") {
      b = " فَعِلَاتُنْ مُتَفْعِ لُنْ فَالَاتُنْ   ";
      c = Khafif + " " + Tam;
      d = MTachaite;
      e = Aila + Aa;
    } else if (elm === "|.0.|.0.|.0.|.|.0.|.|.0.|.0.|.0.|.0") {
      b = " فَالَاتُنْ مُتَفْعِ لُنْ فَالَاتُنْ   ";
      c = Khafif + " " + Tam;
      d = MTachaite;
      e = Aila + Aa + " و " + Tachaite;
    } else if (elm === "|.0.|.0.|.0.|.0.|.0.|.|.0.|.0.|.0.|.0") {
      b = " فَالَاتُنْ مُسْتَفْعِ لُنْ فَالَاتُنْ   ";
      c = Khafif + " " + Tam;
      d = MTachaite;
      e = Aila + Tachaite;
    } else if (elm === "|.0.|.|.0.|.|.|.0.|.|.0.|.0.|.0.|.0") {
      b = " فَاعِلَاتُ مُتَفْعِ لُنْ فَالَاتُنْ   ";
      c = Khafif + " " + Tam;
      d = MTachaite;
      e = Aila + Aa + " و " + Kaf;
    } else if (elm === "|.0.|.|.0.|.|.0.|.0.|.|.0.|.0.|.0.|.0") {
      b = " فَاعِلَاتُ مُسْتَفْعِ لُنْ فَالَاتُنْ   ";
      c = Khafif + " " + Tam;
      d = MTachaite;
      e = Aila + Kaf;
    }

    /*مخبونة */
    if (elm === "|.0.|.|.0.|.0.|.0.|.0.|.|.0.|.|.|.0.|.0") {
      b = " فَاعِلَاتُنْ مُسْتَفْعِ لُنْ فَعِلَاتُنْ   ";
      c = Khafif + " " + Tam;
      d = mkhb;
    } else if (elm === "|.|.|.0.|.0.|.0.|.0.|.|.0.|.|.|.0.|.0") {
      b = " فَعِلَاتُنْ مُسْتَفْعِ لُنْ فَعِلَاتُنْ   ";
      c = Khafif + " " + Tam;
      d = mkhb;
      e = Aila + Aa;
    } else if (elm === "|.0.|.|.0.|.0.|.|.0.|.|.0.|.|.|.0.|.0") {
      b = " فَاعِلَاتُنْ مُتَفْعِ لُنْ فَعِلَاتُنْ   ";
      c = Khafif + " " + Tam;
      d = mkhb;
      e = Aila + Aa;
    } else if (elm === "|.|.|.0.|.0.|.|.0.|.|.0.|.|.|.0.|.0") {
      b = " فَعِلَاتُنْ مُتَفْعِ لُنْ فَعِلَاتُنْ   ";
      c = Khafif + " " + Tam;
      d = mkhb;
      e = Aila + Aa;
    } else if (elm === "|.0.|.0.|.0.|.|.0.|.|.0.|.|.|.0.|.0") {
      b = " فَالَاتُنْ مُتَفْعِ لُنْ فَعِلَاتُنْ   ";
      c = Khafif + " " + Tam;
      d = mkhb;
      e = Aila + Aa + " و " + Tachaite;
    } else if (elm === "|.0.|.0.|.0.|.0.|.0.|.|.0.|.|.|.0.|.0") {
      b = " فَالَاتُنْ مُسْتَفْعِ لُنْ فَعِلَاتُنْ   ";
      c = Khafif + " " + Tam;
      d = mkhb;
      e = Aila + Tachaite;
    } else if (elm === "|.0.|.|.0.|.|.|.0.|.|.0.|.|.|.0.|.0") {
      b = " فَاعِلَاتُ مُتَفْعِ لُنْ فَعِلَاتُنْ   ";
      c = Khafif + " " + Tam;
      d = mkhb;
      e = Aila + Aa + " و " + Kaf;
    } else if (elm === "|.0.|.|.0.|.|.0.|.0.|.|.0.|.|.|.0.|.0") {
      b = " فَاعِلَاتُ مُسْتَفْعِ لُنْ فَعِلَاتُنْ   ";
      c = Khafif + " " + Tam;
      d = mkhb;
      e = Aila + Kaf;
    }
    /*محذوفة */
    if (elm === "|.0.|.|.0.|.0.|.0.|.0.|.|.0.|.0.|.|.0") {
      b = " فَاعِلَاتُنْ مُسْتَفْعِ لُنْ فَاعِلُنْ   ";
      c = Khafif + " " + Tam;
      d = kt3;
    } else if (elm === "|.|.|.0.|.0.|.0.|.0.|.|.0.|.0.|.|.0") {
      b = " فَعِلَاتُنْ مُسْتَفْعِ لُنْ فَاعِلُنْ   ";
      c = Khafif + " " + Tam;
      d = kt3;
      e = Aila + Aa;
    } else if (elm === "|.0.|.|.0.|.0.|.|.0.|.|.0.|.0.|.|.0") {
      b = " فَاعِلَاتُنْ مُتَفْعِ لُنْ فَاعِلُنْ   ";
      c = Khafif + " " + Tam;
      d = kt3;
      e = Aila + Aa;
    } else if (elm === "|.|.|.0.|.0.|.|.0.|.|.0.|.0.|.|.0") {
      b = " فَعِلَاتُنْ مُتَفْعِ لُنْ فَاعِلُنْ   ";
      c = Khafif + " " + Tam;
      d = kt3;
      e = Aila + Aa;
    } else if (elm === "|.0.|.0.|.0.|.|.0.|.|.0.|.0.|.|.0") {
      b = " فَالَاتُنْ مُتَفْعِ لُنْ فَاعِلُنْ   ";
      c = Khafif + " " + Tam;
      d = kt3;
      e = Aila + Aa + " و " + Tachaite;
    } else if (elm === "|.0.|.0.|.0.|.0.|.0.|.|.0.|.0.|.|.0") {
      b = " فَالَاتُنْ مُسْتَفْعِ لُنْ فَاعِلُنْ   ";
      c = Khafif + " " + Tam;
      d = kt3;
      e = Aila + Tachaite;
    } else if (elm === "|.0.|.|.0.|.|.|.0.|.|.0.|.0.|.|.0") {
      b = " فَاعِلَاتُ مُتَفْعِ لُنْ فَاعِلُنْ   ";
      c = Khafif + " " + Tam;
      d = kt3;
      e = Aila + Aa + " و " + Kaf;
    } else if (elm === "|.0.|.|.0.|.|.0.|.0.|.|.0.|.0.|.|.0") {
      b = " فَاعِلَاتُ مُسْتَفْعِ لُنْ فَاعِلُنْ   ";
      c = Khafif + " " + Tam;
      d = kt3;
      e = Aila + Kaf;
    }
    /*محذوف مخبون */

    if (elm === "|.0.|.|.0.|.0.|.0.|.0.|.|.0.|.|.|.0") {
      b = " فَاعِلَاتُنْ مُسْتَفْعِ لُنْ فَعِلُنْ   ";
      c = Khafif + " " + Tam;
      d = MMkhbn;
    } else if (elm === "|.|.|.0.|.0.|.0.|.0.|.|.0.|.|.|.0") {
      b = " فَعِلَاتُنْ مُسْتَفْعِ لُنْ فَعِلُنْ   ";
      c = Khafif + " " + Tam;
      d = MMkhbn;
      e = Aila + Aa;
    } else if (elm === "|.0.|.|.0.|.0.|.|.0.|.|.0.|.|.|.0") {
      b = " فَاعِلَاتُنْ مُتَفْعِ لُنْ فَعِلُنْ   ";
      c = Khafif + " " + Tam;
      d = MMkhbn;
      e = Aila + Aa;
    } else if (elm === "|.|.|.0.|.0.|.|.0.|.|.0.|.|.|.0") {
      b = " فَعِلَاتُنْ مُتَفْعِ لُنْ فَعِلُنْ   ";
      c = Khafif + " " + Tam;
      d = MMkhbn;
      e = Aila + Aa;
    } else if (elm === "|.0.|.0.|.0.|.|.0.|.|.0.|.|.|.0") {
      b = " فَالَاتُنْ مُتَفْعِ لُنْ فَعِلُنْ   ";
      c = Khafif + " " + Tam;
      d = MMkhbn;
      e = Aila + Aa + " و " + Tachaite;
    } else if (elm === "|.0.|.0.|.0.|.0.|.0.|.|.0.|.|.|.0") {
      b = " فَالَاتُنْ مُسْتَفْعِ لُنْ فَعِلُنْ   ";
      c = Khafif + " " + Tam;
      d = MMkhbn;
      e = Aila + Tachaite;
    } else if (elm === "|.0.|.|.0.|.|.|.0.|.|.0.|.|.|.0") {
      b = " فَاعِلَاتُ مُتَفْعِ لُنْ فَعِلُنْ   ";
      c = Khafif + " " + Tam;
      d = MMkhbn;
      e = Aila + Aa + " و " + Kaf;
    } else if (elm === "|.0.|.|.0.|.|.0.|.0.|.|.0.|.|.|.0") {
      b = " فَاعِلَاتُ مُسْتَفْعِ لُنْ فَعِلُنْ   ";
      c = Khafif + " " + Tam;
      d = MMkhbn;
      e = Aila + Kaf;
    }
    /*الخفيف المجزوء */
    /*صحيحة */
    if (elm === "|.0.|.|.0.|.0.|.0.|.0.|.|.0") {
      b = " فَاعِلَاتُنْ مُسْتَفْعِ لُنْ    ";
      c = Khafif + " " + Mj;
      d = kt1;
    } else if (elm === "|.|.|.0.|.0.|.0.|.0.|.|.0") {
      b = " فَعِلَاتُنْ مُسْتَفْعِ لُنْ    ";
      c = Khafif + " " + Mj;
      d = kt1;
      e = Aila + Aa;
    }
    /*مخبون */
    if (elm === "|.0.|.|.0.|.0.|.|.0.|.|.0") {
      b = " فَاعِلَاتُنْ مُتَفْعِ لُنْ    ";
      c = Khafif + " " + Mj;
      d = mkhb;
    } else if (elm === "|.|.|.0.|.0.|.|.0.|.|.0") {
      b = " فَعِلَاتُنْ مُتَفْعِ لُنْ    ";
      c = Khafif + " " + Mj;
      d = mkhb;
      e = Aila + Aa;
    }
    /*مخبون مقصور */
    if (elm === "|.0.|.|.0.|.0.|.|.0.|.0") {
      b = " فَاعِلَاتُنْ مُتَفْعِ لْ    ";
      c = Khafif + " " + Mj;
      d = MMksor;
    } else if (elm === "|.|.|.0.|.0.|.|.0.|.0") {
      b = " فَعِلَاتُنْ مُتَفْعِ لْ    ";
      c = Khafif + " " + Mj;
      d = MMksor;
      e = Aila + Aa;
    }
    /*المضارع ------------------------------------------------------------------ */
    if (elm === "|.|.0.|.0.|.0.|.0.|.|.0.|.0") {
      b = " مَفَاعِيلُنْ فَاعِ لَاتُنْ   ";
      c = Modariaa + " " + Mj;
      d = kt1;
    } else if (elm === "|.|.0.|.|.0.|.0.|.|.0.|.0") {
      b = " مَفَاعِلُنْ فَاعِ لَاتُنْ   ";
      c = Modariaa + " " + Mj;
      d = kt1;
      e = Aila + Kap;
    } else if (elm === "|.|.0.|.0.|.|.0.|.|.0.|.0") {
      b = " مَفَاعِيلُ فَاعِ لَاتُنْ   ";
      c = Modariaa + " " + Mj;
      d = kt1;
      e = Aila + Kaf;
    }
    /*المقتضب-------------------------------------------------------------------------- */
    if (elm === "|.0.|.0.|.0.|.|.0.|.|.|.0") {
      b = " مَفْعُولَاتُ مُسْتَعِلُنْ  ";
      c = Moktadib + " " + Mj;
      d = MatW;
    } else if (elm === "|.|.0.|.0.|.|.0.|.|.|.0") {
      b = " مَفَاعِيلُ مُسْتَعِلُنْ  ";
      c = Moktadib + " " + Mj;
      d = MatW;
      e = Aila + Aa;
    } else if (elm === "|.|.0.|.0.|.|.0.|.|.|.0") {
      b = " فَاعِلَاتُ مُسْتَعِلُنْ  ";
      c = Moktadib + " " + Mj;
      d = MatW;
      e = Aila + Ab;
    }
    /* المجتث-------------------------------------------------------------------------------- */
    /*صحيحة */
    if (elm === "|.0.|.0.|.|.0.|.0.|.|.0.|.0") {
      b = "   مُسْتَفْعِ لُنْ فَاعِلَاتُنْ   ";
      c = Moj + " " + Mj;
      d = kt1;
    } else if (elm === "|.|.0.|.|.0.|.0.|.|.0.|.0") {
      b = "   مُتَفْعِ لُنْ فَاعِلَاتُنْ   ";
      c = Moj + " " + Mj;
      d = kt1;
      e = Aila + Aa;
    }
    /*مخبونة */
    if (elm === "|.0.|.0.|.|.0.|.|.|.0.|.0") {
      b = "   مُسْتَفْعِ لُنْ فَعِلَاتُنْ   ";
      c = Moj + " " + Mj;
      d = mkhb;
    } else if (elm === "|.|.0.|.|.0.|.|.|.0.|.0") {
      b = "   مُتَفْعِ لُنْ فَعِلَاتُنْ   ";
      c = Moj + " " + Mj;
      d = mkhb;
      e = Aila + Aa;
    }
    /*متشعثة */
    if (elm === "|.0.|.0.|.|.0.|.0.|.0.|.0") {
      b = "   مُسْتَفْعِ لُنْ فَالَاتُنْ   ";
      c = Moj + " " + Mj;
      d = MTachaite;
    } else if (elm === "|.|.0.|.|.0.|.0.|.0.|.0") {
      b = "   مُتَفْعِ لُنْ فَالَاتُنْ   ";
      c = Moj + " " + Mj;
      d = MTachaite;
      e = Aila + Aa;
    }

    /*المتقارب تام --------------------------------------------------------------------- */
    /*صحيحة */
    if (elm === "|.|.0.|.0.|.|.0.|.0.|.|.0.|.0.|.|.0.|.0") {
      b = "   فَعُولُنْ فَعُولُنْ فَعُولُنْ فَعُولُنْ   ";
      c = Mot + " " + Tam;
      d = kt1;
    } else if (elm === "|.|.0.|.|.|.0.|.|.|.0.|.|.|.0.|.0") {
      b = "   فَعُولُ فَعُولُ فَعُولُ فَعُولُنْ   ";
      c = Mot + " " + Tam;
      d = kt1;
      e = Aila + Kap;
    } else if (elm === "|.|.0.|.0.|.|.0.|.|.|.0.|.|.|.0.|.0") {
      b = "   فَعُولُنْ فَعُولُ فَعُولُ فَعُولُنْ   ";
      c = Mot + " " + Tam;
      d = kt1;
      e = Aila + Kap;
    } else if (elm === "|.|.0.|.0.|.|.0.|.0.|.|.0.|.|.|.0.|.0") {
      b = "   فَعُولُنْ فَعُولُنْ فَعُولُ فَعُولُنْ   ";
      c = Mot + " " + Tam;
      d = kt1;
      e = Aila + Kap;
    } else if (elm === "|.|.0.|.|.|.0.|.0.|.|.0.|.0.|.|.0.|.0") {
      b = "   فَعُولُ فَعُولُنْ فَعُولُنْ فَعُولُنْ   ";
      c = Mot + " " + Tam;
      d = kt1;
      e = Aila + Kap;
    } else if (elm === "|.|.0.|.0.|.|.0.|.|.|.0.|.0.|.|.0.|.0") {
      b = "   فَعُولُنْ فَعُولُ فَعُولُنْ فَعُولُنْ   ";
      c = Mot + " " + Tam;
      d = kt1;
      e = Aila + Kap;
    } else if (elm === "|.|.0.|.|.|.0.|.|.|.0.|.0.|.|.0.|.0") {
      b = "   فَعُولُ فَعُولُ فَعُولُنْ فَعُولُنْ   ";
      c = Mot + " " + Tam;
      d = kt1;
      e = Aila + Kap;
    }

    /*مقبوضة */
    if (elm === "|.|.0.|.0.|.|.0.|.0.|.|.0.|.0.|.|.0.|") {
      b = "   فَعُولُنْ فَعُولُنْ فَعُولُنْ فَعُولُ   ";
      c = Mot + " " + Tam;
      d = kt2;
    } else if (elm === "|.|.0.|.|.|.0.|.|.|.0.|.|.|.0.|") {
      b = "   فَعُولُ فَعُولُ فَعُولُ فَعُولُ   ";
      c = Mot + " " + Tam;
      d = kt2;
      e = Aila + Kap;
    } else if (elm === "|.|.0.|.0.|.|.0.|.|.|.0.|.|.|.0.|") {
      b = "   فَعُولُنْ فَعُولُ فَعُولُ فَعُولُ   ";
      c = Mot + " " + Tam;
      d = kt2;
      e = Aila + Kap;
    } else if (elm === "|.|.0.|.0.|.|.0.|.0.|.|.0.|.|.|.0.|") {
      b = "   فَعُولُنْ فَعُولُنْ فَعُولُ فَعُولُ   ";
      c = Mot + " " + Tam;
      d = kt2;
      e = Aila + Kap;
    } else if (elm === "|.|.0.|.|.|.0.|.0.|.|.0.|.0.|.|.0.|") {
      b = "   فَعُولُ فَعُولُنْ فَعُولُنْ فَعُولُ   ";
      c = Mot + " " + Tam;
      d = kt2;
      e = Aila + Kap;
    } else if (elm === "|.|.0.|.0.|.|.0.|.|.|.0.|.0.|.|.0.|") {
      b = "   فَعُولُنْ فَعُولُ فَعُولُنْ فَعُولُ   ";
      c = Mot + " " + Tam;
      d = kt2;
      e = Aila + Kap;
    } else if (elm === "|.|.0.|.|.|.0.|.|.|.0.|.0.|.|.0.|.0") {
      b = "   فَعُولُ فَعُولُ فَعُولُنْ فَعُولُنْ   ";
      c = Mot + " " + Tam;
      d = kt2;
      e = Aila + Kap;
    }

    /*مقبوضة */
    if (elm === "|.|.0.|.0.|.|.0.|.0.|.|.0.|.0.|.|.0.|") {
      b = "   فَعُولُنْ فَعُولُنْ فَعُولُنْ فَعُولُ   ";
      c = Mot + " " + Tam;
      d = kt2;
    } else if (elm === "|.|.0.|.|.|.0.|.|.|.0.|.|.|.0.|") {
      b = "   فَعُولُ فَعُولُ فَعُولُ فَعُولُ   ";
      c = Mot + " " + Tam;
      d = kt2;
      e = Aila + Kap;
    } else if (elm === "|.|.0.|.0.|.|.0.|.|.|.0.|.|.|.0.|") {
      b = "   فَعُولُنْ فَعُولُ فَعُولُ فَعُولُ   ";
      c = Mot + " " + Tam;
      d = kt2;
      e = Aila + Kap;
    } else if (elm === "|.|.0.|.0.|.|.0.|.0.|.|.0.|.|.|.0.|") {
      b = "   فَعُولُنْ فَعُولُنْ فَعُولُ فَعُولُ   ";
      c = Mot + " " + Tam;
      d = kt2;
      e = Aila + Kap;
    } else if (elm === "|.|.0.|.|.|.0.|.0.|.|.0.|.0.|.|.0.|") {
      b = "   فَعُولُ فَعُولُنْ فَعُولُنْ فَعُولُ   ";
      c = Mot + " " + Tam;
      d = kt2;
      e = Aila + Kap;
    } else if (elm === "|.|.0.|.0.|.|.0.|.|.|.0.|.0.|.|.0.|") {
      b = "   فَعُولُنْ فَعُولُ فَعُولُنْ فَعُولُ   ";
      c = Mot + " " + Tam;
      d = kt2;
      e = Aila + Kap;
    } else if (elm === "|.|.0.|.|.|.0.|.|.|.0.|.0.|.|.0.|") {
      b = " فَعُولُ فَعُولُ فَعُولُنْ فَعُولُ   ";
      c = Mot + " " + Tam;
      d = kt2;
      e = Aila + Kap;
    }

    /*مقصور */
    if (elm === "|.|.0.|.0.|.|.0.|.0.|.|.0.|.0.|.|.0.0") {
      b = "   فَعُولُنْ فَعُولُنْ فَعُولُنْ فَعُولْ   ";
      c = Mot + " " + Tam;
      d = Mksora;
    } else if (elm === "|.|.0.|.|.|.0.|.|.|.0.|.|.|.0.0") {
      b = "   فَعُولُ فَعُولُ فَعُولُ فَعُولْ   ";
      c = Mot + " " + Tam;
      d = Mksora;
      e = Aila + Kap;
    } else if (elm === "|.|.0.|.0.|.|.0.|.|.|.0.|.|.|.0.0") {
      b = "   فَعُولُنْ فَعُولُ فَعُولُ فَعُولْ   ";
      c = Mot + " " + Tam;
      d = Mksora;
      e = Aila + Kap;
    } else if (elm === "|.|.0.|.0.|.|.0.|.0.|.|.0.|.|.|.0.0") {
      b = "   فَعُولُنْ فَعُولُنْ فَعُولُ فَعُولْ   ";
      c = Mot + " " + Tam;
      d = Mksora;
      e = Aila + Kap;
    } else if (elm === "|.|.0.|.|.|.0.|.0.|.|.0.|.0.|.|.0.0") {
      b = "   فَعُولُ فَعُولُنْ فَعُولُنْ فَعُولْ   ";
      c = Mot + " " + Tam;
      d = Mksora;
      e = Aila + Kap;
    } else if (elm === "|.|.0.|.0.|.|.0.|.|.|.0.|.0.|.|.0.0") {
      b = "   فَعُولُنْ فَعُولُ فَعُولُنْ فَعُولْ   ";
      c = Mot + " " + Tam;
      d = Mksora;
      e = Aila + Kap;
    } else if (elm === "|.|.0.|.|.|.0.|.|.|.0.|.0.|.|.0.0") {
      b = "   فَعُولُ فَعُولُ فَعُولُنْ فَعُولْ   ";
      c = Mot + " " + Tam;
      d = Mksora;
      e = Aila + Kap;
    }

    /*محذوفة */
    if (elm === "|.|.0.|.0.|.|.0.|.0.|.|.0.|.0.|.|.0") {
      b = "   فَعُولُنْ فَعُولُنْ فَعُولُنْ فَعَلْ   ";
      c = Mot + " " + Tam;
      d = kt3;
    } else if (elm === "|.|.0.|.|.|.0.|.|.|.0.|.|.|.0") {
      b = "   فَعُولُ فَعُولُ فَعُولُ فَعَلْ   ";
      c = Mot + " " + Tam;
      d = kt3;
      e = Aila + Kap;
    } else if (elm === "|.|.0.|.0.|.|.0.|.|.|.0.|.|.|.0") {
      b = "   فَعُولُنْ فَعُولُ فَعُولُ فَعَلْ   ";
      c = Mot + " " + Tam;
      d = kt3;
      e = Aila + Kap;
    } else if (elm === "|.|.0.|.0.|.|.0.|.0.|.|.0.|.|.|.0") {
      b = "   فَعُولُنْ فَعُولُنْ فَعُولُ فَعَلْ   ";
      c = Mot + " " + Tam;
      d = kt3;
      e = Aila + Kap;
    } else if (elm === "|.|.0.|.|.|.0.|.0.|.|.0.|.0.|.|.0") {
      b = "   فَعُولُ فَعُولُنْ فَعُولُنْ فَعَلْ   ";
      c = Mot + " " + Tam;
      d = kt3;
      e = Aila + Kap;
    } else if (elm === "|.|.0.|.0.|.|.0.|.|.|.0.|.0.|.|.0") {
      b = "   فَعُولُنْ فَعُولُ فَعُولُنْ فَعَلْ   ";
      c = Mot + " " + Tam;
      d = kt3;
      e = Aila + Kap;
    } else if (elm === "|.|.0.|.|.|.0.|.|.|.0.|.0.|.|.0") {
      b = "   فَعُولُ فَعُولُ فَعُولُنْ فَعَلْ   ";
      c = Mot + " " + Tam;
      d = kt3;
      e = Aila + Kap;
    }

    /*أبتر */
    /*محذوفة */
    if (elm === "|.|.0.|.0.|.|.0.|.0.|.|.0.|.0.|.0") {
      b = "   فَعُولُنْ فَعُولُنْ فَعُولُنْ فَعْ   ";
      c = Mot + " " + Tam;
      d = Abtar;
    } else if (elm === "|.|.0.|.|.|.0.|.|.|.0.|.|.0") {
      b = "   فَعُولُ فَعُولُ فَعُولُ فَعْ   ";
      c = Mot + " " + Tam;
      d = Abtar;
      e = Aila + Kap;
    } else if (elm === "|.|.0.|.0.|.|.0.|.|.|.0.|.|.0") {
      b = "   فَعُولُنْ فَعُولُ فَعُولُ فَعْ   ";
      c = Mot + " " + Tam;
      d = Abtar;
      e = Aila + Kap;
    } else if (elm === "|.|.0.|.0.|.|.0.|.0.|.|.0.|.|.0") {
      b = "   فَعُولُنْ فَعُولُنْ فَعُولُ فَعْ   ";
      c = Mot + " " + Tam;
      d = Abtar;
      e = Aila + Kap;
    } else if (elm === "|.|.0.|.|.|.0.|.0.|.|.0.|.0.|.0") {
      b = "   فَعُولُ فَعُولُنْ فَعُولُنْ فَعْ   ";
      c = Mot + " " + Tam;
      d = Abtar;
      e = Aila + Kap;
    } else if (elm === "|.|.0.|.0.|.|.0.|.|.|.0.|.0.|.0") {
      b = "   فَعُولُنْ فَعُولُ فَعُولُنْ فَعْ   ";
      c = Mot + " " + Tam;
      d = Abtar;
      e = Aila + Kap;
    } else if (elm === "|.|.0.|.|.|.0.|.|.|.0.|.0.|.0") {
      b = "   فَعُولُ فَعُولُ فَعُولُنْ فَعْ   ";
      c = Mot + " " + Tam;
      d = Abtar;
      e = Aila + Kap;
    }

    /*المجزوء */
    /*محذوفة */
    if (elm === "|.|.0.|.0.|.|.0.|.0.|.|.0") {
      b = "   فَعُولُنْ فَعُولُنْ  فَعَلْ   ";
      c = Mot + " " + Mj;
      d = kt3;
    } else if (elm === "|.|.0.|.|.|.0.|.|.|.0") {
      b = "    فَعُولُ فَعُولُ فَعَلْ   ";
      c = Mot + " " + Mj;
      d = kt3;
      e = Aila + Kap;
    } else if (elm === "|.|.0.|.0.|.|.0.|.|.|.0") {
      b = "    فَعُولُنْ فَعُولُ فَعَلْ   ";
      c = Mot + " " + Mj;
      d = kt3;
      e = Aila + Kap;
    } else if (elm === "|.|.0.|.|.|.0.|.0.|.|.0") {
      b = "    فَعُولُ فَعُولُنْ فَعَلْ   ";
      c = Mot + " " + Mj;
      d = kt3;
      e = Aila + Kap;
    }
    /*أبتر */
    if (elm === "|.|.0.|.0.|.|.0.|.0.|.0") {
      b = "   فَعُولُنْ فَعُولُنْ  فَعْ   ";
      c = Mot + " " + Mj;
      d = Abtar;
    } else if (elm === "|.|.0.|.|.|.0.|.|.0") {
      b = "    فَعُولُ فَعُولُ فَعْ   ";
      c = Mot + " " + Mj;
      d = Abtar;
      e = Aila + Kap;
    } else if (elm === "|.|.0.|.0.|.|.0.|.|.0") {
      b = "    فَعُولُنْ فَعُولُ فَعْ   ";
      c = Mot + " " + Mj;
      d = Abtar;
      e = Aila + Kap;
    } else if (elm === "|.|.0.|.|.|.0.|.0.|.0") {
      b = "    فَعُولُ فَعُولُنْ فَعْ   ";
      c = Mot + " " + Mj;
      d = Abtar;
      e = Aila + Kap;
    }
    /*المتدارك--------------------------------------------------------------------------------- */
    /*تام */
    if (elm === "|.0.|.|.0.|.0.|.|.0.|.0.|.|.0.|.0.|.|.0") {
      b = "   فَاعِلُنْ فَاعِلُنْ فَاعِلُنْ فَاعِلُنْ  ";
      c = Motadarak + " " + Tam;
      d = Abtar;
    } else if (elm === "|.|.|.0.|.|.|.0.|.|.|.0.|.0.|.|.0") {
      b = "   فَعِلُنْ فَعِلُنْ فَعِلُنْ فَاعِلُنْ  ";
      c = Motadarak + " " + Tam;
      d = kt1;
      e = Aila + Aa;
    } else if (elm === "|.|.|.0.|.|.|.0.|.0.|.|.0.|.0.|.|.0") {
      b = "   فَعِلُنْ فَعِلُنْ فَاعِلُنْ فَاعِلُنْ  ";
      c = Motadarak + " " + Tam;
      d = kt1;
      e = Aila + Aa;
    } else if (elm === "|.0.|.|.0.|.|.|.0.|.|.|.0.|.0.|.|.0") {
      b = "   فَاعِلُنْ فَعِلُنْ فَعِلُنْ فَاعِلُنْ  ";
      c = Motadarak + " " + Tam;
      d = kt1;
      e = Aila + Aa;
    } else if (elm === "|.|.|.0.|.0.|.|.0.|.0.|.|.0.|.0.|.|.0") {
      b = "   فَعِلُنْ فَاعِلُنْ فَاعِلُنْ فَاعِلُنْ  ";
      c = Motadarak + " " + Tam;
      d = kt1;
      e = Aila + Aa;
    } else if (elm === "|.0.|.|.0.|.|.|.0.|.0.|.|.0.|.0.|.|.0") {
      b = "   فَاعِلُنْ فَعِلُنْ فَاعِلُنْ فَاعِلُنْ  ";
      c = Motadarak + " " + Tam;
      d = kt1;
      e = Aila + Aa;
    } else if (elm === "|.0.|.|.0.|.0.|.|.0.|.|.|.0.|.0.|.|.0") {
      b = "   فَاعِلُنْ فَاعِلُنْ فَعِلُنْ فَاعِلُنْ  ";
      c = Motadarak + " " + Tam;
      d = kt1;
      e = Aila + Aa;
    } else if (elm === "|.0.|.0.|.0.|.0.|.0.|.0.|.0.|.|.0") {
    /*--*/
      b = "   فَعْلُنْ فَعْلُنْ فَعْلُنْ فَاعِلُنْ  ";
      c = Motadarak + " " + Tam;
      d = kt1;
      e = Aila + Tachaite;
    } else if (elm === "|.0.|.0.|.0.|.0.|.0.|.|.0.|.0.|.|.0") {
      b = "   فَعْلُنْ فَعْلُنْ فَاعِلُنْ فَاعِلُنْ  ";
      c = Motadarak + " " + Tam;
      d = kt1;
      e = Aila + Tachaite;
    } else if (elm === "|.0.|.|.0.|.0.|.0.|.0.|.0.|.0.|.|.0") {
      b = "   فَاعِلُنْ فَعْلُنْ فَعْلُنْ فَاعِلُنْ  ";
      c = Motadarak + " " + Tam;
      d = kt1;
      e = Aila + Tachaite;
    } else if (elm === "|.0.|.0.|.0.|.|.0.|.0.|.|.0.|.0.|.|.0") {
      b = "   فَعْلُنْ فَاعِلُنْ فَاعِلُنْ فَاعِلُنْ  ";
      c = Motadarak + " " + Tam;
      d = kt1;
      e = Aila + Tachaite;
    } else if (elm === "|.0.|.|.0.|.0.|.0.|.0.|.|.0.|.0.|.|.0") {
      b = "   فَاعِلُنْ فَعْلُنْ فَاعِلُنْ فَاعِلُنْ  ";
      c = Motadarak + " " + Tam;
      d = kt1;
      e = Aila + Tachaite;
    } else if (elm === "|.0.|.|.0.|.0.|.|.0.|.0.|.0.|.0.|.|.0") {
      b = "   فَاعِلُنْ فَاعِلُنْ فَعْلُنْ فَاعِلُنْ  ";
      c = Motadarak + " " + Tam;
      d = kt1;
      e = Aila + Tachaite;
    } else if (elm === "|.0.|.0.|.|.|.0.|.0.|.|.0.|.0.|.|.0") {
    /*----*/
      b = "   فَعْلُنْ فَعِلُنْ فَاعِلُنْ فَاعِلُنْ  ";
      c = Motadarak + " " + Tam;
      d = kt1;
      e = Aila + Tachaite + " و " + Aa;
    } else if (elm === "|.0.|.|.0.|.0.|.0.|.|.|.|.0.|.0.|.|.0") {
      b = "   فَاعِلُنْ فَعْلُنْ فَعِلُنْ فَاعِلُنْ  ";
      c = Motadarak + " " + Tam;
      d = kt1;
      e = Aila + Tachaite;
    } else if (elm === "|.|.|.0.|.0.|.0.|.0.|.|.0.|.0.|.|.0") {
      b = "   فَعِلُنْ فَعْلُنْ فَاعِلُنْ فَاعِلُنْ  ";
      c = Motadarak + " " + Tam;
      d = kt1;
      e = Aila + Tachaite;
    } else if (elm === "|.0.|.|.0.|.|.|.|.0.|.0.|.0.|.0.|.|.0") {
      b = "   فَاعِلُنْ فَعِلُنْ فَعْلُنْ فَاعِلُنْ  ";
      c = Motadarak + " " + Tam;
      d = kt1;
      e = Aila + Tachaite;
    } else if (elm === "|.|.|.0.|.0.|.0.|.0.|.0.|.0.|.|.0") {
      b = "   فَعِلُنْ فَعْلُنْ فَعْلُنْ فَاعِلُنْ  ";
      c = Motadarak + " " + Tam;
      d = kt1;
      e = Aila + Tachaite;
    } else if (elm === "|.0.|.0.|.|.|.0.|.|.|.0.|.0.|.|.0") {
      b = "   فَعْلُنْ فَعِلُنْ فَعِلُنْ فَاعِلُنْ  ";
      c = Motadarak + " " + Tam;
      d = kt1;
      e = Aila + Tachaite;
    } else if (elm === "|.0.|.0.|.0.|.0.|.|.|.0.|.0.|.|.0") {
      b = "   فَعْلُنْ فَعْلُنْ فَعِلُنْ فَاعِلُنْ  ";
      c = Motadarak + " " + Tam;
      d = kt1;
      e = Aila + Tachaite;
    } else if (elm === "|.|.|.0.|.|.|.0.|.0.|.0.|.0.|.|.0") {
      b = "   فَعِلُنْ فَعِلُنْ فَعْلُنْ فَاعِلُنْ  ";
      c = Motadarak + " " + Tam;
      d = kt1;
      e = Aila + Tachaite;
    } else if (elm === "|.|.|.0.|.0.|.0.|.|.|.0.|.0.|.|.0") {
      b = "   فَعِلُنْ فَعْلُنْ فَعِلُنْ فَاعِلُنْ  ";
      c = Motadarak + " " + Tam;
      d = kt1;
      e = Aila + Tachaite;
    } else if (elm === "|.0.|.0.|.|.|.0.|.0.|.0.|.0.|.|.0") {
      b = "   فَعْلُنْ فَعِلُنْ فَعْلُنْ فَاعِلُنْ  ";
      c = Motadarak + " " + Tam;
      d = kt1;
      e = Aila + Tachaite;
    }
    /* */
    /*متشعثة */
    if (elm === "|.0.|.|.0.|.0.|.|.0.|.0.|.|.0.|.0.|.0") {
      b = "   فَاعِلُنْ فَاعِلُنْ فَاعِلُنْ فَعْلُنْ  ";
      c = Motadarak + " " + Tam;
      d = MTachaite;
    } else if (elm === "|.|.|.0.|.|.|.0.|.|.|.0.|.0.|.0") {
      b = "   فَعِلُنْ فَعِلُنْ فَعِلُنْ فَعْلُنْ  ";
      c = Motadarak + " " + Tam;
      d = MTachaite;
      e = Aila + Aa;
    } else if (elm === "|.|.|.0.|.|.|.0.|.0.|.|.0.|.0.|.0") {
      b = "   فَعِلُنْ فَعِلُنْ فَاعِلُنْ فَعْلُنْ  ";
      c = Motadarak + " " + Tam;
      d = MTachaite;
      e = Aila + Aa;
    } else if (elm === "|.0.|.|.0.|.|.|.0.|.|.|.0.|.0.|.0") {
      b = "   فَاعِلُنْ فَعِلُنْ فَعِلُنْ فَعْلُنْ  ";
      c = Motadarak + " " + Tam;
      d = MTachaite;
      e = Aila + Aa;
    } else if (elm === "|.|.|.0.|.0.|.|.0.|.0.|.|.0.|.0.|.0") {
      b = "   فَعِلُنْ فَاعِلُنْ فَاعِلُنْ فَعْلُنْ  ";
      c = Motadarak + " " + Tam;
      d = MTachaite;
      e = Aila + Aa;
    } else if (elm === "|.0.|.|.0.|.|.|.0.|.0.|.|.0.|.0.|.0") {
      b = "   فَاعِلُنْ فَعِلُنْ فَاعِلُنْ فَعْلُنْ  ";
      c = Motadarak + " " + Tam;
      d = MTachaite;
      e = Aila + Aa;
    } else if (elm === "|.0.|.|.0.|.0.|.|.0.|.|.|.0.|.0.|.0") {
      b = "   فَاعِلُنْ فَاعِلُنْ فَعِلُنْ فَعْلُنْ  ";
      c = Motadarak + " " + Tam;
      d = MTachaite;
      e = Aila + Aa;
    } else if (elm === "|.0.|.0.|.0.|.0.|.0.|.0.|.0.|.0") {
    /*--*/
      b = "   فَعْلُنْ فَعْلُنْ فَعْلُنْ فَعْلُنْ  ";
      c = Motadarak + " " + Tam;
      d = MTachaite;
      e = Aila + Tachaite;
    } else if (elm === "|.0.|.0.|.0.|.0.|.0.|.|.0.|.0.|.0") {
      b = "   فَعْلُنْ فَعْلُنْ فَاعِلُنْ فَعْلُنْ  ";
      c = Motadarak + " " + Tam;
      d = MTachaite;
      e = Aila + Tachaite;
    } else if (elm === "|.0.|.|.0.|.0.|.0.|.0.|.0.|.0.|.0") {
      b = "   فَاعِلُنْ فَعْلُنْ فَعْلُنْ فَعْلُنْ  ";
      c = Motadarak + " " + Tam;
      d = MTachaite;
      e = Aila + Tachaite;
    } else if (elm === "|.0.|.0.|.0.|.|.0.|.0.|.|.0.|.0.|.0") {
      b = "   فَعْلُنْ فَاعِلُنْ فَاعِلُنْ فَعْلُنْ  ";
      c = Motadarak + " " + Tam;
      d = MTachaite;
      e = Aila + Tachaite;
    } else if (elm === "|.0.|.|.0.|.0.|.0.|.0.|.|.0.|.0.|.0") {
      b = "   فَاعِلُنْ فَعْلُنْ فَاعِلُنْ فَعْلُنْ  ";
      c = Motadarak + " " + Tam;
      d = MTachaite;
      e = Aila + Tachaite;
    } else if (elm === "|.0.|.|.0.|.0.|.|.0.|.0.|.0.|.0.|.0") {
      b = "   فَاعِلُنْ فَاعِلُنْ فَعْلُنْ فَعْلُنْ  ";
      c = Motadarak + " " + Tam;
      d = MTachaite;
      e = Aila + Tachaite;
    } else if (elm === "|.0.|.0.|.|.|.0.|.0.|.|.0.|.0.|.0") {
    /*----*/
      b = "   فَعْلُنْ فَعِلُنْ فَاعِلُنْ فَعْلُنْ  ";
      c = Motadarak + " " + Tam;
      d = MTachaite;
      e = Aila + Tachaite + " و " + Aa;
    } else if (elm === "|.0.|.|.0.|.0.|.0.|.|.|.|.0.|.0.|.0") {
      b = "   فَاعِلُنْ فَعْلُنْ فَعِلُنْ فَعْلُنْ  ";
      c = Motadarak + " " + Tam;
      d = MTachaite;
      e = Aila + Tachaite;
    } else if (elm === "|.|.|.0.|.0.|.0.|.0.|.|.0.|.0.|.0") {
      b = "   فَعِلُنْ فَعْلُنْ فَاعِلُنْ فَعْلُنْ  ";
      c = Motadarak + " " + Tam;
      d = MTachaite;
      e = Aila + Tachaite;
    } else if (elm === "|.0.|.|.0.|.|.|.|.0.|.0.|.0.|.0.|.0") {
      b = "   فَاعِلُنْ فَعِلُنْ فَعْلُنْ فَعْلُنْ  ";
      c = Motadarak + " " + Tam;
      d = MTachaite;
      e = Aila + Tachaite;
    } else if (elm === "|.|.|.0.|.0.|.0.|.0.|.0.|.0.|.0") {
      b = "   فَعِلُنْ فَعْلُنْ فَعْلُنْ فَعْلُنْ  ";
      c = Motadarak + " " + Tam;
      d = MTachaite;
      e = Aila + Tachaite;
    } else if (elm === "|.0.|.0.|.|.|.0.|.|.|.0.|.0.|.0") {
      b = "   فَعْلُنْ فَعِلُنْ فَعِلُنْ فَعْلُنْ  ";
      c = Motadarak + " " + Tam;
      d = MTachaite;
      e = Aila + Tachaite;
    } else if (elm === "|.0.|.0.|.0.|.0.|.|.|.0.|.0.|.0") {
      b = "   فَعْلُنْ فَعْلُنْ فَعِلُنْ فَعْلُنْ  ";
      c = Motadarak + " " + Tam;
      d = MTachaite;
      e = Aila + Tachaite;
    } else if (elm === "|.|.|.0.|.|.|.0.|.0.|.0.|.0.|.0") {
      b = "   فَعِلُنْ فَعِلُنْ فَعْلُنْ فَعْلُنْ  ";
      c = Motadarak + " " + Tam;
      d = MTachaite;
      e = Aila + Tachaite;
    } else if (elm === "|.|.|.0.|.0.|.0.|.|.|.0.|.0.|.0") {
      b = "   فَعِلُنْ فَعْلُنْ فَعِلُنْ فَعْلُنْ  ";
      c = Motadarak + " " + Tam;
      d = MTachaite;
      e = Aila + Tachaite;
    } else if (elm === "|.0.|.0.|.|.|.0.|.0.|.0.|.0.|.0") {
      b = "   فَعْلُنْ فَعِلُنْ فَعْلُنْ فَعْلُنْ  ";
      c = Motadarak + " " + Tam;
      d = MTachaite;
      e = Aila + Tachaite;
    }
    /*مخبونة */
    if (elm === "|.0.|.|.0.|.0.|.|.0.|.0.|.|.0.|.|.|.0") {
      b = "   فَاعِلُنْ فَاعِلُنْ فَاعِلُنْ فَعِلُنْ  ";
      c = Motadarak + " " + Tam;
      d = mkhb;
    } else if (elm === "|.|.|.0.|.|.|.0.|.|.|.0.|.|.|.0") {
      b = "   فَعِلُنْ فَعِلُنْ فَعِلُنْ فَعِلُنْ  ";
      c = Motadarak + " " + Tam;
      d = mkhb;
      e = Aila + Aa;
    } else if (elm === "|.|.|.0.|.|.|.0.|.0.|.|.0.|.|.|.0") {
      b = "   فَعِلُنْ فَعِلُنْ فَاعِلُنْ فَعِلُنْ  ";
      c = Motadarak + " " + Tam;
      d = mkhb;
      e = Aila + Aa;
    } else if (elm === "|.0.|.|.0.|.|.|.0.|.|.|.0.|.|.|.0") {
      b = "   فَاعِلُنْ فَعِلُنْ فَعِلُنْ فَعِلُنْ  ";
      c = Motadarak + " " + Tam;
      d = mkhb;
      e = Aila + Aa;
    } else if (elm === "|.|.|.0.|.0.|.|.0.|.0.|.|.0.|.|.|.0") {
      b = "   فَعِلُنْ فَاعِلُنْ فَاعِلُنْ فَعِلُنْ  ";
      c = Motadarak + " " + Tam;
      d = mkhb;
      e = Aila + Aa;
    } else if (elm === "|.0.|.|.0.|.|.|.0.|.0.|.|.0.|.|.|.0") {
      b = "   فَاعِلُنْ فَعِلُنْ فَاعِلُنْ فَعِلُنْ  ";
      c = Motadarak + " " + Tam;
      d = mkhb;
      e = Aila + Aa;
    } else if (elm === "|.0.|.|.0.|.0.|.|.0.|.|.|.0.|.|.|.0") {
      b = "   فَاعِلُنْ فَاعِلُنْ فَعِلُنْ فَعِلُنْ  ";
      c = Motadarak + " " + Tam;
      d = mkhb;
      e = Aila + Aa;
    } else if (elm === "|.0.|.0.|.0.|.0.|.0.|.0.|.|.|.0") {
    /*--*/
      b = "   فَعْلُنْ فَعْلُنْ فَعْلُنْ فَعِلُنْ  ";
      c = Motadarak + " " + Tam;
      d = mkhb;
      e = Aila + Tachaite;
    } else if (elm === "|.0.|.0.|.0.|.0.|.0.|.|.0.|.|.|.0") {
      b = "   فَعْلُنْ فَعْلُنْ فَاعِلُنْ فَعِلُنْ  ";
      c = Motadarak + " " + Tam;
      d = mkhb;
      e = Aila + Tachaite;
    } else if (elm === "|.0.|.|.0.|.0.|.0.|.0.|.0.|.|.|.0") {
      b = "   فَاعِلُنْ فَعْلُنْ فَعْلُنْ فَعِلُنْ  ";
      c = Motadarak + " " + Tam;
      d = mkhb;
      e = Aila + Tachaite;
    } else if (elm === "|.0.|.0.|.0.|.|.0.|.0.|.|.0.|.|.|.0") {
      b = "   فَعْلُنْ فَاعِلُنْ فَاعِلُنْ فَعِلُنْ  ";
      c = Motadarak + " " + Tam;
      d = mkhb;
      e = Aila + Tachaite;
    } else if (elm === "|.0.|.|.0.|.0.|.0.|.0.|.|.0.|.|.|.0") {
      b = "   فَاعِلُنْ فَعْلُنْ فَاعِلُنْ فَعِلُنْ  ";
      c = Motadarak + " " + Tam;
      d = mkhb;
      e = Aila + Tachaite;
    } else if (elm === "|.0.|.|.0.|.0.|.|.0.|.0.|.0.|.|.|.0") {
      b = "   فَاعِلُنْ فَاعِلُنْ فَعْلُنْ فَعِلُنْ  ";
      c = Motadarak + " " + Tam;
      d = mkhb;
      e = Aila + Tachaite;
    } else if (elm === "|.0.|.0.|.|.|.0.|.0.|.|.0.|.|.|.0") {
    /*----*/
      b = "   فَعْلُنْ فَعِلُنْ فَاعِلُنْ فَعِلُنْ  ";
      c = Motadarak + " " + Tam;
      d = mkhb;
      e = Aila + Tachaite + " و " + Aa;
    } else if (elm === "|.0.|.|.0.|.0.|.0.|.|.|.|.0.|.|.|.0") {
      b = "   فَاعِلُنْ فَعْلُنْ فَعِلُنْ فَعِلُنْ  ";
      c = Motadarak + " " + Tam;
      d = mkhb;
      e = Aila + Tachaite;
    } else if (elm === "|.|.|.0.|.0.|.0.|.0.|.|.0.|.|.|.0") {
      b = "   فَعِلُنْ فَعْلُنْ فَاعِلُنْ فَعِلُنْ  ";
      c = Motadarak + " " + Tam;
      d = mkhb;
      e = Aila + Tachaite;
    } else if (elm === "|.0.|.|.0.|.|.|.0.|.0.|.0.|.|.|.0") {
      b = "   فَاعِلُنْ فَعِلُنْ فَعْلُنْ فَعِلُنْ  ";
      c = Motadarak + " " + Tam;
      d = mkhb;
      e = Aila + Tachaite;
    } else if (elm === "|.|.|.0.|.0.|.0.|.0.|.0.|.|.|.0") {
      b = "   فَعِلُنْ فَعْلُنْ فَعْلُنْ فَعِلُنْ  ";
      c = Motadarak + " " + Tam;
      d = mkhb;
      e = Aila + Tachaite;
    } else if (elm === "|.0.|.0.|.|.|.0.|.|.|.0.|.|.|.0") {
      b = "   فَعْلُنْ فَعِلُنْ فَعِلُنْ فَعِلُنْ  ";
      c = Motadarak + " " + Tam;
      d = mkhb;
      e = Aila + Tachaite;
    } else if (elm === "|.0.|.0.|.0.|.0.|.|.|.0.|.|.|.0") {
      b = "   فَعْلُنْ فَعْلُنْ فَعِلُنْ فَعِلُنْ  ";
      c = Motadarak + " " + Tam;
      d = mkhb;
      e = Aila + Tachaite;
    } else if (elm === "|.|.|.0.|.|.|.0.|.0.|.0.|.|.|.0") {
      b = "   فَعِلُنْ فَعِلُنْ فَعْلُنْ فَعِلُنْ  ";
      c = Motadarak + " " + Tam;
      d = mkhb;
      e = Aila + Tachaite;
    } else if (elm === "|.|.|.0.|.0.|.0.|.|.|.0.|.|.|.0") {
      b = "   فَعِلُنْ فَعْلُنْ فَعِلُنْ فَعِلُنْ  ";
      c = Motadarak + " " + Tam;
      d = mkhb;
      e = Aila + Tachaite;
    } else if (elm === "|.0.|.0.|.|.|.0.|.0.|.0.|.|.|.0") {
      b = "   فَعْلُنْ فَعِلُنْ فَعْلُنْ فَعِلُنْ  ";
      c = Motadarak + " " + Tam;
      d = mkhb;
      e = Aila + Tachaite;
    }
    if (elm === "|.0.|.|.0.|.0.|.|.0.|.0.|.|.0.|.|.|.0") {
      b = "   فَاعِلُنْ فَاعِلُنْ فَاعِلُنْ فَعِلُنْ  ";
      c = Motadarak + " " + Tam;
      d = mkhb;
    } else if (elm === "|.|.|.0.|.|.|.0.|.|.|.0.|.|.|.0") {
      b = "   فَعِلُنْ فَعِلُنْ فَعِلُنْ فَعِلُنْ  ";
      c = Motadarak + " " + Tam;
      d = kt1;
      e = Aila + Aa;
    } else if (elm === "|.|.|.0.|.|.|.0.|.0.|.|.0.|.|.|.0") {
      b = "   فَعِلُنْ فَعِلُنْ فَاعِلُنْ فَعِلُنْ  ";
      c = Motadarak + " " + Tam;
      d = mkhb;
      e = Aila + Aa;
    } else if (elm === "|.0.|.|.0.|.|.|.0.|.|.|.0.|.|.|.0") {
      b = "   فَاعِلُنْ فَعِلُنْ فَعِلُنْ فَعِلُنْ  ";
      c = Motadarak + " " + Tam;
      d = mkhb;
      e = Aila + Aa;
    } else if (elm === "|.|.|.0.|.0.|.|.0.|.0.|.|.0.|.|.|.0") {
      b = "   فَعِلُنْ فَاعِلُنْ فَاعِلُنْ فَعِلُنْ  ";
      c = Motadarak + " " + Tam;
      d = mkhb;
      e = Aila + Aa;
    } else if (elm === "|.0.|.|.0.|.|.|.0.|.0.|.|.0.|.|.|.0") {
      b = "   فَاعِلُنْ فَعِلُنْ فَاعِلُنْ فَعِلُنْ  ";
      c = Motadarak + " " + Tam;
      d = mkhb;
      e = Aila + Aa;
    } else if (elm === "|.0.|.|.0.|.0.|.|.0.|.|.|.0.|.|.|.0") {
      b = "   فَاعِلُنْ فَاعِلُنْ فَعِلُنْ فَعِلُنْ  ";
      c = Motadarak + " " + Tam;
      d = mkhb;
      e = Aila + Aa;
    } else if (elm === "|.0.|.0.|.0.|.0.|.0.|.0.|.|.|.0") {
    /*--*/
      b = "   فَعْلُنْ فَعْلُنْ فَعْلُنْ فَعِلُنْ  ";
      c = Motadarak + " " + Tam;
      d = mkhb;
      e = Aila + Tachaite;
    } else if (elm === "|.0.|.0.|.0.|.0.|.0.|.|.0.|.|.|.0") {
      b = "   فَعْلُنْ فَعْلُنْ فَاعِلُنْ فَعِلُنْ  ";
      c = Motadarak + " " + Tam;
      d = mkhb;
      e = Aila + Tachaite;
    } else if (elm === "|.0.|.|.0.|.0.|.0.|.0.|.0.|.|.|.0") {
      b = "   فَاعِلُنْ فَعْلُنْ فَعْلُنْ فَعِلُنْ  ";
      c = Motadarak + " " + Tam;
      d = mkhb;
      e = Aila + Tachaite;
    } else if (elm === "|.0.|.0.|.0.|.|.0.|.0.|.|.0.|.|.|.0") {
      b = "   فَعْلُنْ فَاعِلُنْ فَاعِلُنْ فَعِلُنْ  ";
      c = Motadarak + " " + Tam;
      d = mkhb;
      e = Aila + Tachaite;
    } else if (elm === "|.0.|.|.0.|.0.|.0.|.0.|.|.0.|.|.|.0") {
      b = "   فَاعِلُنْ فَعْلُنْ فَاعِلُنْ فَعِلُنْ  ";
      c = Motadarak + " " + Tam;
      d = mkhb;
      e = Aila + Tachaite;
    } else if (elm === "|.0.|.|.0.|.0.|.|.0.|.0.|.0.|.|.|.0") {
      b = "   فَاعِلُنْ فَاعِلُنْ فَعْلُنْ فَعِلُنْ  ";
      c = Motadarak + " " + Tam;
      d = mkhb;
      e = Aila + Tachaite;
    } else if (elm === "|.0.|.0.|.|.|.0.|.0.|.|.0.|.|.|.0") {
    /*----*/
      b = "   فَعْلُنْ فَعِلُنْ فَاعِلُنْ فَعِلُنْ  ";
      c = Motadarak + " " + Tam;
      d = mkhb;
      e = Aila + Tachaite + " و " + Aa;
    } else if (elm === "|.0.|.|.0.|.0.|.0.|.|.|.|.0.|.|.|.0") {
      b = "   فَاعِلُنْ فَعْلُنْ فَعِلُنْ فَعِلُنْ  ";
      c = Motadarak + " " + Tam;
      d = mkhb;
      e = Aila + Tachaite;
    } else if (elm === "|.|.|.0.|.0.|.0.|.0.|.|.0.|.|.|.0") {
      b = "   فَعِلُنْ فَعْلُنْ فَاعِلُنْ فَعِلُنْ  ";
      c = Motadarak + " " + Tam;
      d = mkhb;
      e = Aila + Tachaite;
    } else if (elm === "|.0.|.|.0.|.|.|.|.0.|.0.|.0.|.|.|.0") {
      b = "   فَاعِلُنْ فَعِلُنْ فَعْلُنْ فَعِلُنْ  ";
      c = Motadarak + " " + Tam;
      d = mkhb;
      e = Aila + Tachaite;
    } else if (elm === "|.|.|.0.|.0.|.0.|.0.|.0.|.|.|.0") {
      b = "   فَعِلُنْ فَعْلُنْ فَعْلُنْ فَعِلُنْ  ";
      c = Motadarak + " " + Tam;
      d = mkhb;
      e = Aila + Tachaite;
    } else if (elm === "|.0.|.0.|.|.|.0.|.|.|.0.|.|.|.0") {
      b = "   فَعْلُنْ فَعِلُنْ فَعِلُنْ فَعِلُنْ  ";
      c = Motadarak + " " + Tam;
      d = mkhb;
      e = Aila + Tachaite;
    } else if (elm === "|.0.|.0.|.0.|.0.|.|.|.0.|.|.|.0") {
      b = "   فَعْلُنْ فَعْلُنْ فَعِلُنْ فَعِلُنْ  ";
      c = Motadarak + " " + Tam;
      d = mkhb;
      e = Aila + Tachaite;
    } else if (elm === "|.|.|.0.|.|.|.0.|.0.|.0.|.|.|.0") {
      b = "   فَعِلُنْ فَعِلُنْ فَعْلُنْ فَعِلُنْ  ";
      c = Motadarak + " " + Tam;
      d = mkhb;
      e = Aila + Tachaite;
    } else if (elm === "|.|.|.0.|.0.|.0.|.|.|.0.|.|.|.0") {
      b = "   فَعِلُنْ فَعْلُنْ فَعِلُنْ فَعِلُنْ  ";
      c = Motadarak + " " + Tam;
      d = mkhb;
      e = Aila + Tachaite;
    } else if (elm === "|.0.|.0.|.|.|.0.|.0.|.0.|.|.|.0") {
      b = "   فَعْلُنْ فَعِلُنْ فَعْلُنْ فَعِلُنْ  ";
      c = Motadarak + " " + Tam;
      d = mkhb;
      e = Aila + Tachaite;
    }

    result.push({ a, b, c, d, e });
  });
  return result;
}

module.exports = transform_to_json;
